// https://data.egov.bg/data/view/b56288b6-25aa-4049-9aa6-de2cd4cdabf8

let s = [];

// София
s[1] = {l: '91 НЕГ', n: '91 НЕМСКА ЕЗИКОВА ГИМНАЗИЯ Професор Константин Гълъбов', b: [null, 5.624, 5.64, 5.7, 5.63], m: [null, 5.782, null, 5.75, 5.63]};
s[2] = {l: 'Американски Колеж', n: 'АМЕРИКАНСКИ КОЛЕЖ В СОФИЯ', b: [null, 5.546, 5.51, 5.59, 5.52], m: [null, 5.934, null, 5.74, 5.67]};
s[3] = {l: 'ПЧМГ', n: 'Първа Частна Математическа Гимназия', b: [null, null, 5.41, 5.55, 5.45], m: [null, null, null, 5.78, 5.78]};
s[4] = {l: '164 СУ (Испанската)', n: '164 гимназия с преподаване на испански език Мигел де Сервантес', b: [null, 5.605, 5.54, 5.56, 5.62], m: [null, 5.538, null, 5.55, 5.67]};
s[5] = {l: 'СМГ', n: 'Софийска математическа гимназия Паисий Хилендарски', b: [null, 5.517, 5.44, 5.48, 5.42], m: [null, 5.828, null, 5.74, 5.68]};
s[6] = {l: '73 СУ', n: '73 СУ с преподаване на чужди езици Владислав Граматик', b: [null, 5.585, 5.6, 5.63, 5.58], m: [null, 5.623, null, 5.54, 5.24]};
s[7] = {l: '1 АЕГ', n: 'Първа английска езикова гимназия', b: [null, 5.469, 5.37, 5.44, 5.36], m: [null, 5.837, null, 5.62, 5.61]};
s[8] = {l: '2 АЕГ', n: 'Втора английска езикова гимназия Томас Джеферсън', b: [null, 5.309, 5.33, 5.38, 5.31], m: [null, 5.717, null, 5.55, 5.52]};
s[9] = {l: 'ЧЕСУ Дорис Тенеди', n: 'Частно езиково средно училище Дорис Тенеди', b: [null, 5.341, 5.46, 5.3, 5.15], m: [null, 5.726, null, 5.73, 5.44]};
s[10] = {l: 'ЧПГ Меридиан 22', n: 'Частна профилирана гимназия с чуждоезиково обучение Меридиан 22', b: [null, 5.167, 5.13, 5.37, 5.04], m: [null, 5.6, null, 5.61, 5.46]};
s[11] = {l: '9 ФЕГ', n: '9 Френска езикова гимназия Алфонс дьо Ламартин', b: [null, 5.324, 5.28, 5.45, 5.26], m: [null, 5.409, null, 5.33, 5.22]};
s[12] = {l: 'НПМГ', n: 'Национална природо-математическа гимназия Академик Любомир Чакалов', b: [null, 5.143, 5.19, 5.28, 5.17], m: [null, 5.537, null, 5.49, 5.4]};
s[13] = {l: 'ЧНГ Ерих Кестнер', n: 'ЧАСТНА НЕМСКА ГИМНАЗИЯ ЕРИХ КЕСТНЕР', b: [null, 5.249, 5.25, 5.39, 5.1], m: [null, 5.507, null, 5.46, 5.33]};
s[14] = {l: 'ЧЕГ Проф. Иван Апостолов', n: 'Частна езикова гимназия Проф Иван Апостолов', b: [null, 4.902, 5.12, 4.89, 5.14], m: [null, 5.838, null, 5.54, 5.67]};
s[15] = {l: 'ЧЕГ Проф. д-р В. Златарски', n: 'ЧАСТНА ЕЗИКОВА ГИМНАЗИЯ ПРОФ Д-Р В ЗЛАТАРСКИ', b: [null, 5.003, 5.18, 5.09, 4.91], m: [null, 5.82, null, 5.64, 5.54]};
s[16] = {l: 'НГДЕК', n: 'Национална гимназия за древни езици и култури Константин Кирил Философ', b: [null, 5.426, 5.18, 5.3, 5.36], m: [null, 5.454, null, 5.23, 5.24]};
s[17] = {l: '133 СУ', n: '133 Средно училище „Александър Сергеевич Пушкин”', b: [null, 5.296, 5.21, 5.34, 5.25], m: [null, 5.449, null, 5.27, 5.22]};
s[18] = {l: '32 СУ', n: '32  СРЕДНО УЧИЛИЩЕ С ИЗУЧАВАНЕ НА ЧУЖДИ ЕЗИЦИ СВЕТИ КЛИМЕНТ ОХРИДСКИ', b: [null, 5.254, 5.02, 5.19, 5.25], m: [null, 5.653, null, 5.25, 5.56]};
s[19] = {l: 'СУ ЛУИ БРАЙЛ', n: 'Специално училище за ученици с нарушено зрение ЛУИ БРАЙЛ', b: [null, 4.647, 4.92, 5.6, 5.31], m: [null, 4.412, null, 5.71, 4.58]};
s[20] = {l: '35 СУ', n: '35  СРЕДНО ЕЗИКОВО УЧИЛИЩЕ ДОБРИ ВОЙНИКОВ', b: [null, 5.276, 5.34, 5.42, 5.31], m: [null, 5.125, null, 5.06, 4.97]};
s[21] = {l: 'ЧСУ Увекинд', n: 'Частно средно училище УВЕКИНД', b: [null, 4.826, 4.8, 5.15, 4.83], m: [null, 5.65, null, 5.65, 5.63]};
s[22] = {l: '22 СУ', n: '22 Средно езиково училище Георги Стойков Раковски', b: [null, 5.109, 5.16, 5.21, 5.17], m: [null, 5.425, null, 5.25, 5.25]};
s[23] = {l: '31 СУ', n: '31 Средно училище за чужди езици и математика Иван Вазов', b: [null, 5.25, 5.19, 5.2, 5.12], m: [null, 5.539, null, 5.23, 5.23]};
s[24] = {l: 'НУКК', n: 'НУКК (Италиански лицей)', b: [null, 5.062, 4.92, 5.2, 5.17], m: [null, 5.562, null, 5.38, 5.22]};
s[25] = {l: 'ЧСУ Св. Георги', n: 'Частно средно училище Свети Георги', b: [null, null, null, null, 4.45], m: [null, null, null, null, 5.86]};
s[26] = {l: '18 СУ', n: '18 Средно училище Уилям Гладстон', b: [null, 5.201, 5.13, 5.17, 5.05], m: [null, 5.414, null, 5.15, 5.13]};
s[27] = {l: 'ТУЕС', n: 'Технологично училище Електронни системи към Технически Университет - София', b: [null, 4.916, 4.9, 5.06, 5.11], m: [null, 5.604, null, 5.27, 5.22]};
s[28] = {l: 'ЧСУ Веда', n: 'Частно средно училище с немски език Веда', b: [null, 5.045, 5.01, 4.7, 5.15], m: [null, 5.637, null, 5.16, 5.42]};
s[29] = {l: 'ЧСУ Абрахам Линкълн', n: 'Частно средно училище с чуждоезиков профил Абрахам Линкълн', b: [null, null, null, 4.67, null], m: [null, null, null, 5.49, null]};
s[30] = {l: '134 СУ', n: '134  средно училище Димчо Дебелянов', b: [null, 4.867, 4.86, 4.9, 4.84], m: [null, 5.307, null, 5.14, 5.37]};
s[31] = {l: 'Национална Финансово-ССтопанска Гимназия', n: 'НАЦИОНАЛНА ФИНАНСОВО-СТОПАНСКА ГИМНАЗИЯ', b: [null, 5.108, 5.09, 5.05, 4.85], m: [null, 5.351, null, 4.97, 4.94]};
s[32] = {l: '157 СУ', n: '157 Гимназия с изучаване на чужд език Сесар Вайехо', b: [null, 5.133, 4.95, 5.07, 4.88], m: [null, 4.998, null, 4.94, 4.87]};
s[33] = {l: 'Национална Търговско-Банкова Гимназия', n: 'НАЦИОНАЛНА ТЪРГОВСКО - БАНКОВА ГИМНАЗИЯ', b: [null, 5.026, 4.82, 5.0, 4.87], m: [null, 5.258, null, 5.0, 4.85]};
s[34] = {l: '127 СУ', n: '127 СРЕДНО УЧИЛИЩЕ Иван Николаевич Денкоглу', b: [null, 4.818, 4.79, 4.97, 4.74], m: [null, 5.228, null, 5.01, 4.84]};
s[35] = {l: '30 СУ', n: '30 СРЕДНО УЧИЛИЩЕ БРАТЯ МИЛАДИНОВИ', b: [null, 5.112, 4.92, 4.78, 4.78], m: [null, 5.021, null, 4.91, 4.83]};
s[36] = {l: 'ЧСЕУ Британика', n: 'Частно средно езиково училище Британика', b: [null, 4.431, 4.77, 4.51, 4.74], m: [null, 5.038, null, 5.27, 4.78]};
s[37] = {l: '7 СУ', n: '7  СРЕДНО УЧИЛИЩЕ СВ  СЕДМОЧИСЛЕНИЦИ', b: [null, 4.727, 4.69, 4.7, 4.6], m: [null, 5.432, null, 5.1, 4.97]};
s[38] = {l: 'Гимназия по строителство, архитектура и геодезия', n: 'СОФИЙСКА ГИМНАЗИЯ ПО СТРОИТЕЛСТВО, АРХИТЕКТУРА И ГЕОДЕЗИЯ ХРИСТО БОТЕВ', b: [null, 4.881, 4.79, 4.88, 4.94], m: [null, 4.93, null, 4.45, 4.79]};
s[39] = {l: '51 СУ', n: '51 СРЕДНО УЧИЛИЩЕ ЕЛИСАВЕТА БАГРЯНА', b: [null, 4.452, 4.42, 4.8, 4.58], m: [null, 4.822, null, 5.02, 4.97]};
s[40] = {l: 'ЧСУ Цар Симеон Велики', n: 'Частно средно училище Цар Симеон Велики', b: [null, null, null, 3.81, 5.21], m: [null, null, null, 4.61, 5.27]};
s[41] = {l: 'Първа частна английска гимназия', n: 'Първа частна английска гимназия Уилям Шекспир-Интелект Инвест', b: [null, 4.523, 4.53, 4.49, 4.37], m: [null, 5.465, null, 5.17, 5.06]};
s[42] = {l: 'НМУ Любомир Пипков', n: 'Национално музикално училище Любомир Пипков', b: [null, 4.621, 4.48, 4.62, 4.74], m: [null, 4.993, null, 4.64, 5.07]};
s[43] = {l: 'ЧСУ Дружба', n: 'Частно средно училище Дружба - София', b: [null, 4.659, 4.54, 4.62, 4.48], m: [null, 5.383, null, 4.93, 4.87]};
s[44] = {l: 'Румънска гимназия', n: 'Профилирана гимназия с интензивно изучаване на румънски език МИХАЙ ЕМИНЕСКУ', b: [null, 3.962, 4.42, 4.71, 4.72], m: [null, 4.248, null, 4.68, 4.82]};
s[45] = {l: '119 СУ', n: '119 Средно училище Академик Михаил Арнаудов', b: [null, 4.501, 4.45, 4.59, 4.58], m: [null, 4.908, null, 4.84, 4.87]};
s[46] = {l: 'ЧПГ Банкер', n: 'ЧАСТНА ПРОФЕСИОНАЛНА ГИМНАЗИЯ БАНКЕР', b: [null, 4.867, 4.71, 4.64, 4.63], m: [null, null, null, null, null]};
s[47] = {l: 'Национална гимназия за приложни изкуства', n: 'НАЦИОНАЛНА ГИМНАЗИЯ ЗА ПРИЛОЖНИ ИЗКУСТВА СВЕТИ ЛУКА - СОФИЯ', b: [null, 4.457, 4.34, 4.6, 4.52], m: [null, 3.732, null, 4.85, 4.95]};
s[48] = {l: '33 ЕГ', n: '33  Езикова гимназия Света София', b: [null, 4.413, 4.39, 4.6, 4.67], m: [null, 4.693, null, 4.54, 4.93]};
s[49] = {l: '19 СУ', n: '19 СРЕДНО УЧИЛИЩЕ ЕЛИН ПЕЛИН', b: [null, 4.35, 4.45, 4.57, 4.57], m: [null, 4.697, null, 4.67, 4.82]};
s[50] = {l: 'ПГ по електроника Джон Атанасов', n: 'СОФИЙСКА ПРОФЕСИОНАЛНА ГИМНАЗИЯ по ЕЛЕКТРОНИКА Джон Атанасов', b: [null, 4.483, 4.4, 4.58, 4.58], m: [null, 4.972, null, 4.85, 4.67]};
s[51] = {l: '2 СУ', n: '2 Средно училище Академик Емилиян Станев', b: [null, 4.561, 4.46, 4.48, 4.45], m: [null, 4.911, null, 4.82, 4.82]};
s[52] = {l: '12 СУ', n: '12 Средно училище Цар Иван Асен II', b: [null, 4.519, 4.55, 4.48, 4.55], m: [null, 4.974, null, 4.66, 4.73]};
s[53] = {l: '21 СУ', n: '21 СРЕДНО УЧИЛИЩЕ ХРИСТО БОТЕВ', b: [null, 4.387, 4.35, 4.34, 4.6], m: [null, 5.167, null, 4.63, 4.97]};
s[54] = {l: 'ЧПГ Образователни технологии', n: 'Частна профилирана гимназия Образователни технологии', b: [null, 4.561, 4.25, 4.59, 4.44], m: [null, 5.383, null, 4.71, 4.89]};
s[55] = {l: 'Национално училище за изящни изкуства', n: 'Национално училище за изящни изкуства Илия Петров', b: [null, 4.491, 4.55, 4.62, 4.64], m: [null, 5.93, null, 4.88, 4.03]};
s[56] = {l: '1 СУ', n: '1 Средно училище Пенчо П  Славейков', b: [null, 4.483, 4.47, 4.54, 4.36], m: [null, 4.805, null, 4.46, 4.64]};
s[57] = {l: 'ПГ ПО ПРЕЦИЗНА ТЕХНИКА И ОПТИКА', n: 'НАЦИОНАЛНА ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО ПРЕЦИЗНА ТЕХНИКА И ОПТИКА М  В  Ломоносов', b: [null, 4.432, 4.25, 4.52, 4.42], m: [null, 4.861, null, 4.56, 4.65]};
s[58] = {l: '138 СУ', n: '138  СРЕДНО УЧИЛИЩЕ ЗА ЗАПАДНИ И ИЗТОЧНИ ЕЗИЦИ ПРОФ  ВАСИЛ ЗЛАТАРСКИ', b: [null, 4.575, 4.58, 4.47, 4.37], m: [null, 4.949, null, 4.55, 4.43]};
s[59] = {l: '54 СУ', n: '54  СРЕДНО УЧИЛИЩЕ Свети ИВАН РИЛСКИ', b: [null, 4.424, 4.54, 4.37, 4.28], m: [null, 4.897, null, 4.55, 4.53]};
s[60] = {l: '56 СУ', n: '56  Средно училище Професор Константин Иречек', b: [null, 4.19, 4.24, 4.29, 4.61], m: [null, 4.323, null, 4.3, 4.76]};
s[61] = {l: 'ПГ по телекомуникации', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО ТЕЛЕКОМУНИКАЦИИ', b: [null, 4.151, 4.23, 4.33, 4.25], m: [null, 4.921, null, 4.66, 4.67]};
s[62] = {l: 'ПГ по туризъм', n: 'СОФИЙСКА ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО ТУРИЗЪМ', b: [null, 4.499, 4.34, 4.26, 4.22], m: [null, 4.58, null, 4.57, 4.7]};
s[63] = {l: '96 СУ', n: '96 Средно училище Лев Николаевич Толстой', b: [null, 4.58, 4.47, 4.41, 4.31], m: [null, 4.513, null, 4.52, 4.35]};
s[64] = {l: '137 СУ', n: '137 средно училище Ангел Кънчев', b: [null, 4.391, 4.05, 4.23, 4.39], m: [null, 4.918, null, 4.45, 4.85]};
s[65] = {l: 'Частна ПГ Езиков свят', n: 'Частна профилирана гимназия с чуждоезиково обучение Езиков свят', b: [null, 4.284, 4.15, 4.01, 4.63], m: [null, 5.317, null, 4.21, 4.96]};
s[66] = {l: 'ЧСУ Рьорих', n: 'ЧСУ Рьорих с ранно чуждоезиково обучение и разширено изучаване на музика и изобразително изкуство', b: [null, 4.14, null, 4.47, 4.06], m: [null, 4.86, null, 4.55, 4.41]};
s[67] = {l: '88 СУ', n: '88  Средно училище Димитър Попниколов', b: [null, 4.157, 4.48, 4.33, 3.97], m: [null, 4.659, null, 4.57, 4.45]};
s[68] = {l: '44 СУ', n: '44  Средно училище Неофит Бозвели', b: [null, 4.405, 4.39, 4.22, 4.51], m: [null, 4.405, null, 4.09, 4.54]};
s[69] = {l: 'У-ще за танцово изкуство', n: 'Национално училище за танцово изкуство', b: [null, 4.154, 4.14, 4.37, 4.45], m: [null, 3.396, null, null, null]};
s[70] = {l: '23 СУ', n: '23 Средно училище Фредерик Жолио-Кюри', b: [null, 4.137, 4.3, 4.28, 4.08], m: [null, 4.565, null, 4.53, 4.38]};
s[71] = {l: '105 СУ', n: '105  СРЕДНО УЧИЛИЩЕ АТАНАС ДАЛЧЕВ', b: [null, 4.42, 4.35, 4.16, 4.23], m: [null, 4.65, null, 4.4, 4.41]};
s[72] = {l: 'ПГ ПО ЕЛЕКТРОТЕХНИКА И АВТОМАТИКА', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО ЕЛЕКТРОТЕХНИКА И АВТОМАТИКА', b: [null, 4.079, 4.04, 4.18, 4.09], m: [null, 4.627, null, 4.58, 4.52]};
s[73] = {l: '81 СУ', n: '81  Средно училище Виктор Юго', b: [null, 4.286, 4.2, 4.08, 4.33], m: [null, 4.848, null, 4.16, 4.53]};
s[74] = {l: 'ПГ по екология и биотехнологии', n: 'Професионална гимназия по екология и биотехнологии Проф  д-р Асен Златаров', b: [null, 4.262, 4.26, 4.29, 4.21], m: [null, 4.418, null, 4.43, 4.09]};
s[75] = {l: 'ЧСУ Орфей', n: 'Частно средно училище Орфей', b: [null, 3.965, 3.78, 3.74, 4.13], m: [null, 4.672, null, 4.84, 4.75]};
s[76] = {l: 'ПГ по дизайн Елисавета Вазова', n: 'Професионална гимназия по дизайн Елисавета Вазова', b: [null, 4.233, 3.93, 4.21, 4.19], m: [null, 4.415, null, 4.03, 4.82]};
s[77] = {l: '203 Профилирана ЕГ Свети Методий', n: '203 Профилирана езикова гимназия Свети Методий', b: [null, 4.304, 4.07, 4.26, 4.05], m: [null, 4.835, null, 4.47, 4.3]};
s[78] = {l: '36 СУ', n: '36 Средно училище Максим Горки', b: [null, 4.237, 4.22, 4.03, 4.08], m: [null, 4.709, null, 4.3, 4.37]};
s[79] = {l: 'ЧПГ ПО БАНКОВО ДЕЛО, ТЪРГОВИЯ И ФИНАНСИ', n: 'ЧАСТНА ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО БАНКОВО ДЕЛО ТЪРГОВИЯ И ФИНАНСИ', b: [null, 4.187, 4.07, 4.07, null], m: [null, 5.018, null, 4.46, null]};
s[80] = {l: '118 СУ', n: '118 Средно училище Академик Людмил Стоянов', b: [null, 4.109, 3.92, 4.26, 4.01], m: [null, 4.494, null, 4.19, 4.59]};
s[81] = {l: '144 СУ', n: '144 Средно училище Народни будители', b: [null, 4.127, 4.12, 4.3, 4.1], m: [null, 4.077, null, 4.21, 4.23]};
s[82] = {l: 'ПГ за изобразителни изкуства', n: 'Профилирана гимназия за изобразителни изкуства Професор Николай Райнов', b: [null, 4.19, 3.92, 4.28, 4.34], m: [null, 3.45, null, null, 4.18]};
s[83] = {l: 'ПГ по полиграфия и фотография', n: 'Национална професионална гимназия по полиграфия и фотография', b: [null, 4.771, 4.57, 4.36, 4.57], m: [null, null, null, null, 3.14]};
s[84] = {l: '101 СУ', n: '101  СРЕДНО УЧИЛИЩЕ БАЧО КИРО', b: [null, 3.815, 3.97, 4.15, 3.93], m: [null, 3.948, null, 4.23, 4.33]};
s[85] = {l: '135 СУ', n: '135 средно училище Ян Амос Коменски', b: [null, 3.906, 3.77, 4.11, 4.14], m: [null, 3.973, null, 4.26, 4.23]};
s[86] = {l: 'Частно профилирано СУ Свети Наум', n: 'Частно профилирано средно училище Свети Наум', b: [null, 4.636, 4.35, 4.55, 3.73], m: [null, 5.46, null, 4.61, 3.26]};
s[87] = {l: '128 СУ', n: '128 СРЕДНО УЧИЛИЩЕ АЛБЕРТ АЙНЩАЙН', b: [null, 4.309, 3.89, 3.97, 4.02], m: [null, 4.584, null, 4.23, 4.34]};
s[88] = {l: '39 СУ', n: '39 Средно училище Петър Динеков', b: [null, 3.915, 3.74, 4.59, 3.64], m: [null, 4.554, null, 4.9, 3.39]};
s[89] = {l: '26 СУ', n: '26 Средно училище Йордан Йовков', b: [null, 4.015, 3.49, 4.01, 4.02], m: [null, 4.25, null, 4.45, 4.24]};
s[90] = {l: 'НАЦИОНАЛНО СРЕДНО УЧИЛИЩЕ СОФИЯ', n: 'НАЦИОНАЛНО СРЕДНО УЧИЛИЩЕ СОФИЯ', b: [null, 4.037, 3.96, 4.04, 3.7], m: [null, 4.24, null, 4.24, 4.27]};
s[91] = {l: 'Духовно Училище Софийска духовна семинария Св  Иван Рилски', n: 'Духовно Училище Софийска духовна семинария Св  Иван Рилски', b: [null, 3.773, 3.66, 3.89, 4.03], m: [null, 3.768, null, 3.95, 4.67]};
s[92] = {l: 'Професионална гимназия по облекло', n: 'Професионална гимназия по облекло Княгиня Мария Луиза', b: [null, 4.077, 4.06, 3.87, 4.02], m: [null, 4.455, null, 4.58, 3.62]};
s[93] = {l: '95 СУ', n: '95 СУ Проф  Иван Шишманов', b: [null, 3.931, 3.87, 3.91, 4.01], m: [null, 4.098, null, 3.99, 4.36]};
s[94] = {l: '97 СУ', n: '97 Средно училище Братя Миладинови', b: [null, 3.957, 3.9, 3.97, 3.76], m: [null, 3.924, null, 4.13, 4.38]};
s[95] = {l: '132 СУ', n: '132  Средно училище Ваня Войнова', b: [null, 3.906, 3.57, 4.06, 3.95], m: [null, 4.012, null, 4.19, 4.24]};
s[96] = {l: '79 СУ', n: '79 средно училище Индира Ганди', b: [null, 4.204, 3.74, 3.65, 4.11], m: [null, 4.213, null, 4.04, 4.38]};
s[97] = {l: '108 СУ', n: '108 Средно училище Никола Беловеждов', b: [null, 4.178, 3.93, 3.95, 3.89], m: [null, 4.537, null, 4.0, 4.06]};
s[98] = {l: '131 СУ', n: '131  СУ Климент Аркадиевич Тимирязев', b: [null, 3.942, 4.12, 3.92, 3.9], m: [null, 3.94, null, 3.85, 4.02]};
s[99] = {l: 'ПГ ПО АУДИО-, ВИДЕО- И ТЕЛЕКОМУНИКАЦИЯ', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО АУДИО-, ВИДЕО- И ТЕЛЕКОМУНИКАЦИЯ А  С  ПОПОВ', b: [null, 3.926, 3.72, 3.97, 3.79], m: [null, 4.365, null, 4.12, 4.12]};
s[100] = {l: 'СПОРТНО УЧИЛИЩЕ ГЕН. ВЛАДИМИР СТОЙЧЕВ', n: 'СПОРТНО УЧИЛИЩЕ ГЕН  ВЛАДИМИР СТОЙЧЕВ', b: [null, 3.859, 3.72, 3.88, 3.77], m: [null, 4.091, null, 4.2, 4.12]};

// Пловдив
s[101] = {l: 'ЕГ Пловдив', n: 'Езикова гимназия Пловдив', b: [null, 5.6, 5.5, 5.43, 5.34], m: [null, 5.846, null, 5.62, 5.47]};
s[102] = {l: 'ЕГ Иван Вазов', n: 'Езикова гимназия Иван Вазов', b: [null, 5.512, 5.34, 5.4, 5.3], m: [null, 5.382, null, 5.2, 5.18]};
s[103] = {l: 'МГ Академик Кирил Попов', n: 'Математическа гимназия Академик Кирил Попов', b: [null, 5.274, 5.24, 5.26, 5.18], m: [null, 5.337, null, 5.25, 5.17]};
s[104] = {l: 'Национална търговска гимназия', n: 'Национална търговска гимназия - Пловдив', b: [null, 5.418, 4.99, 5.24, 5.08], m: [null, 5.401, null, 5.29, 5.14]};
s[105] = {l: 'Хуманитарна гимназия', n: 'Хуманитарна гимназия Св  Св  Кирил и Методий', b: [null, 5.128, 5.09, 5.11, 5.08], m: [null, 5.183, null, 5.01, 5.12]};
s[106] = {l: 'ФЕГ Антоан дьо Сент - Екзюпери', n: 'Френска езикова гимназия Антоан дьо Сент - Екзюпери', b: [null, 5.089, 4.95, 4.97, 4.74], m: [null, 5.113, null, 4.89, 4.92]};
s[107] = {l: 'СУ Св. Патриарх Евтимий', n: 'Средно училище Свети Патриарх Евтимий', b: [null, 4.839, 4.69, 4.94, 4.64], m: [null, 4.902, null, 4.75, 4.69]};
s[108] = {l: 'ЧСУ Дружба', n: 'ЧАСТНО СРЕДНО УЧИЛИЩЕ ДРУЖБА', b: [null, 4.171, 4.94, 4.62, 4.52], m: [null, 4.585, null, 5.11, 4.51]};
s[109] = {l: 'ЧЕГ Стоян Сариев', n: 'Частна езикова гимназия Стоян Сариев', b: [null, 4.89, 4.37, 4.16, 4.39], m: [null, 5.192, null, 5.17, 4.92]};
s[110] = {l: 'НУМТИ', n: 'Национално училище за музикално и танцово изкуство Добрин Петков', b: [null, 4.772, 4.58, 4.58, 4.57], m: [null, 4.915, null, 4.73, 4.37]};
s[111] = {l: 'Национална художествена гимназия', n: 'Национална художествена гимназия Цанко Лавренов', b: [null, 4.671, 4.44, 4.6, 4.39], m: [null, null, null, null, null]};
s[112] = {l: 'ЧПГ Класик', n: 'Частна профилирана гимназия Класик', b: [null, 4.438, 4.72, 4.18, 4.25], m: [null, 4.993, null, 4.73, 4.41]};
s[113] = {l: 'ЧПГ по икономика и управление', n: 'Частна професионална гимназия по икономика и управление', b: [null, 4.018, 4.28, 4.4, 3.69], m: [null, 4.753, null, 5.19, 4.49]};
s[114] = {l: 'СУ Черноризец Храбър', n: 'СРЕДНО УЧИЛИЩЕ ЧЕРНОРИЗЕЦ ХРАБЪР', b: [null, 4.525, 4.33, 4.32, 4.23], m: [null, 4.363, null, 4.44, 4.61]};
s[115] = {l: 'СУ Св. ПаисийХилендарски', n: 'Средно училище СВ  ПАИСИЙ ХИЛЕНДАРСКИ', b: [null, 4.389, 4.24, 4.22, 4.45], m: [null, 4.709, null, 4.32, 4.62]};
s[116] = {l: 'СУ Св. Софроний Врачански', n: 'Средно училище Свети Софроний Врачански', b: [null, 4.01, 4.18, 4.27, 4.44], m: [null, 3.9, null, 4.64, 4.32]};
s[117] = {l: 'Гимназия за сценични и екранни изкуства', n: 'Национална гимназия за сценични и екранни изкуства', b: [null, 4.227, 4.26, 4.36, 4.08], m: [null, null, null, 5.01, 3.39]};
s[118] = {l: 'ПГ по архитектура строителство и геодезия', n: 'Професионална гимназия по архитектура строителство и геодезия Арх Камен Петков', b: [null, 4.486, 4.18, 4.27, 4.25], m: [null, 4.399, null, 4.2, 4.2]};
s[119] = {l: 'ПГ по електротехника и електроника', n: 'Професионална гимназия по електротехника и електроника', b: [null, 4.415, 4.01, 4.02, 4.31], m: [null, 4.67, null, 4.31, 4.44]};
s[120] = {l: 'СУ Св. Климент Охридски', n: 'Средно училище Свети Климент Охридски', b: [null, 4.15, 4.13, 4.01, 4.2], m: [null, 4.702, null, 4.25, 4.26]};
s[121] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Проф  д-р Асен Златаров', b: [null, 4.29, 4.08, 4.17, 4.04], m: [null, 4.242, null, 4.12, 4.04]};
s[122] = {l: 'Спортно училище Васил Левски', n: 'Спортно училище Васил Левски', b: [null, 3.907, 3.74, 3.82, 3.74], m: [null, 4.341, null, 4.23, 4.92]};
s[123] = {l: 'СУ Свети Константин - Кирил Философ', n: 'Средно училище Свети Константин - Кирил Философ', b: [null, 4.372, 4.12, 3.96, 3.79], m: [null, 4.247, null, 4.24, 4.14]};
s[124] = {l: 'СУ Константин Величков', n: 'Средно училище Константин Величков', b: [null, 4.246, 4.02, 3.97, 3.93], m: [null, 3.691, null, 4.24, 3.95]};
s[125] = {l: 'ПГ по хранителни технологии и техника', n: 'Професионална гимназия по хранителни технологии и техника', b: [null, 4.007, 3.86, 4.05, 4.02], m: [null, 4.105, null, 4.16, 3.8]};
s[126] = {l: 'СУ Любен Каравелов', n: 'Средно училище Любен Каравелов', b: [null, 3.892, 4.16, 3.73, 4.27], m: [null, 3.728, null, 3.7, 3.96]};
s[127] = {l: 'СУ Цар Симеон Велики', n: 'Средно училище Цар Симеон Велики', b: [null, 4.507, null, 3.9, 3.56], m: [null, 4.872, null, 4.36, 4.01]};
s[128] = {l: 'СУ Пейо Крачолов Яворов', n: 'Средно училище Пейо Крачолов Яворов', b: [null, 4.048, 3.83, 3.91, 3.86], m: [null, 4.192, null, 3.99, 4.15]};
s[129] = {l: 'СУ Св. Св. Кирил и Методий', n: 'Средно училище Свети свети Кирил и Методий', b: [null, 4.137, 3.69, 4.11, 3.7], m: [null, 4.099, null, 4.16, 3.95]};
s[130] = {l: 'ПГ по битова техника', n: 'Професионална гимназия по битова техника', b: [null, 3.849, 3.69, 3.64, 3.65], m: [null, 4.235, null, 3.99, 4.03]};
s[131] = {l: 'СУ Димитър Матевски', n: 'Средно училище Димитър Матевски', b: [null, 3.704, 3.82, 3.81, 3.71], m: [null, 3.79, null, 3.65, 3.95]};
s[132] = {l: 'СУ Христо Груев Данов', n: 'Средно училище Христо Груев Данов', b: [null, 4.117, 3.64, 3.68, 3.72], m: [null, 3.91, null, 3.96, 3.84]};
s[133] = {l: 'Духовна семинария Св. Св. Кирил и Методий', n: 'ДУ-Пловдивска духовна семинария Св  Св  Кирил и Методий -Пловдив', b: [null, 4.09, 3.69, 4.17, 3.8], m: [null, 3.952, null, 3.73, 3.45]};
s[134] = {l: 'ПГ по механотехника Професор Цветан Лазаров', n: 'Професионална гимназия по механотехника Професор Цветан Лазаров', b: [null, 3.765, 3.56, 3.62, 3.65], m: [null, 4.035, null, 3.8, 4.0]};
s[135] = {l: 'ПГ по облекло', n: 'Професионална гимназия по облекло Ана Май', b: [null, 3.675, 3.58, 3.56, 3.81], m: [null, 3.31, null, 3.49, 3.75]};
s[136] = {l: 'СУ Св. Седмочисленици', n: 'Средно училище Свети Седмочисленици', b: [null, 3.719, 3.53, 3.64, 3.52], m: [null, 3.814, null, 3.65, 3.83]};
s[137] = {l: 'ПГ по вътрешна архитектура и дървообработване', n: 'Професионална гимназия по вътрешна архитектура и дървообработване Христо Ботев', b: [null, 3.601, 3.28, 3.56, 3.53], m: [null, 3.412, null, 3.43, 3.79]};
s[138] = {l: 'СУ Никола Вапцаров', n: 'Средно училище Никола Вапцаров', b: [null, 3.502, 3.39, 3.2, 3.56], m: [null, 3.686, null, 3.1, 3.7]};
s[139] = {l: 'СУ Братя Миладинови', n: 'Средно училище Братя Миладинови', b: [null, 3.342, 3.34, 3.17, 3.45], m: [null, 3.589, null, 3.47, 3.48]};
s[140] = {l: 'ПГ по транспорт и строителни технологии', n: 'Професионална гимназия по транспорт и строителни технологии Гоце Делчев', b: [null, 3.493, 3.21, 3.16, 3.2], m: [null, 3.446, null, 3.33, 3.33]};

// Варна
s[141] = {l: 'Първа езикова гимназия', n: 'Първа езикова гимназия', b: [null, 5.499, 5.34, 5.39, 5.58], m: [null, 5.848, null, 5.63, 5.63]};
s[142] = {l: 'ГПЧЕ Йоан Екзарх', n: 'Гимназия с преподаване на чужди езици Йоан Екзарх', b: [null, 5.457, 5.38, 5.39, 5.4], m: [null, 5.51, null, 5.41, 5.32]};
s[143] = {l: 'МГ Д-р Петър Берон', n: 'Математическа гимназия Д-р Петър Берон', b: [null, 5.29, 5.14, 5.29, 5.37], m: [null, 5.533, null, 5.53, 5.43]};
s[144] = {l: 'ІV ЕГ Фредерик Жолио - Кюри', n: 'ІV Езикова гимназия Фредерик Жолио - Кюри', b: [null, 5.303, 5.13, 5.12, 5.15], m: [null, 5.353, null, 5.18, 5.22]};
s[145] = {l: 'ЧСУ Монтесори Варна ООД', n: 'Частно средно училище Монтесори Варна ООД', b: [null, null, null, null, 4.87], m: [null, null, null, null, 5.14]};
s[146] = {l: 'Трета ПМГ Академик Методий Попов', n: 'Трета природоматематическа гимназия Академик Методий Попов', b: [null, 4.831, 4.63, 4.79, 4.94], m: [null, 5.119, null, 4.78, 4.96]};
s[147] = {l: 'СУ с езиково обучение Ал  С  Пушкин', n: 'Средно училище с езиково обучение Ал  С  Пушкин', b: [null, 4.76, 4.77, 4.66, 4.91], m: [null, 4.96, null, 4.73, 5.0]};
s[148] = {l: 'ЧПГ Антоан дьо Сент-Екзюпери', n: 'Частна профилирана гимназия Антоан дьо Сент-Екзюпери', b: [null, 4.856, 4.57, 4.66, 4.6], m: [null, 5.469, null, 5.17, 5.04]};
s[149] = {l: 'СУ за хуманитарни науки и изкуства', n: 'Средно училище за хуманитарни науки и изкуства Константин Преславски', b: [null, 4.634, 4.65, 4.6, 4.63], m: [null, 4.723, null, 4.64, 4.68]};
s[150] = {l: 'Варненска търговска гимназия', n: 'Варненска търговска гимназия Георги Стойков Раковски', b: [null, 4.792, 4.49, 4.75, 4.57], m: [null, 4.848, null, 4.65, 4.51]};
s[151] = {l: 'СУ Св. Климент Охридски', n: 'Средно училище Свети Климент Охридски', b: [null, 4.592, 4.39, 4.29, 4.28], m: [null, 4.887, null, 4.9, 4.73]};
s[152] = {l: 'НУИ', n: 'НАЦИОНАЛНО УЧИЛИЩЕ ПО ИЗКУСТВАТА ДОБРИ ХРИСТОВ', b: [null, 4.44, 4.43, 4.61, 4.27], m: [null, 4.832, null, 4.64, 4.51]};
s[153] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Професор д-р Асен Златаров', b: [null, 4.414, 4.27, 4.27, 4.25], m: [null, 4.832, null, 4.84, 4.74]};
s[154] = {l: 'ЧЕГ с изучаване на чужди езици Джордж Байрон', n: 'Частна езикова гимназия с изучаване на чужди езици Джордж Байрон', b: [null, 4.46, 4.09, 4.25, 4.14], m: [null, 4.915, null, 5.08, 4.49]};
s[155] = {l: 'Специално училище за ученици с нарушено зрение', n: 'Специално училище за ученици с нарушено зрение Проф  д-р Иван Шишманов', b: [null, 4.176, null, 4.12, null], m: [null, 4.16, null, 4.47, null]};
s[156] = {l: 'СУ Димчо Дебелянов', n: 'Средно училище Димчо Дебелянов', b: [null, 4.041, null, 4.11, 4.41], m: [null, 4.105, null, 4.13, 4.41]};
s[157] = {l: 'СУ Гео Милев', n: 'Средно училище Гео Милев', b: [null, 4.156, 4.03, 4.12, 4.09], m: [null, 4.603, null, 4.45, 4.44]};
s[158] = {l: 'Професионална гимназия по икономика', n: 'Професионална гимназия по икономика Д-р Иван Богоров', b: [null, 4.374, 4.17, 4.38, 4.08], m: [null, 4.385, null, 4.13, 4.31]};
s[159] = {l: 'Частна Търговска Гимназия Конто Трейд ЕООД', n: 'Частна Търговска Гимназия Конто Трейд ЕООД', b: [null, 4.08, 4.23, 3.98, 4.18], m: [null, 4.254, null, 4.34, 4.32]};
s[160] = {l: 'Седмо средно училище', n: 'Седмо средно училище Найден Геров', b: [null, 4.12, 3.75, 3.75, 4.02], m: [null, 4.342, null, 4.09, 4.4]};
s[161] = {l: 'Спортно училище Г. Бенковски', n: 'Спортно училище Георги Бенковски', b: [null, 3.718, 3.69, 3.74, 3.69], m: [null, 4.413, null, 3.93, 4.78]};
s[162] = {l: 'ПГ по електротехника', n: 'Професионална гимназия по електротехника', b: [null, 4.014, 3.79, 3.81, 3.81], m: [null, 3.99, null, 4.17, 4.16]};
s[163] = {l: 'Варненска морска гимназия Св. Николай Чудотворец', n: 'Варненска морска гимназия Свети Николай Чудотворец', b: [null, 3.777, 3.54, 3.7, 3.75], m: [null, 3.968, null, 4.08, 4.09]};
s[164] = {l: 'Професионална техническа гимназия', n: 'Професионална техническа гимназия', b: [null, 3.844, 3.72, 3.71, 3.67], m: [null, 4.099, null, 4.04, 4.02]};
s[165] = {l: 'СУ Пейо Крачолов Яворов', n: 'Средно училище Пейо Крачолов Яворов', b: [null, 3.799, 3.78, 3.79, 3.7], m: [null, 3.95, null, 3.5, 4.24]};
s[166] = {l: 'ПГ по химични и хранително-вкусови технологии', n: 'Професионална гимназия по химични и хранително-вкусови технологии Дм Ив Менделеев', b: [null, 3.7, 3.83, 3.69, 3.52], m: [null, 3.856, null, 3.99, 3.67]};
s[167] = {l: 'ПГ по текстил и моден дизайн', n: 'Професионална гимназия по текстил и моден дизайн', b: [null, 3.681, 3.63, 3.65, 3.51], m: [null, 3.695, null, 3.87, 3.89]};
s[168] = {l: 'ПГ по строителство, архитектура и геодезия', n: 'Професионална гимназия по строителство архитектура и геодезия Васил Левски', b: [null, 3.948, 3.78, 3.77, 3.57], m: [null, 3.719, null, 3.69, 3.67]};
s[169] = {l: 'СУ Любен Каравелов', n: 'Средно училище Любен Каравелов', b: [null, 3.744, 3.55, 3.52, 3.68], m: [null, 3.681, null, 3.48, 3.7]};
s[170] = {l: 'ЧСУ Мечтатели', n: 'Частно средно училище Мечтатели', b: [null, null, null, 3.95, null], m: [null, null, null, 3.11, null]};

// Бургас
s[171] = {l: 'НЕГ Гьоте', n: 'Немска езикова гимназия Гьоте', b: [null, 5.449, 5.28, 5.45, 5.36], m: [null, 5.646, null, 5.57, 5.37]};
s[172] = {l: 'ППМГ Акад. Никола Обрешков', n: 'Профилирана природоматематическа гимназия Академик Никола Обрешков', b: [null, 5.489, 5.24, 5.33, 5.29], m: [null, 5.766, null, 5.65, 5.51]};
s[173] = {l: 'Английска ЕГ Гео Милев', n: 'Английска езикова гимназия Гео Милев', b: [null, 5.224, 5.06, 5.06, 4.97], m: [null, 5.775, null, 5.32, 5.43]};
s[174] = {l: 'Профилирана гимназия за романски езици', n: 'Профилирана гимназия за романски езици Георги Стойков Раковски', b: [null, 5.022, 4.88, 4.93, 4.89], m: [null, 5.095, null, 4.98, 5.13]};
s[175] = {l: 'Търговска гимназия', n: 'Търговска гимназия', b: [null, 4.99, 4.74, 4.92, 4.77], m: [null, 5.112, null, 4.9, 4.82]};
s[176] = {l: 'Профилирана гимназия за чужди езици Васил Левски', n: 'Профилирана гимназия за чужди езици Васил Левски', b: [null, 4.712, 4.68, 4.78, 4.75], m: [null, 5.111, null, 4.8, 4.81]};
s[177] = {l: 'НУМСИ', n: 'Национално училище за музикално и сценично изкуство Проф  Панчо Владигеров', b: [null, 4.747, 4.52, 4.65, 4.49], m: [null, 4.978, null, 4.78, 4.54]};
s[178] = {l: 'ЧПГ с изучаване на английски език Британика 1998', n: 'Частна профилирана гимназия с изучаване на английски език Британика 1998', b: [null, 4.309, 4.27, 4.68, 4.88], m: [null, 4.895, null, 4.66, 4.28]};
s[179] = {l: 'ПГ по строителство, архитектура и геодезия', n: 'Професионална гимназия по строителство, архитектура и геодезия Кольо Фичето', b: [null, 4.295, 4.14, 4.19, 4.16], m: [null, 4.432, null, 4.18, 4.23]};
s[180] = {l: 'ПГ по туризъм Проф. д-р Асен Златаров', n: 'Професионална гимназия по туризъм Проф  д-р Асен Златаров', b: [null, 4.114, 3.98, 3.88, 3.99], m: [null, 3.94, null, 4.11, 4.4]};
s[181] = {l: 'ПГ по механоелектротехника и електроника', n: 'Професионална гимназия по механоелектротехника и електроника', b: [null, 4.247, 3.89, 4.02, 3.88], m: [null, 4.234, null, 4.21, 4.17]};
s[182] = {l: 'СУ Св. Св. Кирил и Методий', n: 'Средно училище Св  св  Кирил и Методий', b: [null, 4.192, 3.97, 3.79, 3.74], m: [null, 4.668, null, 3.95, 4.35]};
s[183] = {l: 'СУ Епископ Константин Преславски', n: 'Средно училище Епископ Константин Преславски', b: [null, 3.885, 3.71, 3.72, 3.99], m: [null, 4.115, null, 4.12, 4.05]};
s[184] = {l: 'ПГ по електротехника и електроника', n: 'Професионална гимназия по електротехника и електроника Константин Фотинов', b: [null, 3.843, 3.82, 3.72, 3.71], m: [null, 4.195, null, 4.0, 4.29]};
s[185] = {l: 'ПГ по химични технологии', n: 'Професионална гимназия по химични технологии Акад  Н  Д  Зелинский', b: [null, 3.902, 3.71, 3.9, 3.68], m: [null, 4.07, null, 3.89, 3.7]};
s[186] = {l: 'СУ Димчо Дебелянов', n: 'Средно училище Димчо Дебелянов', b: [null, 3.766, 3.71, 3.45, 3.53], m: [null, 4.103, null, 3.86, 3.89]};
s[187] = {l: 'Спортно училище Юрий Гагарин', n: 'Спортно училище Юрий Гагарин', b: [null, 3.456, 3.24, 3.43, 3.59], m: [null, 2.911, null, 3.66, 3.92]};
s[188] = {l: 'ПГ по морско корабоплаване и риболов', n: 'Професионална гимназия по морско корабоплаване и риболов Свети Никола', b: [null, 3.662, 3.64, null, 3.25], m: [null, 3.928, null, 3.53, null]};
s[189] = {l: 'СУ Йордан Йовков', n: 'Средно училище Йордан Йовков', b: [null, 3.186, 3.14, 3.62, 3.26], m: [null, 3.448, null, 3.96, 3.22]};
s[190] = {l: 'СУ Добри Чинтулов', n: 'Средно училище Добри Чинтулов', b: [null, 3.517, 3.19, 3.34, 3.42], m: [null, 3.699, null, 3.56, 3.6]};
s[191] = {l: 'СУ Иван Вазов', n: 'Средно училище Иван Вазов', b: [null, 3.486, 3.16, 3.5, 3.21], m: [null, 3.557, null, 3.79, 3.38]};
s[192] = {l: 'Вечерно СУ Захари Стоянов', n: 'Вечерно средно училище Захари Стоянов', b: [null, 3.575, 3.2, 3.37, 3.28], m: [null, 3.524, null, 3.44, 3.49]};
s[193] = {l: 'СУ Христо Ботев', n: 'Средно училище Христо Ботев', b: [null, 2.961, 2.97, 4.01, null], m: [null, 2.854, null, 3.69, 2.73]};
s[194] = {l: 'СУ Петко Росен', n: 'Средно училище Петко Росен', b: [null, 3.32, 3.08, 3.16, 3.29], m: [null, 3.065, null, 3.22, 3.69]};
s[195] = {l: 'ПГ по дървообработване', n: 'Професионална гимназия по дървообработване Георги Кондолов', b: [null, 3.125, 3.09, 3.27, 3.24], m: [null, 3.367, null, 3.53, 3.19]};
s[196] = {l: 'Професионална техническа гимназия', n: 'Професионална техническа гимназия', b: [null, 3.46, 3.19, 3.06, 3.15], m: [null, 2.99, null, 2.82, 3.67]};
s[197] = {l: 'ПГ по транспорт', n: 'Професионална гимназия по транспорт', b: [null, 3.258, 3.13, 2.93, 2.98], m: [null, 3.437, null, 3.02, 3.14]};
s[198] = {l: 'СУ Константин Петканов', n: 'Средно училище Константин Петканов', b: [null, 3.367, 3.12, 3.4, 2.84], m: [null, 3.545, null, 3.43, 2.31]};
s[199] = {l: 'ПГ по сградостроителство и инсталации', n: 'Професионална гимназия по сградостроителство и инсталации Пеньо Пенев', b: [null, 3.04, 2.87, 2.72, 2.96], m: [null, 3.037, null, 3.08, 2.92]};

// Русе
s[201] = {l: 'МГ Баба Тонка', n: 'Математическа гимназия Баба Тонка', b: [null, 5.151, 5.09, 5.26, 5.19], m: [null, 5.695, null, 5.33, 5.54]};
s[202] = {l: 'АЕГ Гео Милев', n: 'Английска езикова гимназия Гео Милев', b: [null, 4.966, 5.09, 5.11, 5.11], m: [null, 5.695, null, 5.6, 5.41]};
s[203] = {l: 'СУ с преподаване на немски език', n: 'Средно училище с преподаване на немски език Фридрих Шилер', b: [null, 5.0, 4.9, 4.95, 4.75], m: [null, 5.175, null, 5.18, 4.94]};
s[204] = {l: 'СУ за европейски езици', n: 'Средно училище за европейски езици Свети Константин-Кирил Философ', b: [null, 4.977, 4.92, 4.73, 4.73], m: [null, 5.164, null, 5.03, 5.03]};
s[205] = {l: 'Първо ЧСУ Леонардо да Винчи ООД', n: 'Първо частно средно училище Леонардо да Винчи ООД', b: [null, 4.81, 4.68, 4.42, 4.65], m: [null, 5.554, null, 5.02, 5.08]};
s[206] = {l: 'ПГ по икономика и управление', n: 'Професионална гимназия по икономика и управление Елиас Канети', b: [null, 4.865, 4.38, 4.75, 4.75], m: [null, 4.977, null, 4.78, 4.91]};
s[207] = {l: 'СУ Васил Левски', n: 'Средно училище Васил Левски', b: [null, 4.433, 4.4, 4.48, 4.68], m: [null, 4.974, null, 4.95, 5.01]};
s[208] = {l: 'СУ Христо Ботев', n: 'Средно училище Христо Ботев', b: [null, 4.658, 4.44, 4.51, 4.25], m: [null, 4.835, null, 4.59, 4.73]};
s[209] = {l: 'Частна английска гимназия Джордж Байрон', n: 'Частна профилирана английска гимназия Джордж Байрон', b: [null, 4.533, 4.03, 3.97, 4.4], m: [null, 5.313, null, 4.7, 4.65]};
s[210] = {l: 'НУИ', n: 'НАЦИОНАЛНО УЧИЛИЩЕ ПО ИЗКУСТВАТА ПРОФ ВЕСЕЛИН СТОЯНОВ', b: [null, 4.282, 4.17, 4.41, 4.3], m: [null, 4.437, null, 4.28, 4.39]};
s[211] = {l: 'ПГ по електротехника и електроника', n: 'Професионална гимназия по електротехника и електроника Апостол Арнаудов', b: [null, 3.911, 3.85, 3.99, 3.73], m: [null, 4.261, null, 4.28, 4.23]};
s[212] = {l: 'СУ Йордан Йовков', n: 'Средно училище Йордан Йовков', b: [null, 3.846, 3.8, null, 3.96], m: [null, 3.866, null, null, 4.16]};
s[213] = {l: 'ПГ по строителство архитектура и геодезия', n: 'Професионална гимназия по строителство архитектура и геодезия Пеньо Пенев', b: [null, 4.089, 4.02, 3.99, 3.9], m: [null, 4.109, null, 4.08, 3.83]};
s[214] = {l: 'СУ Възраждане', n: 'Средно училище Възраждане', b: [null, 4.197, 3.84, 3.89, 3.92], m: [null, 4.287, null, 4.03, 4.06]};
s[215] = {l: 'ПГ по транспорт', n: 'Професионална гимназия по транспорт', b: [null, 3.342, 3.32, 3.3, 3.44], m: [null, 2.83, null, 5.61, 4.04]};
s[216] = {l: 'ПГ по промишлени технологии', n: 'Професионална гимназия по промишлени технологии Атанас Цонев Буров', b: [null, 3.394, 3.25, 3.47, 3.34], m: [null, 2.87, null, null, 5.63]};
s[217] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Иван П  Павлов', b: [null, 4.018, 3.87, 3.79, 3.72], m: [null, 4.142, null, 3.88, 3.82]};
s[218] = {l: 'Спортно училище Майор Атанас Узунов', n: 'Спортно училище Майор Атанас Узунов', b: [null, 3.727, 3.45, 3.63, 3.21], m: [null, 4.018, null, 3.93, 3.71]};
s[219] = {l: 'ПГ по речно корабостроене и корабоплаване', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО РЕЧНО КОРАБОСТРОЕНЕ И КОРАБОПЛАВАНЕ', b: [null, 3.684, 3.3, 3.38, 3.32], m: [null, 3.803, null, 3.53, 3.49]};
s[220] = {l: 'Духовно училище', n: 'Духовно училище', b: [null, 3.402, 3.09, 3.48, 3.25], m: [null, 3.799, null, 3.47, 3.11]};
s[221] = {l: 'ПГ по облекло', n: 'Професионална гимназия по облекло Недка Иван Лазарова', b: [null, 3.633, 3.29, 3.45, 3.34], m: [null, 5.303, null, 3.0, null]};
s[222] = {l: 'ПГ по дървообработване и вътрешна архитектура', n: 'Професионална гимназия по дървообработване и вътрешна архитектура Йосиф Вондрак - Русе', b: [null, 3.618, 2.95, 3.14, 3.58], m: [null, 4.115, null, null, 3.2]};
s[223] = {l: 'ПГ по селско стопанство', n: 'Професионална гимназия по селско стопанство Ангел Кънчев', b: [null, 3.228, 3.11, 3.31, 3.07], m: [null, 3.241, null, 3.28, 3.15]};
s[224] = {l: 'ПГ по механотехника', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО МЕХАНОТЕХНИКА ЮРИЙ ГАГАРИН', b: [null, 3.459, 3.29, 3.27, 3.2], m: [null, 3.384, null, 2.74, 3.04]};

// Стара Загора
s[225] = {l: 'ГПЧЕ Ромен Ролан', n: 'Гимназия с преподаване на чужди езици Ромен Ролан', b: [null, 5.353, 5.28, 5.29, 5.24], m: [null, 5.569, null, 5.46, 5.34]};
s[226] = {l: 'ППМГ Гео Милев', n: 'Профилирана природоматематическа гимназия Гео Милев', b: [null, 4.891, 4.87, 4.93, 4.82], m: [null, 5.12, null, 5.17, 4.95]};
s[227] = {l: 'Търговска гимназия', n: 'Търговска гимназия Княз Симеон Търновски', b: [null, 5.095, 4.97, 4.98, 4.89], m: [null, 5.016, null, 4.64, 4.65]};
s[228] = {l: 'СУ Максим Горки', n: 'Средно училище Максим Горки', b: [null, 4.697, 4.56, 4.66, 4.81], m: [null, 4.778, null, 4.9, 4.84]};
s[229] = {l: 'ПГ по строителство, архитектура и геодезия', n: 'Професионална гимназия по строителство,архитектура и геодезия Лубор Байер', b: [null, 4.647, 4.38, 4.38, 4.42], m: [null, 4.726, null, 4.32, 4.47]};
s[230] = {l: 'НУМСИ', n: 'Национално училище за музикални и сценични изкуства Христина Морфова', b: [null, 4.578, 4.29, 4.05, 4.39], m: [null, 4.024, null, 4.12, 4.17]};
s[231] = {l: 'СУ Васил Левски', n: 'СРЕДНО УЧИЛИЩЕ ВАСИЛ ЛЕВСКИ', b: [null, 4.09, 3.98, 4.05, 4.0], m: [null, 4.344, null, 4.27, 4.15]};
s[232] = {l: 'СУ Иван Вазов', n: 'Средно училище Иван Вазов', b: [null, 4.038, 3.92, 3.88, 3.87], m: [null, 4.126, null, 4.04, 3.98]};
s[233] = {l: 'Национална ПГ по ветеринарна медицина', n: 'Национална професионална гимназия по ветеринарна медицина Иван Павлов', b: [null, 3.806, 3.77, 3.86, 3.82], m: [null, 3.783, null, 3.95, 3.75]};
s[234] = {l: 'ПГ по облекло и хранене', n: 'Професионална гимназия по облекло и хранене Райна Княгиня', b: [null, 3.868, 3.66, 3.82, 3.63], m: [null, 4.32, null, 4.07, 3.87]};
s[235] = {l: 'ПГ по електроника', n: 'Професионална гимназия по електроника Джон Атанасов', b: [null, 3.796, 3.5, 3.69, 3.59], m: [null, 3.859, null, 3.9, 4.15]};
s[236] = {l: 'Вечерно СУ Захари Стоянов', n: 'Вечерно средно училище Захари Стоянов', b: [null, 3.629, 3.35, 3.59, 3.48], m: [null, 3.532, null, 3.73, 3.56]};
s[237] = {l: 'СУ Железник', n: 'СРЕДНО УЧИЛИЩЕ ЖЕЛЕЗНИК', b: [null, 3.878, 2.26, 3.99, 3.57], m: [null, 3.983, null, 4.02, 3.82]};
s[238] = {l: 'ПГ ПО електроника и технологии', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО ЕЛЕКТРОТЕХНИКА И ТЕХНОЛОГИИ Г  С  РАКОВСКИ', b: [null, 3.641, 3.45, 3.38, 3.45], m: [null, 3.892, null, 3.51, 3.66]};
s[239] = {l: 'Спортно училище', n: 'СПОРТНО УЧИЛИЩЕ ТОДОР КАБЛЕШКОВ', b: [null, 3.642, 3.48, 3.29, 3.36], m: [null, 3.191, null, 3.49, 3.43]};
s[240] = {l: 'ПГ по механотехника и транспорт', n: 'Професионална гимназия по механотехника и транспорт Н  Й  Вапцаров', b: [null, 3.544, 3.34, 3.19, 3.28], m: [null, 3.394, null, 3.21, 3.36]};
s[241] = {l: 'СУ Христо Ботев', n: 'Средно училище Христо Ботев', b: [null, 3.369, 3.19, 3.32, null], m: [null, 3.088, null, 3.29, 2.84]};
s[242] = {l: 'СУ Поп Минчо Кънчев', n: 'СРЕДНО УЧИЛИЩЕ ПОП МИНЧО КЪНЧЕВ', b: [null, 3.133, 2.74, 3.2, 3.03], m: [null, null, null, null, null]};
s[243] = {l: 'ПГ по строителство и дървообработване', n: 'Професионална гимназия по строителство и дървообработване Инж  Недьо Ранчев', b: [null, 3.098, 2.97, 2.82, 3.15], m: [null, 3.0, null, 2.79, null]};
s[244] = {l: 'СУ Христо Смирненски', n: 'Средно училище Христо Смирненски', b: [null, 3.485, null, null, null], m: [null, 3.53, null, null, null]};

//Плевен
s[245] = {l: 'МГ Гео Милев', n: 'Математическа гимназия Гео Милев', b: [null, 5.154, 5.14, 5.13, 5.05], m: [null, 5.592, null, 5.21, 5.17]};
s[246] = {l: 'СУ Иван Вазов', n: 'Средно училище Иван Вазов', b: [null, 4.851, 4.81, 5.08, 4.93], m: [null, 5.229, null, 4.98, 5.04]};
s[247] = {l: 'ГПЧЕ', n: 'Профилирана гимназия с преподаване на чужди езици', b: [null, 4.874, 4.77, 4.88, 4.81], m: [null, 5.314, null, 4.99, 5.15]};
s[248] = {l: 'Държавна финансово-стопанска гимназия Интелект', n: 'Държавна финансово-стопанска гимназия Интелект', b: [null, 4.509, 4.3, 4.48, 4.45], m: [null, 4.494, null, 4.43, 4.67]};
s[249] = {l: 'НУИ', n: 'НАЦИОНАЛНО УЧИЛИЩЕ ПО ИЗКУСТВАТА ПАНАЙОТ ПИПКОВ', b: [null, 4.517, 4.15, 4.45, 4.3], m: [null, 4.333, null, 4.44, 4.3]};
s[250] = {l: 'ПГ по електроника и химични технологии', n: 'Професионална гимназия по електроника и химични технологии Проф Асен Златаров', b: [null, 4.028, 3.98, 4.09, 3.98], m: [null, 4.576, null, 4.71, 4.65]};
s[251] = {l: 'СУ Стоян Заимов', n: 'Средно училище Стоян Заимов', b: [null, 4.342, 4.37, 4.58, 3.64], m: [null, 4.308, null, 4.99, 3.74]};
s[252] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Алеко Константинов', b: [null, 4.395, 4.08, 4.09, 4.11], m: [null, 4.488, null, 4.14, 4.6]};
s[253] = {l: 'Спортно училище', n: 'Спортно училище Георги Бенковски', b: [null, 3.675, 3.53, 3.67, 3.41], m: [null, 4.492, null, 4.39, 4.89]};
s[254] = {l: 'ПГ по механоелектротехника', n: 'Професионална гимназия по механоелектротехника', b: [null, 3.73, 3.35, 3.56, 3.53], m: [null, 4.55, null, 4.04, 4.41]};
s[255] = {l: 'СУ Пейо Крачолов Яворов', n: 'Средно училище Пейо Крачолов Яворов', b: [null, 3.713, 3.85, 3.6, 3.7], m: [null, 4.009, null, 3.54, 3.96]};
s[256] = {l: 'ПГ по строителство, архитектура и геодезия', n: 'Професионална гимназия по строителство архитектура и геодезия Никола Фичев', b: [null, 4.052, 3.6, 3.74, 3.58], m: [null, 4.244, null, 3.64, 3.77]};
s[257] = {l: 'ПГ по ресторантьорство, търговия и обслужване', n: 'Професионална гимназия по ресторантьорство търговия и обслужване', b: [null, 3.593, 3.61, 3.57, 3.47], m: [null, 3.778, null, 3.8, 3.69]};
s[258] = {l: 'СУ Анастасия Димитрова', n: 'Средно училище Анастасия Димитрова', b: [null, 4.025, 3.3, 3.92, 3.34], m: [null, 4.21, null, 3.96, 3.32]};
s[259] = {l: 'СУ Христо Смирненски', n: 'Средно училище Христо Смирненски', b: [null, 3.427, 3.14, 3.52, 3.41], m: [null, 3.603, null, 3.86, 3.65]};
s[260] = {l: 'ПГ по облекло и текстил', n: 'Професионална гимназия по облекло и текстил Христо Бояджиев', b: [null, 3.414, 3.44, 3.1, 3.01], m: [null, 2.93, null, 3.23, 4.01]};
s[261] = {l: 'ПГ по лозарство и винарство', n: 'Професионална гимназия по лозарство и винарство Александър Стамболийски', b: [null, 3.474, 3.22, 3.22, 3.28], m: [null, 3.58, null, 2.57, 4.22]};
s[262] = {l: 'ПГ по транспорт', n: 'Професионална гимназия по транспорт Проф  Цветан Лазаров', b: [null, 3.322, 3.33, 3.22, 3.12], m: [null, 3.533, null, 3.9, 2.88]};
s[263] = {l: 'ПГ по хранително-вкусови технологии', n: 'Професионална гимназия по хранително-вкусови технологии Луи Пастьор', b: [null, 3.34, 3.22, 3.11, 3.31], m: [null, 3.1, null, 2.91, 3.51]};
s[264] = {l: 'ПГ по подемна, строителна и транспортна техника', n: 'Професионална гимназия по подемна строителна и транспортна техника Г С Раковски', b: [null, 3.018, 2.9, 2.85, 3.1], m: [null, 3.024, null, 2.79, 3.48]};
s[265] = {l: 'ПГ по мениджмънт и хранителни технологии', n: 'Професионална гимназия по мениджмънт и хранителни технологии', b: [null, 2.775, 2.86, 2.46, 2.71], m: [null, 3.61, null, 3.03, 2.9]};
s[266] = {l: 'ПГ Захарий Зограф', n: 'Професионална гимназия Захарий Зограф', b: [null, 3.153, 2.86, 2.67, 2.71], m: [null, 3.302, null, 2.42, 2.64]};

// Сливен
s[271] = {l: 'ПГ с преподаване на западни езици', n: 'Профилирана гимназия с преподаване на западни езици Захарий Стоянов', b: [null, 5.12, 4.95, 5.0, 5.06], m: [null, 5.419, null, 5.15, 5.2]};
s[272] = {l: 'ППМГ', n: 'Профилирана природо-математическа гимназия Добри П  Чинтулов', b: [null, 5.16, 4.86, 5.14, 4.77], m: [null, 5.458, null, 5.25, 5.12]};
s[273] = {l: 'Профилирана хуманитарна гимназия', n: 'Профилирана хуманитарна гимназия Дамян Дамянов', b: [null, 4.458, 4.0, 4.47, 4.19], m: [null, 4.688, null, 4.83, 4.35]};
s[274] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика Професор доктор Димитър Табаков', b: [null, 4.417, 4.18, 4.43, 4.19], m: [null, 4.444, null, 4.27, 4.59]};
s[275] = {l: 'ПГ по хотелиерство и туризъм', n: 'Професионална гимназия по хотелиерство и туризъм Академик Неделчо Неделчев', b: [null, 4.133, 4.1, 4.05, 4.32], m: [null, 4.02, null, 3.98, 4.36]};
s[276] = {l: 'Национална художествена гимназия', n: 'Национална художествена гимназия Димитър Добрович', b: [null, 4.354, 3.92, 4.53, 4.38], m: [null, 4.026, null, 3.4, 3.47]};
s[277] = {l: 'СУ Аргира Жечкова', n: 'Средно училище Аргира Жечкова', b: [null, null, 3.78, null, 3.82], m: [null, null, null, null, null]};
s[278] = {l: 'СУ Пейо Крачолов Яворов', n: 'Средно училище Пейо Крачолов Яворов', b: [null, 3.917, 3.53, 3.77, 3.56], m: [null, 3.881, null, 3.81, 3.77]};
s[279] = {l: 'СУ Йордан Йовков', n: 'Средно училище Йордан Йовков', b: [null, 3.642, 3.43, 3.62, 3.41], m: [null, 3.674, null, 3.84, 3.93]};
s[280] = {l: 'Спортно училище', n: 'Спортно училище Димитър Рохов', b: [null, 3.745, 3.3, 3.66, 3.69], m: [null, 3.575, null, 3.61, 3.7]};
s[281] = {l: 'ПГ по строителство и геодезия', n: 'Сливенска професионална гимназия по строителство и геодезия Арх  Георги Козаров', b: [null, 3.467, 3.43, 3.24, 3.35], m: [null, 3.34, null, 3.82, 3.67]};
s[282] = {l: 'ПГ по електротехника и електроника', n: 'Професионална гимназия по електротехника и електроника Мария Склодовска-Кюри', b: [null, 3.539, 3.39, 3.38, 3.37], m: [null, 3.605, null, 3.61, 3.47]};
s[283] = {l: 'ПГ по текстил и облекло', n: 'Професионална гимназия по текстил и облекло Добри Желязков', b: [null, 3.334, 3.65, 3.28, 3.24], m: [null, 3.413, null, 3.47, 3.5]};
s[284] = {l: 'ПГ по механотехника', n: 'Професионална гимназия по механотехника', b: [null, 3.045, 2.97, 3.02, 3.06], m: [null, 2.892, null, 3.15, 3.19]};
s[285] = {l: 'СУ Хаджи Мина Пашов', n: 'Средно училище Хаджи Мина Пашов', b: [null, 3.432, 2.82, 2.4, 3.03], m: [null, 3.601, null, null, 3.45]};
s[286] = {l: 'СУ Константин Константинов', n: 'Средно училище Константин Константинов', b: [null, 4.165, 2.59, null, null], m: [null, 4.454, null, null, null]};

// Добрич
s[291] = {l: 'ЕГ Гео Милев', n: 'Езикова гимназия Гео Милев', b: [null, 5.119, 5.27, 5.26, 5.11], m: [null, 5.399, null, 5.45, 5.26]};
s[292] = {l: 'Сдружение ЧПГ по туризъм и предприемачество', n: 'Сдружение Частна профилирана гимназия по туризъм и предприемачество Райко Цончев', b: [null, 5.079, 5.07, 4.96, 5.15], m: [null, 5.514, null, 4.63, 5.26]};
s[293] = {l: 'ПМГ Иван Вазов', n: 'Природоматематическа гимназия Иван Вазов', b: [null, 4.526, 4.37, 4.68, 4.47], m: [null, 4.928, null, 4.9, 4.88]};
s[294] = {l: 'ЧСУ Леонардо да Винчи', n: 'Частно средно училище с профилирана подготовка по чужди езици и математика Леонардо да Винчи', b: [null, null, 4.43, 4.55, 4.76], m: [null, null, null, 4.48, 4.94]};
s[295] = {l: 'СУ Св. Климент Охридски', n: 'Средно училище Свети Климент Охридски', b: [null, 4.511, 4.46, 4.41, 4.9], m: [null, 4.688, null, 4.44, 4.82]};
s[296] = {l: 'СУ Петко Рачов Славейков', n: 'Средно училище Петко Рачов Славейков', b: [null, 4.116, 4.41, 4.64, 4.19], m: [null, 4.771, null, 4.82, 4.81]};
s[297] = {l: 'СУ Св. Св. Кирил и Методий', n: 'Средно училище Свети свети Кирил и Методий', b: [null, 4.193, 4.1, 4.26, 4.48], m: [null, 4.554, null, 4.57, 4.98]};
s[298] = {l: 'Финансово-стопанска гимназия Васил Левски', n: 'Финансово-стопанска гимназия Васил Левски', b: [null, 4.356, 4.15, 4.32, 4.2], m: [null, 4.711, null, 4.3, 4.53]};
s[299] = {l: 'СУ Димитър Талев', n: 'Средно училище Димитър Талев', b: [null, 4.17, 4.08, 3.92, 4.18], m: [null, 4.74, null, 4.23, 4.53]};
s[300] = {l: 'СУ Любен Каравелов', n: 'Средно училище Любен Каравелов', b: [null, 3.846, 4.13, 4.08, 3.61], m: [null, 3.886, null, 4.2, 4.12]};
s[301] = {l: 'ПГ по ветеринарна медицина Проф  д-р Георги Павлов', n: 'Професионална гимназия по ветеринарна медицина Проф  д-р Георги Павлов', b: [null, 3.873, 3.58, 3.66, 3.84], m: [null, 3.998, null, 4.05, 3.95]};
s[302] = {l: 'ПГ по аграрно стопанство', n: 'Професионална гимназия по аграрно стопанство', b: [null, 3.27, 3.24, 3.34, 3.25], m: [null, 3.544, null, 5.45, 2.97]};
s[303] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм П  К  Яворов', b: [null, 3.86, 3.5, 3.63, 3.49], m: [null, 3.39, null, null, null]};
s[304] = {l: 'Спортно училище', n: 'Спортно училище Георги Стойков Раковски', b: [null, 3.11, 3.32, 3.23, 3.25], m: [null, 3.21, null, 3.29, 3.54]};
s[305] = {l: 'ПГ по техника и строителство', n: 'Професионална гимназия по техника и строителство Михаил Василиевич Ломоносов', b: [null, 3.558, 3.31, 3.22, 3.24], m: [null, 6.0, null, 2.84, 3.07]};
s[306] = {l: 'ПГ по транспорт, обслужване и лека промишленост', n: 'Професионална гимназия по транспорт обслужване и лека промишленост', b: [null, 3.314, 3.1, 3.14, 3.0], m: [null, 3.2, null, null, 2.62]};

//Шумен
s[311] = {l: 'ППМГ', n: 'Профилирана природоматематическа гимназия Нанчо Попович', b: [null, 4.904, 4.82, 5.1, 4.8], m: [null, 5.461, null, 5.18, 5.09]};
s[312] = {l: 'Профилирана ЕГ Никола Йонков Вапцаров', n: 'Профилирана езикова гимназия Никола Йонков Вапцаров', b: [null, 5.007, 4.79, 4.96, 4.86], m: [null, 5.433, null, 5.2, 5.0]};
s[313] = {l: 'СУ Сава Доброплодни', n: 'Средно училище Сава Доброплодни', b: [null, 4.418, 4.3, 4.34, 4.75], m: [null, 4.835, null, 4.43, 4.82]};
s[314] = {l: 'СУ Йоан Екзарх Български', n: 'Средно училище Йоан Екзарх Български', b: [null, 4.305, 4.28, 4.51, 4.28], m: [null, 4.509, null, 4.43, 4.48]};
s[315] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика', b: [null, 4.176, 3.92, 4.08, 3.97], m: [null, 4.165, null, 4.18, 4.12]};
s[316] = {l: 'СУ Панайот Волов', n: 'Средно училище Панайот Волов', b: [null, 4.279, 3.86, 4.09, 3.66], m: [null, 4.432, null, 4.25, 4.07]};
s[317] = {l: 'Духовно училище Нювваб', n: 'Духовно училище Нювваб', b: [null, 3.947, 3.59, 3.56, 3.67], m: [null, 3.846, null, 3.97, 4.14]};
s[318] = {l: 'СУ Васил Левски', n: 'Средно училище Васил Левски', b: [null, 3.66, 3.2, 3.62, 3.35], m: [null, 4.111, null, 3.96, 4.25]};
s[319] = {l: 'СУ Трайко Симеонов', n: 'Средно училище Трайко Симеонов', b: [null, 3.496, 3.29, 3.29, 3.38], m: [null, 3.655, null, 3.71, 4.27]};
s[320] = {l: 'ПГ по механотехника, електроника, телекомуникации и транспорт', n: 'Професионална гимназия по механотехника електроника телекомуникации и транспорт Христо Ботев', b: [null, 3.471, 3.48, 3.33, 3.5], m: [null, 3.606, null, 3.57, 3.85]};
s[321] = {l: 'ПГ по облекло, хранене и химични технологии', n: 'Професионална гимназия по облекло, хранене и химични технологии „Проф  д-р Асен Златаров“', b: [null, 3.553, 3.35, 3.53, 3.64], m: [null, 3.645, null, 3.64, 3.55]};
s[322] = {l: 'ПГ по строителство, архитектура и геодезия', n: 'Професионална гимназия по строителство архитектура и геодезия', b: [null, 3.471, 3.37, 3.38, 3.23], m: [null, 3.618, null, 3.66, 3.63]};
s[323] = {l: 'ПГ по селско стопанство и хранителни технологии', n: 'Професионална гимназия по селско стопанство и хранителни технологии', b: [null, 3.156, 3.04, 3.03, 3.14], m: [null, 3.448, null, 3.35, 3.5]};

// Перник
s[325] = {l: 'ГПЧЕ Симеон Радев', n: 'Гимназия с преподаване на чужди езици Симеон Радев', b: [null, 5.093, 4.95, 4.98, 5.0], m: [null, 5.214, null, 5.01, 5.17]};
s[326] = {l: 'СУРИЧЕ Д-р Петър Берон', n: 'Средно училище с разширено изучаване на чужди езици Д-р Петър Берон', b: [null, 4.758, 4.95, 4.61, 4.59], m: [null, 5.23, null, 4.99, 4.98]};
s[327] = {l: 'ПМГ Христо Смирненски', n: 'Природоматематическа гимназия Христо Смирненски', b: [null, 4.507, 4.17, 4.52, 4.37], m: [null, 5.054, null, 4.77, 4.94]};
s[328] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика', b: [null, 4.254, 3.96, 4.21, 4.03], m: [null, 4.303, null, 4.3, 4.37]};
s[329] = {l: 'ПГ по техника и строителство', n: 'Професионална гимназия по техника и строителство Арх  Йордан Миланов', b: [null, 3.887, 3.67, 4.04, 3.78], m: [null, 3.923, null, 4.01, 4.2]};
s[330] = {l: 'VI СУ Св. Св. Кирил и Методий', n: 'VI Средно училище Свети Свети Кирил и Методий', b: [null, 3.898, 3.5, 4.01, 3.71], m: [null, 3.998, null, 4.18, 3.89]};
s[331] = {l: 'ПГ по облекло и туризъм', n: 'Професионална гимназия по облекло и туризъм Свети Иван Рилски', b: [null, 3.549, 3.44, 3.56, 3.36], m: [null, 3.599, null, 3.74, 3.66]};
s[332] = {l: 'ПГ по енергетика и минна промишленост', n: 'Професионална гимназия по енергетика и минна промишленост Христо Ботев', b: [null, 3.266, 3.37, 3.31, 3.34], m: [null, 3.343, null, 3.43, 3.61]};
s[333] = {l: 'Спортно училище', n: 'Спортно училище Олимпиец', b: [null, 3.488, 3.28, 3.24, 3.23], m: [null, 3.33, null, 3.31, 3.61]};
s[334] = {l: 'Технологична ПГ Мария Кюри', n: 'Технологична професионална гимназия Мария Кюри', b: [null, 3.584, 3.36, 3.02, 3.43], m: [null, 3.77, null, 3.14, 3.66]};
s[335] = {l: 'V СУ Петко Рачов Славейков', n: 'Пето средно училище Петко Рачов Славейков', b: [null, 3.486, 3.53, 2.77, 3.29], m: [null, 3.532, null, null, 3.54]};

// Хасково
s[341] = {l: 'ЕГ', n: 'Езикова гимназия Проф  д-р Асен Златаров', b: [null, 5.077, 4.89, 5.05, 4.93], m: [null, 5.4, null, 5.25, 5.07]};
s[342] = {l: 'ПМГ', n: 'Природо-математическа гимназия Академик Боян Петканчин', b: [null, 5.169, 4.8, 5.21, 5.13], m: [null, 5.227, null, 4.97, 4.95]};
s[343] = {l: 'Финансово-стопанска гимназия', n: 'Финансово-стопанска гимназия Атанас Буров', b: [null, 4.251, 3.97, 4.0, 3.69], m: [null, 4.35, null, 3.97, 4.17]};
s[344] = {l: 'СУ Васил Левски', n: 'Средно училище Васил Левски', b: [null, 3.77, 3.57, 3.66, 3.72], m: [null, 4.47, null, 4.14, 4.25]};
s[345] = {l: 'ПГ по дървообработване и строителство', n: 'Професионална гимназия по дървообработване и строителство Цар Иван Асен', b: [null, 3.84, 3.68, 3.63, 3.72], m: [null, 4.127, null, 4.14, 4.07]};
s[346] = {l: 'Средно училище Св. Паисий Хилендарски', n: 'Средно училище Св Паисий Хилендарски', b: [null, 3.94, 3.63, 3.51, 3.49], m: [null, 4.221, null, 3.78, 3.48]};
s[347] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Александър Паскалев', b: [null, 3.588, 3.4, 3.48, 3.24], m: [null, 3.59, null, 3.57, 3.4]};
s[348] = {l: 'ПГ по механоелектротехника', n: 'Професионална гимназия по механоелектротехника Стойчо и Кица Марчеви', b: [null, 3.305, 3.1, 3.2, 3.02], m: [null, 3.482, null, 3.48, 3.25]};
s[349] = {l: 'Спортно у-ще', n: 'СПОРТНО УЧИЛИЩЕ СТЕФАН КАРАДЖА', b: [null, 3.14, 3.03, 3.04, 3.12], m: [null, 3.438, null, 3.32, 3.18]};
s[350] = {l: 'ПГ по лека промишленост', n: 'Професионална гимназия по лека промишленост Райна Княгиня', b: [null, 3.12, 3.05, 3.26, 2.93], m: [null, 3.028, null, 3.34, 2.96]};
s[351] = {l: 'ПГ по транспорт и аграрни технологии', n: 'Професионална гимназия по транспорт и аграрни технологии Н Й Вапцаров', b: [null, 3.146, 2.95, 3.08, 3.12], m: [null, 2.865, null, 3.07, 2.66]};

// Ямбол
s[355] = {l: 'ПМГ Атанас Радев', n: 'Природо-математическа гимназия Атанас Радев', b: [null, 5.197, 4.91, 5.08, 4.89], m: [null, 5.542, null, 5.19, 5.03]};
s[356] = {l: 'ЕГ Васил Карагьозов', n: 'Езикова гимназия Васил Карагьозов', b: [null, 4.737, 4.45, 4.81, 4.79], m: [null, 5.169, null, 4.9, 5.11]};
s[357] = {l: 'ПГ Васил Левски', n: 'Профилирана гимназия Васил Левски', b: [null, 4.506, 4.54, 4.78, 4.73], m: [null, 4.975, null, 4.86, 4.84]};
s[358] = {l: 'ПГ по икономика Георги Стойков Раковски', n: 'Професионална гимназия по икономика Георги Стойков Раковски', b: [null, 4.382, 3.8, 3.98, 3.97], m: [null, 4.962, null, 4.58, 4.82]};
s[359] = {l: 'СУ Св. Климент Охридски', n: 'Средно училище Св  Климент Охридски', b: [null, 4.062, 3.71, 3.98, 3.86], m: [null, 3.965, null, 4.28, 4.07]};
s[360] = {l: 'Спортно училище', n: 'Спортно училище Пиер дьо Кубертен', b: [null, 3.69, 3.49, 3.87, 3.87], m: [null, 3.271, null, 2.68, 5.92]};
s[361] = {l: 'Професионална техническа гимназия', n: 'Професионална техническа гимназия Иван Райнов', b: [null, 3.696, 3.57, 3.62, 3.59], m: [null, 3.918, null, 4.18, 3.6]};
s[362] = {l: 'Гимназия по строителство и архитектура, графика и дизайн', n: 'Гимназия по строителство и архитектура, графика и дизайн Кольо Фичето', b: [null, 3.28, 3.33, 3.37, 3.5], m: [null, 2.964, null, 4.08, 3.61]};
s[363] = {l: 'ПГ по лека промишленост, екология и химични технологии', n: 'Професионална гимназия по лека промишленост екология и химични технологии', b: [null, 3.049, 2.99, 3.74, 3.35], m: [null, 2.98, null, null, null]};
s[364] = {l: 'ПГ по хранителни технологии и туризъм', n: 'Професионална гимназия по хранителни технологии и туризъм', b: [null, 3.56, 3.44, 3.39, 3.31], m: [null, 3.623, null, 3.03, 2.98]};
s[365] = {l: 'ПГ по земеделие', n: 'Професионална гимназия по земеделие Христо Ботев', b: [null, 3.01, 2.94, 2.85, 3.01], m: [null, 2.791, null, 2.82, 3.09]};
s[366] = {l: 'ПГ по подемна, строителна и транспортна техника', n: 'Професионална гимназия по подемна строителна и транспортна техника Н  Й  Вапцаров', b: [null, 2.939, 2.75, 2.87, 2.85], m: [null, 2.923, null, 2.37, 2.7]};

// Пазарджик
s[371] = {l: 'ЕГ Бертолт Брехт', n: 'Езикова гимназия Бертолт Брехт', b: [null, 5.198, 4.98, 5.09, 5.12], m: [null, 5.416, null, 5.26, 5.16]};
s[372] = {l: 'РУО Пазарджик', n: 'РУО ПАЗАРДЖИК', b: [null, 2.48, 4.98, null, null], m: [null, 2.635, null, null, null]};
s[373] = {l: 'ПМГ', n: 'ПРОФИЛИРАНА МАТЕМАТИЧЕСКА ГИМНАЗИЯ Константин Величков', b: [null, 4.822, 4.57, 4.94, 4.74], m: [null, 5.047, null, 4.86, 4.76]};
s[374] = {l: 'ПГ по икономика и мениджмънт', n: 'Професионална гимназия по икономика и мениджмънт', b: [null, 4.291, 4.3, 4.43, 4.32], m: [null, 4.273, null, 4.13, 4.09]};
s[375] = {l: 'ПГ Иван Сергеевич Аксаков', n: 'Профилирана гимназия Иван Сергеевич Аксаков', b: [null, 4.246, 4.02, 3.87, 3.83], m: [null, 4.499, null, 4.15, 4.14]};
s[376] = {l: 'СУ Георги Бенковски', n: 'Средно училище Георги Бенковски', b: [null, 4.123, 4.18, 3.94, 3.7], m: [null, 4.13, null, 3.97, 3.73]};
s[377] = {l: 'СУ Георги Брегов', n: 'Средно училище Георги Брегов', b: [null, 4.175, 3.77, 3.24, 3.43], m: [null, 3.918, null, 3.5, 3.73]};
s[378] = {l: 'СУ Д-р Петър Берон', n: 'Средно училище Д-р Петър Берон', b: [null, 3.456, 3.03, 3.31, 3.66], m: [null, 3.627, null, 3.44, 4.16]};
s[379] = {l: 'ПГ по механоелектротехника', n: 'Професионална гимназия по механоелектротехника', b: [null, 3.579, 3.37, 3.44, 3.5], m: [null, 3.87, null, 3.67, 3.6]};
s[380] = {l: 'ПГ по строителство и архитектура', n: 'Професионална гимназия по строителство и архитектура', b: [null, 3.525, 3.3, 3.44, 3.34], m: [null, 3.478, null, 3.37, 3.05]};
s[381] = {l: 'ПГпо фризьорство и ресторантьорство', n: 'Професионална гимназия по фризьорство и ресторантьорство-гр Пазарджик', b: [null, 3.512, 3.15, 3.75, 2.97], m: [null, 3.444, null, null, null]};
s[382] = {l: 'ПГ по селско стопанство', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО СЕЛСКО СТОПАНСТВО ЦАРИЦА ЙОАННА', b: [null, 3.266, 2.99, 3.26, 2.97], m: [null, 3.523, null, 3.65, 3.1]};
s[383] = {l: 'СУ Димитър Гачев', n: 'Средно училище Димитър Гачев', b: [null, 2.845, 3.13, null, null], m: [null, 3.197, null, null, null]};
s[384] = {l: 'ПГ по промишлени технологии', n: 'ПРОФЕСИОНАЛНА ГИМНАЗИЯ ПО ПРОМИШЛЕНИ ТЕХНОЛОГИИ', b: [null, 3.05, 2.92, 2.88, 2.95], m: [null, 3.42, null, null, 3.48]};
s[385] = {l: 'Професионална гимназия по химични и хранителни технологии', n: 'Професионална гимназия по химични и хранителни технологии', b: [null, 3.671, 3.14, 3.17, 3.06], m: [null, 4.332, null, 2.84, 2.66]};

// Благоевград
s[391] = {l: 'ЕГ Акад  Людмил Стоянов', n: 'Езикова гимназия Акад  Людмил Стоянов', b: [null, 5.259, 5.23, 5.4, 5.24], m: [null, 5.433, null, 5.42, 5.4]};
s[392] = {l: 'ПМГ Акад. Сергей Корольов', n: 'Природо-математическа гимназия Акад  Сергей Корольов', b: [null, 5.225, 5.07, 5.02, 5.06], m: [null, 5.559, null, 5.19, 5.22]};
s[393] = {l: 'Национална хуманитарна гимназия', n: 'Национална хуманитарна гимназия Св св Кирил и Методий', b: [null, 4.521, 4.29, 4.43, 4.59], m: [null, 4.43, null, 4.48, 4.66]};
s[394] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика Иван Илиев', b: [null, 4.62, 4.36, 4.46, 4.46], m: [null, 4.59, null, 4.16, 4.56]};
s[395] = {l: 'СУИЧЕ Св. Климент Охридски', n: 'Средно училище с изучаване на чужди езици Свети Климент Охридски', b: [null, 4.208, 4.12, 4.02, 3.71], m: [null, 4.439, null, 4.08, 4.07]};
s[396] = {l: 'ПГ по строителство, архитектура и геодезия', n: 'Професионална гимназия по строителство архитектура и геодезия Васил Левски', b: [null, 4.137, 3.76, 3.74, 3.84], m: [null, 3.943, null, 3.87, 4.01]};
s[397] = {l: 'Пето СУ Георги Измирлиев', n: 'Пето средно училище Георги Измирлиев', b: [null, 3.563, 3.65, 3.48, 3.6], m: [null, 3.914, null, 3.83, 3.87]};
s[398] = {l: 'Седмо СУ Кузман Шапкарев', n: 'Седмо средно училище Кузман Шапкарев', b: [null, null, 3.71, 3.88, null], m: [null, null, null, 3.95, 2.44]};
s[399] = {l: 'ЧСУ Димитър и Йоан', n: 'Частно средно училище Димитър и Йоан', b: [null, 3.406, 3.43, null, null], m: [null, 3.363, null, null, null]};
s[400] = {l: 'ПГ по туризъм и лека промишленост', n: 'Професионална гимназия по туризъм и лека промишленост Гоце Делчев', b: [null, 3.464, 3.37, 3.27, 3.39], m: [null, 3.21, null, 3.11, null]};
s[401] = {l: 'ПГ Ичко Бойчев', n: 'Благоевградска професионална гимназия Ичко Бойчев', b: [null, 3.353, 3.23, 3.15, 3.31], m: [null, 3.61, null, 3.15, 3.32]};
s[402] = {l: 'СУ Иван Вазов', n: 'Средно училище Иван Вазов', b: [null, null, null, 2.81, 2.04], m: [null, null, null, 3.14, 3.06]};

// Велико Търново
s[405] = {l: 'ЧПГ АК - Аркус ЕООД', n: 'Частна профилирана гимназия АК - Аркус ЕООД', b: [null, 4.985, 5.16, 5.49, 5.25], m: [null, 5.541, null, 5.53, 5.34]};
s[406] = {l: 'ПМГ Васил Друмев', n: 'Природо-математическа гимназия Васил Друмев', b: [null, 5.208, 5.11, 5.22, 5.03], m: [null, 5.431, null, 5.3, 5.27]};
s[407] = {l: 'Профилирана ЕГ', n: 'Профилирана езикова гимназия Проф  д-р Асен Златаров', b: [null, 5.131, 5.0, 5.23, 4.99], m: [null, 5.358, null, 5.16, 5.2]};
s[408] = {l: 'СУ Емилиян Станев', n: 'Средно училище Емилиян Станев', b: [null, 4.563, 4.25, 4.55, 4.24], m: [null, 4.918, null, 4.7, 4.74]};
s[409] = {l: 'Старопрестолна ПГ по икономика', n: 'Старопрестолна професионална гимназия по икономика', b: [null, 4.51, 4.21, 4.39, 3.99], m: [null, 4.437, null, 4.36, 4.66]};
s[410] = {l: 'ПГ по строителство, архитектура и геодезия', n: 'Професионална гимназия по строителство архитектура и геодезия Ангел Попов', b: [null, 4.059, 3.87, 4.15, 4.06], m: [null, 3.979, null, 4.06, 4.56]};
s[411] = {l: 'СУ Вела Благоева', n: 'Средно училище Вела Благоева', b: [null, 3.653, 3.7, 4.29, 3.97], m: [null, 3.505, null, 4.12, 4.6]};
s[412] = {l: 'Профилирана Хуманитарна гимназия', n: 'Профилирана Хуманитарна гимназия Свети свети Кирил и Методий', b: [null, null, 4.13, 4.15, 3.52], m: [null, null, null, 4.08, null]};
s[413] = {l: 'РУО Велико Търново', n: 'РУО ВЕЛИКО ТЪРНОВО', b: [null, 4.43, 3.91, null, null], m: [null, 3.41, null, null, null]};
s[414] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Д-р Васил Берон', b: [null, 3.982, 3.74, 4.11, 3.88], m: [null, 3.939, null, 3.83, 3.89]};
s[415] = {l: 'Спортно училище', n: 'Спортно училище Георги Живков', b: [null, 3.888, 3.54, 3.82, 3.79], m: [null, 3.777, null, null, 4.35]};
s[416] = {l: 'СУ Георги Стойков Раковски', n: 'Средно училище Георги Стойков Раковски', b: [null, 3.224, 3.11, null, null], m: [null, 3.466, null, 4.07, null]};
s[417] = {l: 'ПГ по електроника', n: 'Професионална гимназия по електроника Александър Степанович Попов', b: [null, 3.597, 3.36, 3.32, 3.46], m: [null, 3.858, null, 3.41, 3.8]};
s[418] = {l: 'ПГ по моден дизайн', n: 'Професионална гимназия по моден дизайн', b: [null, 3.491, 3.16, 3.49, 3.59], m: [null, null, null, 3.52, null]};
s[419] = {l: 'СУ Владимир Комаров', n: 'Средно училище Владимир Комаров', b: [null, 3.563, 3.52, 3.62, 3.14], m: [null, 3.569, null, 3.51, 3.24]};
s[420] = {l: 'Регионално управление на образованието', n: 'Регионално управление на образованието', b: [null, null, null, 3.1, null], m: [null, null, null, null, null]};

// Враца
s[421] = {l: 'ППМГ', n: 'Профилирана природо-математическа гимназия Академик Иван Ценов', b: [null, 5.141, 4.82, 4.93, 5.01], m: [null, 5.303, null, 5.09, 5.13]};
s[422] = {l: 'СУ Христо Ботев', n: 'Средно училище Христо Ботев', b: [null, 4.768, 4.53, 4.77, 4.68], m: [null, 5.06, null, 5.08, 5.2]};
s[423] = {l: 'Профилирана ЕГ', n: 'Профилирана езикова гимназия Йоан Екзарх', b: [null, 4.952, 4.32, 4.65, 4.69], m: [null, 5.161, null, 5.02, 5.19]};
s[424] = {l: 'СУ Васил Кънчов', n: 'Средно училище Васил Кънчов', b: [null, 4.048, 3.98, 4.55, 4.04], m: [null, 3.949, null, 4.32, 4.46]};
s[425] = {l: 'СУ Козма Тричков', n: 'Средно училище Козма Тричков', b: [null, 4.253, 3.91, 4.14, 4.02], m: [null, 4.241, null, 4.55, 4.48]};
s[426] = {l: 'СУ Никола Войводов', n: 'Средно училище Никола Войводов', b: [null, 4.292, 3.93, 3.93, 4.23], m: [null, 4.123, null, 4.05, 4.48]};
s[427] = {l: 'СУ Отец Паисий', n: 'Средно училище Отец Паисий', b: [null, 4.077, 3.91, 3.84, 4.18], m: [null, 4.169, null, 3.85, 4.2]};
s[428] = {l: 'Професионална техническа гимназия', n: 'Професионална техническа гимназия Н  Й  Вапцаров', b: [null, 3.561, 3.41, 3.64, 3.49], m: [null, 3.753, null, 4.24, 4.01]};
s[429] = {l: 'Спортно училище', n: 'Спортно училище Св Климент Охридски', b: [null, 3.691, 3.19, 3.56, 3.42], m: [null, 3.805, null, 3.74, 3.84]};
s[430] = {l: 'ПГ по търговия и ресторантьорство', n: 'Професионална гимназия по търговия и ресторантьорство', b: [null, 3.611, 3.64, 3.43, 3.48], m: [null, 3.637, null, 3.64, 3.55]};
s[431] = {l: 'СУ Мито Орозов', n: 'Средно училище Мито Орозов', b: [null, null, 4.4, 3.02, 3.09], m: [null, null, null, 3.38, 3.59]};
s[432] = {l: 'ПГ Димитраки Хаджитошин', n: 'Професионална гимназия Димитраки Хаджитошин', b: [null, 3.26, 3.05, 3.22, 3.36], m: [null, 2.786, null, 3.39, 3.66]};

// Габрово
s[435] = {l: 'Национална Априловска Гимназия', n: 'НАЦИОНАЛНА АПРИЛОВСКА ГИМНАЗИЯ', b: [null, 5.12, 5.04, 5.29, 5.05], m: [null, 5.437, null, 5.35, 5.25]};
s[436] = {l: 'ПМГ', n: 'Природоматематическа гимназия Академик Иван Гюзелев', b: [null, 4.782, 4.81, 5.16, 4.97], m: [null, 5.2, null, 5.27, 5.14]};
s[437] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Пенчо Семов', b: [null, 3.99, 3.76, 3.97, 3.79], m: [null, 3.894, null, 4.0, 4.23]};
s[438] = {l: 'Професионална техническа гимназия', n: 'ПРОФЕСИОНАЛНА ТЕХНИЧЕСКА ГИМНАЗИЯ Д-р Никола Василиади', b: [null, 4.002, 3.71, 3.79, 3.83], m: [null, 4.304, null, 4.07, 4.24]};
s[439] = {l: 'СУ Отец Паисий', n: 'Средно училище Отец Паисий', b: [null, 3.731, 3.49, 4.05, 3.43], m: [null, 3.815, null, 4.19, 3.69]};
s[440] = {l: 'СУ Райчо Каролев', n: 'Средно училище Райчо Каролев', b: [null, 3.871, 3.18, 3.73, 3.46], m: [null, 3.894, null, 3.62, 3.69]};

// Видин
s[441] = {l: 'ГПЧЕ', n: 'ГПЧЕ Йордан Радичков', b: [null, 5.115, 4.85, 5.07, 4.75], m: [null, 5.396, null, 5.13, 5.28]};
s[442] = {l: 'ППМГ', n: 'ППМГ Екзарх Антим I', b: [null, 4.625, 4.53, 4.79, 4.56], m: [null, 4.764, null, 4.78, 4.6]};
s[443] = {l: 'СУ Цар Симеон Велики', n: 'СУ Цар Симеон Велики', b: [null, 4.772, 4.57, 4.24, 4.47], m: [null, 4.905, null, 4.48, 4.67]};
s[444] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св  св  Кирил и Методий', b: [null, 3.748, 4.21, 4.12, 4.41], m: [null, 3.818, null, 4.36, 4.38]};
s[445] = {l: 'ПГ Проф. д-р Асен Златаров', n: 'ПГ Проф  д-р Асен Златаров', b: [null, 4.118, 4.14, 4.3, 4.22], m: [null, 4.154, null, 4.18, 3.99]};
s[446] = {l: 'СУ Петко Рачов Славейков', n: 'СУ Петко Рачов Славейков', b: [null, 4.388, 3.56, 3.73, 3.7], m: [null, 4.475, null, 3.91, 3.72]};
s[447] = {l: 'ПГТ Михалаки Георгиев', n: 'ПГТ Михалаки Георгиев', b: [null, 3.512, 3.44, 3.49, 3.58], m: [null, 3.585, null, 4.27, 3.79]};
s[448] = {l: 'ПТГ Васил Левски', n: 'ПТГ Васил Левски', b: [null, 3.241, 3.57, 2.97, 3.2], m: [null, 3.54, null, 2.53, null]};

// Монтана
s[451] = {l: 'ГПЧЕ Петър Богдан', n: 'Профилирана гимназия с преподаване на чужди езици Петър Богдан', b: [null, 4.99, 4.91, 5.1, 4.59], m: [null, 5.422, null, 5.15, 4.8]};
s[452] = {l: 'ППМГ', n: 'Природо-математическа профилирана гимназия Св  Климент Охридски', b: [null, 4.767, 4.6, 4.72, 4.49], m: [null, 5.054, null, 4.96, 4.95]};
s[453] = {l: 'Финансово-стопанска ПГ Васил Левски', n: 'Финансово-стопанска професионална гимназия Васил Левски', b: [null, 4.316, 4.38, 4.5, 4.24], m: [null, 4.553, null, 4.73, 4.41]};
s[454] = {l: 'ПГ по строителство, архитектура и компютърни науки', n: 'Професионална гимназия по строителство, архитектура и компютърни науки Проф  Арх  Стефан Стефанов', b: [null, 3.781, 3.65, 3.74, 3.74], m: [null, 3.953, null, 3.74, 3.93]};
s[455] = {l: 'Второ СУ Никола Йонков Вапцаров', n: 'Второ средно училище Никола Йонков Вапцаров', b: [null, 3.837, 3.83, 3.63, 3.66], m: [null, 3.844, null, 3.45, 3.56]};
s[456] = {l: 'Седмо СУ Йордан Радичков', n: 'Седмо средно училище Йордан Радичков', b: [null, 3.565, 3.26, 3.75, 3.22], m: [null, 3.886, null, 3.74, 3.47]};
s[457] = {l: 'ПГ по техника и електротехника', n: 'Професионална гимназия по техника и електротехника Христо Ботев', b: [null, 3.548, 3.47, 3.7, 3.44], m: [null, 3.626, null, 3.35, 3.33]};
s[458] = {l: 'Шесто СУ Отец Паисий', n: 'Шесто средно училище Отец Паисий', b: [null, 3.801, 3.52, 3.13, 3.23], m: [null, 3.664, null, 3.27, 3.46]};
s[459] = {l: 'ПГ по лека промишленост', n: 'Професионална гимназия по лека промишленост', b: [null, 3.413, 3.29, 3.29, 3.04], m: [null, 3.153, null, 3.15, 3.41]};
s[460] = {l: 'Пето СУ Христо Ботев', n: 'Пето средно училище Христо Ботев', b: [null, null, 3.36, 3.27, null], m: [null, 3.39, null, 2.79, null]};

// Кюстендил
s[461] = {l: 'ПМГ', n: 'Природоматематическа гимназия Проф  Емануил Иванов', b: [null, 5.039, 4.68, 5.01, 4.76], m: [null, 5.403, null, 5.08, 5.08]};
s[462] = {l: 'ЕГ', n: 'Езикова гимназия Д-р Петър Берон', b: [null, 4.766, 4.54, 4.86, 4.5], m: [null, 5.106, null, 5.09, 4.95]};
s[463] = {l: 'ПГ по икономика и мениджмънт', n: 'Професионална гимназия по икономика и мениджмънт Йордан Захариев', b: [null, 4.368, 3.95, 3.92, 3.84], m: [null, 4.106, null, 3.74, 3.92]};
s[464] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Никола Йонков Вапцаров', b: [null, 3.517, 3.44, 3.36, 3.48], m: [null, 3.593, null, 3.41, 3.61]};
s[465] = {l: 'Спортно училище', n: 'Спортно училище Васил Левски', b: [null, 3.052, 2.93, 2.88, 2.98], m: [null, 3.257, null, 3.16, 3.2]};
s[466] = {l: 'ПГ по лека промишленост', n: 'Професионална гимназия по лека промишленост Владимир Димитров-Майстора', b: [null, 2.915, 2.94, 2.77, 2.67], m: [null, 2.582, null, 3.01, 3.06]};
s[467] = {l: 'Професионална техническа гимназия', n: 'Професионална техническа гимназия Джон Атанасов', b: [null, 3.223, 2.89, 2.72, 2.96], m: [null, 3.213, null, 2.6, 3.11]};
s[468] = {l: 'ПГ по селско стопанство', n: 'Професионална гимназия по селско стопанство Св Климент Охридски', b: [null, 2.92, 2.7, null, 2.92], m: [null, null, null, null, 2.94]};

// Кърджали
s[471] = {l: 'ЕГ Христо Ботев', n: 'Езикова гимназия Христо Ботев', b: [null, 5.057, 4.91, 5.09, 5.03], m: [null, 5.275, null, 5.08, 4.92]};
s[472] = {l: 'СУ Петко Рачов Славейков', n: 'Средно училище Петко Рачов Славейков', b: [null, 4.528, 4.34, 4.7, 4.94], m: [null, 4.845, null, 4.74, 5.05]};
s[473] = {l: 'СУ Отец Паисий', n: 'Средно училище Отец Паисий с природоматематическа насоченост', b: [null, 4.142, 3.86, 3.96, 4.09], m: [null, 4.401, null, 4.13, 4.48]};
s[474] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика Алеко Константинов', b: [null, 3.531, 3.44, 3.56, 3.99], m: [null, 3.533, null, 3.14, 4.19]};
s[475] = {l: 'СУ Владимир Димитров - Майстора', n: 'Средно училище Владимир Димитров - Майстора', b: [null, null, 3.63, 3.8, 3.08], m: [null, null, null, 4.01, null]};
s[476] = {l: 'СУ Йордан Йовков', n: 'Средно училище Йордан Йовков', b: [null, 3.389, 3.19, 3.19, 3.33], m: [null, 3.705, null, 3.65, 3.76]};
s[477] = {l: 'ПГ по електротехника и електроника', n: 'Професионална гимназия по електротехника и електроника Капитан Петко войвода', b: [null, 3.477, 3.2, 3.24, 3.38], m: [null, 3.401, null, 3.53, 3.59]};
s[478] = {l: 'ПГ по туризъм', n: 'Професионална гимназия по туризъм Проф  д-р Асен Златаров', b: [null, 3.322, 3.13, 3.02, 3.09], m: [null, 3.504, null, 2.38, 4.41]};
s[479] = {l: 'ПГ по строителство', n: 'Професионална гимназия по строителство Христо Смирненски', b: [null, 2.981, 3.13, 3.25, 3.12], m: [null, 3.168, null, 3.33, 2.9]};
s[480] = {l: 'ПГ Васил Левски', n: 'Професионална гимназия Васил Левски', b: [null, 3.103, 2.69, 2.84, 3.0], m: [null, null, null, null, null]};
s[481] = {l: 'ПГ по селско и горско стопанство', n: 'Професионална гимназия по селско и горско стопанство', b: [null, 3.072, 2.78, 2.76, 2.85], m: [null, 3.081, null, 2.83, 2.79]};
s[482] = {l: 'ПГ по облекло и дизайн Евридика', n: 'Професионална гимназия по облекло и дизайн Евридика', b: [null, 2.885, 2.98, 2.57, 2.69], m: [null, 2.685, null, null, null]};

// Търговище
s[485] = {l: 'Първо СУ Св. Седмочисленици', n: 'Първо средно училище Свети Седмочисленици', b: [null, 4.921, 4.76, 4.8, 4.87], m: [null, 5.423, null, 5.24, 5.2]};
s[486] = {l: 'Второ СУ Проф. Никола Маринов', n: 'Второ средно училище Професор Никола Маринов', b: [null, 4.604, 4.46, 4.44, 4.46], m: [null, 4.871, null, 4.51, 4.76]};
s[487] = {l: 'ПГ по икономическа информатика', n: 'Професионална гимназия по икономическа информатика Джон Атанасов', b: [null, 4.148, 3.9, 3.89, 3.75], m: [null, 3.838, null, 4.04, 4.25]};
s[488] = {l: 'Професионална техническа гимназия', n: 'Професионална техническа гимназия Цар Симеон Велики', b: [null, 3.627, 3.52, 3.62, 3.58], m: [null, 3.904, null, 4.21, 3.91]};
s[489] = {l: 'ПГ по туризъм и хранително-вкусови технологии', n: 'Професионална гимназия по туризъм и хранително-вкусови технологии Алеко Константинов', b: [null, 3.697, 3.48, 3.54, 3.36], m: [null, 3.682, null, 3.66, 3.55]};
s[490] = {l: 'Спортно училище', n: 'Спортно училище Никола Симов', b: [null, 3.663, 3.67, 3.14, 3.08], m: [null, 3.937, null, 3.29, 3.48]};
s[491] = {l: 'ПГ по електротехника и строителство', n: 'Професионална гимназия по електротехника и строителство', b: [null, 3.2, 3.35, 3.07, 3.1], m: [null, 4.342, null, 3.54, null]};
s[492] = {l: 'ПГ по земеделие', n: 'Професионална гимназия по земеделие', b: [null, 3.316, 3.03, 2.81, 3.25], m: [null, 2.984, null, 2.99, 3.35]};
s[493] = {l: 'Специално училище за ученици с увреден слух', n: 'Специално училище за ученици с увреден слух Свети Иван Рилски', b: [null, 3.016, null, 3.16, 3.01], m: [null, null, null, null, null]};
s[494] = {l: 'ПГ с изучаване на чужди езици', n: 'Профилирана гимназия с изучаване на чужди езици Митрополит Андрей', b: [null, 4.418, null, null, null], m: [null, 4.933, null, null, null]};

// Ловеч
s[495] = {l: 'ЕГ Екзарх Йосиф I', n: 'Профилирана езикова гимназия Екзарх Йосиф I', b: [null, 5.368, 5.23, 5.39, 5.29], m: [null, 5.621, null, 5.19, 5.19]};
s[496] = {l: 'ППМГ', n: 'Профилирана природо-математическа гимназия', b: [null, 4.621, 4.33, 4.49, 4.34], m: [null, 4.851, null, 4.34, 4.5]};
s[497] = {l: 'СУ Св. Климент Охридски', n: 'Средно училище Свети Климент Охридски', b: [null, 4.575, 3.89, 3.96, 3.86], m: [null, 4.46, null, 3.93, 4.2]};
s[498] = {l: 'ПГ по ветеринарна медицина', n: 'Национална професионална гимназия по ветеринарна медицина Проф  д-р Димитър Димов', b: [null, 3.824, 3.43, 3.73, 3.67], m: [null, 4.119, null, 3.96, 3.98]};
s[499] = {l: 'ПГ по икономика, търговия и услуги', n: 'Професионална гимназия по икономика търговия и услуги', b: [null, 4.063, 3.68, 3.8, 3.73], m: [null, 3.985, null, 3.54, 3.29]};
s[500] = {l: 'ПГ по механоелектротехника', n: 'Професионална гимназия по механоелектротехника', b: [null, 3.709, 3.42, 3.49, 3.51], m: [null, 4.11, null, 3.54, 3.76]};
s[501] = {l: 'СУ Тодор Кирков', n: 'Средно училище Тодор Кирков', b: [null, 3.737, 3.43, 3.29, 3.51], m: [null, 3.705, null, 3.15, 3.99]};
s[502] = {l: 'СУ Димитър Митев', n: 'Средно училище Димитър Митев', b: [null, null, null, 2.96, 3.0], m: [null, null, null, null, 2.95]};

// Силистра
s[505] = {l: 'ЕГ Пейо Яворов', n: 'Езикова гимназия Пейо Яворов', b: [null, 5.114, 5.03, 5.06, 4.98], m: [null, 5.453, null, 5.33, 5.16]};
s[506] = {l: 'ПМГ', n: 'Природоматематическа гимназия Св Климент Охридски', b: [null, 4.776, 4.61, 4.92, 4.94], m: [null, 5.191, null, 5.08, 5.07]};
s[507] = {l: 'СУ Никола Йонков Вапцаров', n: 'Средно училище Никола Йонков Вапцаров', b: [null, 4.35, 3.92, 4.05, 4.48], m: [null, 4.725, null, 4.27, 4.88]};
s[508] = {l: 'ПГ по стопанско управление, администрация и услуги Атанас Буров', n: 'Професионална гимназия по стопанско управление, администрация и услуги Атанас Буров', b: [null, 4.479, 4.22, 4.3, 4.51], m: [null, 4.33, null, 3.94, 4.54]};
s[509] = {l: 'Спортно училище', n: 'Спортно училище Дръстър', b: [null, 3.584, 3.43, 3.53, 3.38], m: [null, 3.716, null, 4.51, null]};
s[510] = {l: 'ПГ по производствени технологии', n: 'Професионална гимназия по производствени технологии Евлогий Георгиев', b: [null, 3.701, 3.26, 3.43, 3.45], m: [null, 3.993, null, 3.93, 3.51]};
s[511] = {l: 'ПГ по механотехника', n: 'Професионална гимназия по механотехника Владимир Комаров', b: [null, 3.405, 3.27, 3.43, 3.32], m: [null, 4.08, null, 3.96, null]};
s[512] = {l: 'Професионална земеделска гимназия', n: 'Професионална земеделска гимназия Добруджа', b: [null, 3.058, 2.92, 3.02, 3.14], m: [null, 3.227, null, 3.37, 3.71]};
s[513] = {l: 'ПГ по лека промишленост', n: 'Професионална гимназия по лека промишленост Пенчо Славейков', b: [null, 3.074, 3.03, 3.19, null], m: [null, 3.17, null, 3.36, null]};
s[514] = {l: 'ПГ по строителство Пеньо Пенев', n: 'Професионална гимназия по строителство Пеньо Пенев', b: [null, 3.225, 3.42, 2.94, 3.44], m: [null, 3.343, null, 3.15, 2.48]};

// Разград
s[515] = {l: 'ГПЧЕ Екзарх Йосиф', n: 'Профилирана гимназия с преподаване на чужди езици Екзарх Йосиф', b: [null, 4.958, 4.97, 5.15, 4.75], m: [null, 5.21, null, 5.28, 5.06]};
s[516] = {l: 'ППМГ', n: 'Профилирана природоматематическа гимназия Академик Никола Обрешков', b: [null, 5.034, 4.72, 4.96, 5.15], m: [null, 5.101, null, 5.12, 5.14]};
s[517] = {l: 'ПГ по химични технологии и биотехнологии', n: 'Професионална гимназия по химични технологии и биотехнологии Мария Кюри', b: [null, 3.28, 3.19, 3.48, 3.46], m: [null, 3.36, null, 3.8, 5.43]};
s[518] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика Робер Шуман', b: [null, 3.873, 3.71, 3.89, 3.71], m: [null, 3.871, null, 3.92, 3.93]};
s[519] = {l: 'Професионална техническа гимназия', n: 'Национална професионална техническа гимназия Шандор Петьофи', b: [null, 3.71, 3.58, 3.64, 3.67], m: [null, 3.719, null, 3.86, 4.09]};
s[520] = {l: 'СУ Христо Ботев', n: 'Средно училище Христо Ботев', b: [null, 3.303, 3.44, 3.09, null], m: [null, 3.37, null, 3.38, null]};
s[521] = {l: 'ПГ по транспорт и строителство', n: 'Професионална гимназия по транспорт и строителство Христо Смирненски', b: [null, 3.46, 3.35, 3.23, 3.28], m: [null, 5.84, null, null, null]};
s[522] = {l: 'ПГ по облекло', n: 'Професионална гимназия по облекло Станка Николица Спасо-Еленина', b: [null, 3.377, 3.12, 3.26, 3.27], m: [null, 3.572, null, null, null]};
s[523] = {l: 'Спортно училище', n: 'Спортно училище - Разград', b: [null, 3.073, 3.13, 3.14, 3.3], m: [null, 2.82, null, null, null]};
s[524] = {l: 'ПГ по селско стопанство и хранително-вкусови технологии', n: 'Професионална гимназия по селско стопанство и хранително-вкусови технологии Ангел Кънчев', b: [null, 3.074, 3.01, 3.0, 2.93], m: [null, 3.47, null, 3.17, 2.96]};

// Смолян
s[525] = {l: 'ЕГ Иван Вазов', n: 'Езикова гимназия Иван Вазов', b: [null, 5.105, 4.96, 5.06, 5.08], m: [null, 5.365, null, 5.19, 5.1]};
s[526] = {l: 'ППМГ Васил Левски', n: 'Профилирана природо-математическа гимназия Васил Левски', b: [null, 5.016, 4.64, 5.09, 5.12], m: [null, 5.29, null, 5.16, 5.21]};
s[527] = {l: 'СУ Св. Св. Кирил и Методий', n: 'Средно училище Св  Св  Кирил и Методий', b: [null, 4.555, 4.14, 4.65, 4.72], m: [null, 4.659, null, 4.72, 5.04]};
s[528] = {l: 'ПГ по икономика Карл Маркс', n: 'Професионална гимназия по икономика Карл Маркс', b: [null, 4.074, 3.94, 4.14, 4.03], m: [null, 3.982, null, 4.4, 4.14]};
s[529] = {l: 'СУ Отец Паисий', n: 'Средно училище Отец Паисий', b: [null, 4.215, 3.75, 4.08, null], m: [null, 4.32, null, 4.49, null]};
s[530] = {l: 'ПГ за приложни изкуства', n: 'Професионална гимназия за приложни изкуства', b: [null, 4.025, 4.07, null, 3.89], m: [null, null, null, null, null]};
s[531] = {l: 'ПГ по туризъм и строителство', n: 'Смолянска професионална гимназия по туризъм и строителство Никола Й  Вапцаров', b: [null, 4.028, 3.64, 3.96, 3.79], m: [null, 3.467, null, 3.49, 3.95]};
s[532] = {l: 'ПГ по техника и технологии', n: 'Професионална гимназия по техника и технологии Христо Ботев', b: [null, 3.507, 3.49, 3.64, 3.4], m: [null, 3.631, null, 3.6, 3.01]};
