// https://data.egov.bg/data/view/066b4b04-d81d-444e-a61c-8ca0516079e4

let s = [];

// София
s[1] = {l: '1 АЕГ', n: 'Първа английска ЕГ', b: [null, 5.469, 5.37, 5.44, 5.36], m: [null, 5.837, null, 5.62, 5.61]};
s[2] = {l: '1 СУ', n: '1 СУ П. Славейков', b: [null, 4.483, 4.47, 4.54, 4.36], m: [null, 4.805, null, 4.46, 4.64]};
s[3] = {l: '2 АЕГ', n: 'Втора английска ЕГ', b: [null, 5.309, 5.33, 5.38, 5.31], m: [null, 5.717, null, 5.55, 5.52]};
s[4] = {l: '2 СУ', n: '2 СУ Акад. Емилиян Станев', b: [null, 4.561, 4.46, 4.48, 4.45], m: [null, 4.911, null, 4.82, 4.82]};
s[5] = {l: '7 СУ', n: '7 СУ Св. Седмочисленици', b: [null, 4.727, 4.69, 4.7, 4.6], m: [null, 5.432, null, 5.1, 4.97]};
s[6] = {l: '9 ФЕГ', n: '9 Френска ЕГ Алфонс дьо Ламартин', b: [null, 5.324, 5.28, 5.45, 5.26], m: [null, 5.409, null, 5.33, 5.22]};
s[7] = {l: '12 СУ', n: '12 СУ Цар Иван Асен II', b: [null, 4.519, 4.55, 4.48, 4.55], m: [null, 4.974, null, 4.66, 4.73]};
s[8] = {l: '18 СУ', n: '18 СУ Уилям Гладстон', b: [null, 5.201, 5.13, 5.17, 5.05], m: [null, 5.414, null, 5.15, 5.13]};
s[9] = {l: '19 СУ', n: '19 СУ Елин Пелин', b: [null, 4.35, 4.45, 4.57, 4.57], m: [null, 4.697, null, 4.67, 4.82]};
s[10] = {l: '21 СУ', n: '21 СУ Христо Ботев', b: [null, 4.387, 4.35, 4.34, 4.6], m: [null, 5.167, null, 4.63, 4.97]};
s[11] = {l: '22 СУ', n: '22 СЕУ Георги С. Раковски', b: [null, 5.109, 5.16, 5.21, 5.17], m: [null, 5.425, null, 5.25, 5.25]};
s[12] = {l: '23 СУ', n: '23 СУ Фредерик Жолио-Кюри', b: [null, 4.137, 4.3, 4.28, 4.08], m: [null, 4.565, null, 4.53, 4.38]};
s[13] = {l: '26 СУ', n: '26 СУ Йордан Йовков', b: [null, 4.015, 3.49, 4.01, 4.02], m: [null, 4.25, null, 4.45, 4.24]};
s[14] = {l: '30 СУ', n: '30 СУ Братя Миладинови', b: [null, 5.112, 4.92, 4.78, 4.78], m: [null, 5.021, null, 4.91, 4.83]};
s[15] = {l: '31 СУ', n: '31 СУ Иван Вазов', b: [null, 5.25, 5.19, 5.2, 5.12], m: [null, 5.539, null, 5.23, 5.23]};
s[16] = {l: '32 СУ', n: '32 СУ Св. Климент Охридски', b: [null, 5.254, 5.02, 5.19, 5.25], m: [null, 5.653, null, 5.25, 5.56]};
s[17] = {l: '33 ЕГ', n: '33 ЕГ Света София', b: [null, 4.413, 4.39, 4.6, 4.67], m: [null, 4.693, null, 4.54, 4.93]};
s[18] = {l: '35 СУ', n: '35 СЕУ Добри Войников', b: [null, 5.276, 5.34, 5.42, 5.31], m: [null, 5.125, null, 5.06, 4.97]};
s[19] = {l: '36 СУ', n: '36 СУ Максим Горки', b: [null, 4.237, 4.22, 4.03, 4.08], m: [null, 4.709, null, 4.3, 4.37]};
s[20] = {l: '39 СУ', n: '39 СУ Петър Динеков', b: [null, 3.915, 3.74, 4.59, 3.64], m: [null, 4.554, null, 4.9, 3.39]};
s[21] = {l: '44 СУ', n: '44 СУ Неофит Бозвели', b: [null, 4.405, 4.39, 4.22, 4.51], m: [null, 4.405, null, 4.09, 4.54]};
s[22] = {l: '51 СУ', n: '51 СУ Елисавета Багряна', b: [null, 4.452, 4.42, 4.8, 4.58], m: [null, 4.822, null, 5.02, 4.97]};
s[23] = {l: '54 СУ', n: '54 СУ Св. Иван Рилски', b: [null, 4.424, 4.54, 4.37, 4.28], m: [null, 4.897, null, 4.55, 4.53]};
s[24] = {l: '56 СУ', n: '56 СУ Проф. Константин Иречек', b: [null, 4.19, 4.24, 4.29, 4.61], m: [null, 4.323, null, 4.3, 4.76]};
s[25] = {l: '73 СУ', n: '73 СУ Владислав Граматик', b: [null, 5.585, 5.6, 5.63, 5.58], m: [null, 5.623, null, 5.54, 5.24]};
s[26] = {l: '79 СУ', n: '79 СУ Индира Ганди', b: [null, 4.204, 3.74, 3.65, 4.11], m: [null, 4.213, null, 4.04, 4.38]};
s[27] = {l: '81 СУ', n: '81 СУ Виктор Юго', b: [null, 4.286, 4.2, 4.08, 4.33], m: [null, 4.848, null, 4.16, 4.53]};
s[28] = {l: '88 СУ', n: '88 СУ Димитър Попниколов', b: [null, 4.157, 4.48, 4.33, 3.97], m: [null, 4.659, null, 4.57, 4.45]};
s[29] = {l: '91 НЕГ', n: '91 немска ЕГ', b: [null, 5.624, 5.64, 5.7, 5.63], m: [null, 5.782, null, 5.75, 5.63]};
s[30] = {l: '95 СУ', n: '95 СУ Проф. Иван Шишманов', b: [null, 3.931, 3.87, 3.91, 4.01], m: [null, 4.098, null, 3.99, 4.36]};
s[31] = {l: '96 СУ', n: '96 СУ Лев Николаевич Толстой', b: [null, 4.58, 4.47, 4.41, 4.31], m: [null, 4.513, null, 4.52, 4.35]};
s[32] = {l: '97 СУ', n: '97 СУ Братя Миладинови', b: [null, 3.957, 3.9, 3.97, 3.76], m: [null, 3.924, null, 4.13, 4.38]};
s[33] = {l: '101 СУ', n: '101 СУ Бачо Киро', b: [null, 3.815, 3.97, 4.15, 3.93], m: [null, 3.948, null, 4.23, 4.33]};
s[34] = {l: '105 СУ', n: '105 СУ Атанас Далчев', b: [null, 4.42, 4.35, 4.16, 4.23], m: [null, 4.65, null, 4.4, 4.41]};
s[35] = {l: '108 СУ', n: '108 СУ Никола Беловеждов', b: [null, 4.178, 3.93, 3.95, 3.89], m: [null, 4.537, null, 4.0, 4.06]};
s[36] = {l: '118 СУ', n: '118 СУ Акад. Людмил Стоянов', b: [null, 4.109, 3.92, 4.26, 4.01], m: [null, 4.494, null, 4.19, 4.59]};
s[37] = {l: '119 СУ', n: '119 СУ Акад. Михаил Арнаудов', b: [null, 4.501, 4.45, 4.59, 4.58], m: [null, 4.908, null, 4.84, 4.87]};
s[38] = {l: '127 СУ', n: '127 СУ Иван Николаевич Денкоглу', b: [null, 4.818, 4.79, 4.97, 4.74], m: [null, 5.228, null, 5.01, 4.84]};
s[39] = {l: '128 СУ', n: '128 СУ Алберт Айнщайн', b: [null, 4.309, 3.89, 3.97, 4.02], m: [null, 4.584, null, 4.23, 4.34]};
s[40] = {l: '131 СУ', n: '131 СУ Климент Аркадиевич Тимирязев', b: [null, 3.942, 4.12, 3.92, 3.9], m: [null, 3.94, null, 3.85, 4.02]};
s[41] = {l: '132 СУ', n: '132 СУ Ваня Войнова', b: [null, 3.906, 3.57, 4.06, 3.95], m: [null, 4.012, null, 4.19, 4.24]};
s[42] = {l: '133 СУ', n: '133 СУ Александър Сергеевич Пушкин', b: [null, 5.296, 5.21, 5.34, 5.25], m: [null, 5.449, null, 5.27, 5.22]};
s[43] = {l: '134 СУ', n: '134 СУ Димчо Дебелянов', b: [null, 4.867, 4.86, 4.9, 4.84], m: [null, 5.307, null, 5.14, 5.37]};
s[44] = {l: '135 СУ', n: '135 СУ Ян Амос Коменски', b: [null, 3.906, 3.77, 4.11, 4.14], m: [null, 3.973, null, 4.26, 4.23]};
s[45] = {l: '137 СУ', n: '137 СУ Ангел Кънчев', b: [null, 4.391, 4.05, 4.23, 4.39], m: [null, 4.918, null, 4.45, 4.85]};
s[46] = {l: '138 СУ', n: '138 СУ Проф. Васил Златарски', b: [null, 4.575, 4.58, 4.47, 4.37], m: [null, 4.949, null, 4.55, 4.43]};
s[47] = {l: '144 СУ', n: '144 СУ Народни будители', b: [null, 4.127, 4.12, 4.3, 4.1], m: [null, 4.077, null, 4.21, 4.23]};
s[48] = {l: '157 СУ', n: '157 СУ Сесар Вайехо', b: [null, 5.133, 4.95, 5.07, 4.88], m: [null, 4.998, null, 4.94, 4.87]};
s[49] = {l: '164 СУ', n: '164 СУ Мигел де Сервантес', b: [null, 5.605, 5.54, 5.56, 5.62], m: [null, 5.538, null, 5.55, 5.67]};
s[50] = {l: '203 ЕГ', n: '203 Профилирана ЕГ Свети Методий', b: [null, 4.304, 4.07, 4.26, 4.05], m: [null, 4.835, null, 4.47, 4.3]};
s[51] = {l: 'Гимназия за приложни изкуства', n: 'Гимназия за приложни изкуства Св. Лука', b: [null, 4.457, 4.34, 4.6, 4.52], m: [null, 3.732, null, 4.85, 4.95]};
s[52] = {l: 'Гимназия по строит., арх. и геод.', n: 'Гимназия по строителство, архитектура и геодезия', b: [null, 4.881, 4.79, 4.88, 4.94], m: [null, 4.93, null, 4.45, 4.79]};
s[53] = {l: 'Духовна семинария', n: 'Софийска духовна семинария', b: [null, 3.773, 3.66, 3.89, 4.03], m: [null, 3.768, null, 3.95, 4.67]};
s[54] = {l: 'Луи Брайл', n: 'Специално училище за ученици с нарушено зрение Луи Брайл', b: [null, 4.647, 4.92, 5.6, 5.31], m: [null, 4.412, null, 5.71, 4.58]};
s[55] = {l: 'Национално СУ', n: 'Национално СУ София', b: [null, 4.037, 3.96, 4.04, 3.7], m: [null, 4.24, null, 4.24, 4.27]};
s[56] = {l: 'НГДЕК', n: 'Национална гимназия за древни езици и култури', b: [null, 5.426, 5.18, 5.3, 5.36], m: [null, 5.454, null, 5.23, 5.24]};
s[57] = {l: 'НМУ', n: 'Национално музикално училище', b: [null, 4.621, 4.48, 4.62, 4.74], m: [null, 4.993, null, 4.64, 5.07]};
s[58] = {l: 'НПМГ', n: 'НПМГ Акад. Любомир Чакалов', b: [null, 5.143, 5.19, 5.28, 5.17], m: [null, 5.537, null, 5.49, 5.4]};
s[59] = {l: 'НУКК', n: 'НУКК (Италиански лицей)', b: [null, 5.062, 4.92, 5.2, 5.17], m: [null, 5.562, null, 5.38, 5.22]};
s[60] = {l: 'ПГ за изобр. изкуства', n: 'ПГ за изобразителни изкуства', b: [null, 4.19, 3.92, 4.28, 4.34], m: [null, 3.45, null, null, 4.18]};
s[61] = {l: 'ПГ по аудио, видео и телек.', n: 'ПГ по аудио, видое и телекомуникация', b: [null, 3.926, 3.72, 3.97, 3.79], m: [null, 4.365, null, 4.12, 4.12]};
s[62] = {l: 'ПГ по дизайн', n: 'ПГ по дизайн', b: [null, 4.233, 3.93, 4.21, 4.19], m: [null, 4.415, null, 4.03, 4.82]};
s[63] = {l: 'ПГ по екол. и биот.', n: 'ПГ по екология и биотехнологии', b: [null, 4.262, 4.26, 4.29, 4.21], m: [null, 4.418, null, 4.43, 4.09]};
s[64] = {l: 'ПГ по електроника', n: 'ПГ по електроника', b: [null, 4.483, 4.4, 4.58, 4.58], m: [null, 4.972, null, 4.85, 4.67]};
s[65] = {l: 'ПГ по електрот. и авт.', n: 'ПГ по електротехника и автоматика', b: [null, 4.079, 4.04, 4.18, 4.09], m: [null, 4.627, null, 4.58, 4.52]};
s[66] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [null, 4.077, 4.06, 3.87, 4.02], m: [null, 4.455, null, 4.58, 3.62]};
s[67] = {l: 'ПГ по полигр. и фотогр.', n: 'ПГ по полиграфия и фотография', b: [null, 4.771, 4.57, 4.36, 4.57], m: [null, null, null, null, 3.14]};
s[68] = {l: 'ПГ по прец. техн. и опт.', n: 'ПГ по прецизна техника и оптика', b: [null, 4.432, 4.25, 4.52, 4.42], m: [null, 4.861, null, 4.56, 4.65]};
s[69] = {l: 'ПГ по телекомуникации', n: 'ПГ по телекомуникации', b: [null, 4.151, 4.23, 4.33, 4.25], m: [null, 4.921, null, 4.66, 4.67]};
s[70] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 4.499, 4.34, 4.26, 4.22], m: [null, 4.58, null, 4.57, 4.7]};
s[71] = {l: 'Румънска гимназия', n: 'Румънска гимназия Михай Еминеску', b: [null, 3.962, 4.42, 4.71, 4.72], m: [null, 4.248, null, 4.68, 4.82]};
s[72] = {l: 'СМГ', n: 'СМГ Паисий Хилендарски', b: [null, 5.517, 5.44, 5.48, 5.42], m: [null, 5.828, null, 5.74, 5.68]};
s[73] = {l: 'Сп.У ген. В. Стойчев', n: 'Спортно у-ще ген. Владимир Стойчев', b: [null, 3.859, 3.72, 3.88, 3.77], m: [null, 4.091, null, 4.2, 4.12]};
s[74] = {l: 'ТУЕС', n: 'ТУЕС към Технически Университет', b: [null, 4.916, 4.9, 5.06, 5.11], m: [null, 5.604, null, 5.27, 5.22]};
s[75] = {l: 'Търговско-банкова гимназия', n: 'Търговско-банкова гимназия', b: [null, 5.026, 4.82, 5.0, 4.87], m: [null, 5.258, null, 5.0, 4.85]};
s[76] = {l: 'У-ще за изящни изкуства', n: 'Училище за изящни изкуства', b: [null, 4.491, 4.55, 4.62, 4.64], m: [null, 5.93, null, 4.88, 4.03]};
s[77] = {l: 'У-ще за танцово изкуство', n: 'Училище за танцово изкуство', b: [null, 4.154, 4.14, 4.37, 4.45], m: [null, 3.396, null, null, null]};
s[78] = {l: 'Финансово-стопанска гимназия', n: 'Финансово-стопанска гимназия', b: [null, 5.108, 5.09, 5.05, 4.85], m: [null, 5.351, null, 4.97, 4.94]};

s[79] = {l: 'Абрахам Линкълн', n: 'ЧСУ с чуждоезиков профил Абрахам Линкълн', b: [null, null, null, 4.67, null], m: [null, null, null, 5.49, null]};
s[80] = {l: 'Американски колеж', n: 'Американски колеж', b: [null, 5.546, 5.51, 5.59, 5.52], m: [null, 5.934, null, 5.74, 5.67]};
s[81] = {l: 'Банкер', n: 'ЧПГ Банкер', b: [null, 4.867, 4.71, 4.64, 4.63], m: [null, null, null, null, null]};
s[82] = {l: 'Банково дело', n: 'ЧПГ по банково дело търговия и финанси', b: [null, 4.187, 4.07, 4.07, null], m: [null, 5.018, null, 4.46, null]};
s[83] = {l: 'Британика', n: 'ЧСЕУ Британика', b: [null, 4.431, 4.77, 4.51, 4.74], m: [null, 5.038, null, 5.27, 4.78]};
s[84] = {l: 'В. Златарски', n: 'ЧЕГ Проф. д-р В. Златарски', b: [null, 5.003, 5.18, 5.09, 4.91], m: [null, 5.82, null, 5.64, 5.54]};
s[85] = {l: 'Веда', n: 'ЧСУ с немски език Веда', b: [null, 5.045, 5.01, 4.7, 5.15], m: [null, 5.637, null, 5.16, 5.42]};
s[86] = {l: 'Дорис Тенеди', n: 'ЧЕСУ Дорис Тенеди', b: [null, 5.341, 5.46, 5.3, 5.15], m: [null, 5.726, null, 5.73, 5.44]};
s[87] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [null, 4.659, 4.54, 4.62, 4.48], m: [null, 5.383, null, 4.93, 4.87]};
s[88] = {l: 'Езиков свят', n: 'ЧПГ с чуждоезиково обучение Езиков свят', b: [null, 4.284, 4.15, 4.01, 4.63], m: [null, 5.317, null, 4.21, 4.96]};
s[89] = {l: 'Ерих Кестнер', n: 'ЧНГ Ерих Кестнер', b: [null, 5.249, 5.25, 5.39, 5.1], m: [null, 5.507, null, 5.46, 5.33]};
s[90] = {l: 'Иван Апостолов', n: 'ЧЕГ Проф. Иван Апостолов', b: [null, 4.902, 5.12, 4.89, 5.14], m: [null, 5.838, null, 5.54, 5.67]};
s[91] = {l: 'Меридиан 22', n: 'ЧПГ Меридиан 22', b: [null, 5.167, 5.13, 5.37, 5.04], m: [null, 5.6, null, 5.61, 5.46]};
s[92] = {l: 'Обр. технологии', n: 'ЧПГ Образователни технологии', b: [null, 4.561, 4.25, 4.59, 4.44], m: [null, 5.383, null, 4.71, 4.89]};
s[93] = {l: 'Орфей', n: 'ЧСУ Орфей', b: [null, 3.965, 3.78, 3.74, 4.13], m: [null, 4.672, null, 4.84, 4.75]};
s[94] = {l: 'ПЧАГ', n: 'Първа частна английска гимназия', b: [null, 4.523, 4.53, 4.49, 4.37], m: [null, 5.465, null, 5.17, 5.06]};
s[95] = {l: 'ПЧМГ', n: 'Първа Частна Математическа Гимназия', b: [null, null, 5.41, 5.55, 5.45], m: [null, null, null, 5.78, 5.78]};
s[96] = {l: 'Рьорих', n: 'ЧСУ Рьорих', b: [null, 4.14, null, 4.47, 4.06], m: [null, 4.86, null, 4.55, 4.41]};
s[97] = {l: 'Св. Георги', n: 'ЧСУ Свети Георги', b: [null, null, null, null, 4.45], m: [null, null, null, null, 5.86]};
s[98] = {l: 'Св. Наум', n: 'ЧПСУ Свети Наум', b: [null, 4.636, 4.35, 4.55, 3.73], m: [null, 5.46, null, 4.61, 3.26]};
s[99] = {l: 'Увекинд', n: 'ЧСУ Увекинд', b: [null, 4.826, 4.8, 5.15, 4.83], m: [null, 5.65, null, 5.65, 5.63]};
s[100] = {l: 'Цар Симеон Велики', n: 'ЧСУ Цар Симеон Велики', b: [null, null, null, 3.81, 5.21], m: [null, null, null, 4.61, 5.27]};

// Пловдив
s[101] = {l: 'Духовна семинария', n: 'Пловдивска духовна семинария', b: [null, 4.09, 3.69, 4.17, 3.8], m: [null, 3.952, null, 3.73, 3.45]};
s[102] = {l: 'ЕГ Иван Вазов', n: 'ЕГ Иван Вазов', b: [null, 5.512, 5.34, 5.4, 5.3], m: [null, 5.382, null, 5.2, 5.18]};
s[103] = {l: 'ЕГ Пловдив', n: 'ЕГ Пловдив', b: [null, 5.6, 5.5, 5.43, 5.34], m: [null, 5.846, null, 5.62, 5.47]};
s[104] = {l: 'МГ Акад. Кирил Попов', n: 'МГ Акад. Кирил Попов', b: [null, 5.274, 5.24, 5.26, 5.18], m: [null, 5.337, null, 5.25, 5.17]};
s[105] = {l: 'НУМТИ', n: 'НУМТИ Добрин Петков', b: [null, 4.772, 4.58, 4.58, 4.57], m: [null, 4.915, null, 4.73, 4.37]};
s[106] = {l: 'ПГ по арх., строит. и геод.', n: 'ПГ по архитектура строителство и геодезия', b: [null, 4.486, 4.18, 4.27, 4.25], m: [null, 4.399, null, 4.2, 4.2]};
s[107] = {l: 'ПГ по битова техника', n: 'ПГ по битова техника', b: [null, 3.849, 3.69, 3.64, 3.65], m: [null, 4.235, null, 3.99, 4.03]};
s[108] = {l: 'ПГ по вътр. арх. и дърв.', n: 'ПГ по вътрешна архитектура и дървообработване', b: [null, 3.601, 3.28, 3.56, 3.53], m: [null, 3.412, null, 3.43, 3.79]};
s[109] = {l: 'ПГ по електрот. и електрон.', n: 'ПГ по електротехника и електроника', b: [null, 4.415, 4.01, 4.02, 4.31], m: [null, 4.67, null, 4.31, 4.44]};
s[110] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [null, 3.765, 3.56, 3.62, 3.65], m: [null, 4.035, null, 3.8, 4.0]};
s[111] = {l: 'ПГ по облекло', n: 'ПГ по облекло Ана Май', b: [null, 3.675, 3.58, 3.56, 3.81], m: [null, 3.31, null, 3.49, 3.75]};
s[112] = {l: 'ПГ по трансп. и стр. техн.', n: 'ПГ по транспорт и строителни технологии', b: [null, 3.493, 3.21, 3.16, 3.2], m: [null, 3.446, null, 3.33, 3.33]};
s[113] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Проф д-р Асен Златаров', b: [null, 4.29, 4.08, 4.17, 4.04], m: [null, 4.242, null, 4.12, 4.04]};
s[114] = {l: 'ПГ по хр. техн. и техника', n: 'ПГ по хранителни технологии и техника', b: [null, 4.007, 3.86, 4.05, 4.02], m: [null, 4.105, null, 4.16, 3.8]};
s[115] = {l: 'Сп.У Васил Левски', n: 'Спортно училище Васил Левски', b: [null, 3.907, 3.74, 3.82, 3.74], m: [null, 4.341, null, 4.23, 4.92]};
s[116] = {l: 'СУ Братя Миладинови', n: 'СУ Братя Миладинови', b: [null, 3.342, 3.34, 3.17, 3.45], m: [null, 3.589, null, 3.47, 3.48]};
s[117] = {l: 'СУ Димитър Матевски', n: 'СУ Димитър Матевски', b: [null, 3.704, 3.82, 3.81, 3.71], m: [null, 3.79, null, 3.65, 3.95]};
s[118] = {l: 'СУ Константин Величков', n: 'СУ Константин Величков', b: [null, 4.246, 4.02, 3.97, 3.93], m: [null, 3.691, null, 4.24, 3.95]};
s[119] = {l: 'СУ Любен Каравелов', n: 'СУ Любен Каравелов', b: [null, 3.892, 4.16, 3.73, 4.27], m: [null, 3.728, null, 3.7, 3.96]};
s[120] = {l: 'СУ Никола Вапцаров', n: 'СУ Никола Вапцаров', b: [null, 3.502, 3.39, 3.2, 3.56], m: [null, 3.686, null, 3.1, 3.7]};
s[121] = {l: 'СУ Пейо Крачолов Яворов', n: 'СУ Пейо Крачолов Яворов', b: [null, 4.048, 3.83, 3.91, 3.86], m: [null, 4.192, null, 3.99, 4.15]};
s[122] = {l: 'СУ Св. К. Кирил Философ', n: 'СУ Св. К. Кирил Философ', b: [null, 4.372, 4.12, 3.96, 3.79], m: [null, 4.247, null, 4.24, 4.14]};
s[123] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [null, 4.137, 3.69, 4.11, 3.7], m: [null, 4.099, null, 4.16, 3.95]};
s[124] = {l: 'СУ Св. Седмочисленици', n: 'СУ Св. Седмочисленици', b: [null, 3.719, 3.53, 3.64, 3.52], m: [null, 3.814, null, 3.65, 3.83]};
s[125] = {l: 'СУ Св. Климент Охридски', n: 'СУ Св. Климент Охридски', b: [null, 4.15, 4.13, 4.01, 4.2], m: [null, 4.702, null, 4.25, 4.26]};
s[126] = {l: 'СУ Св. П. Хилендарски', n: 'СУ Св. Паисий Хилендарски', b: [null, 4.389, 4.24, 4.22, 4.45], m: [null, 4.709, null, 4.32, 4.62]};
s[127] = {l: 'СУ Св. Патриарх Евтимий', n: 'СУ Св. Патриарх Евтимий', b: [null, 4.839, 4.69, 4.94, 4.64], m: [null, 4.902, null, 4.75, 4.69]};
s[128] = {l: 'СУ Св. Софроний Врачански', n: 'СУ Св. Софроний Врачански', b: [null, 4.01, 4.18, 4.27, 4.44], m: [null, 3.9, null, 4.64, 4.32]};
s[129] = {l: 'СУ Христо Г. Данов', n: 'СУ Христо Груев Данов', b: [null, 4.117, 3.64, 3.68, 3.72], m: [null, 3.91, null, 3.96, 3.84]};
s[130] = {l: 'СУ Цар Симеон Велики', n: 'СУ Цар Симеон Велики', b: [null, 4.507, null, 3.9, 3.56], m: [null, 4.872, null, 4.36, 4.01]};
s[131] = {l: 'СУ Черноризец Храбър', n: 'СУ Черноризец Храбър', b: [null, 4.525, 4.33, 4.32, 4.23], m: [null, 4.363, null, 4.44, 4.61]};
s[132] = {l: 'Сценични и екранни изкуства', n: 'Гимназия за сценични и екранни изкуства', b: [null, 4.227, 4.26, 4.36, 4.08], m: [null, null, null, 5.01, 3.39]};
s[133] = {l: 'Търговска гимназия', n: 'Търговска гимназия - Пловдив', b: [null, 5.418, 4.99, 5.24, 5.08], m: [null, 5.401, null, 5.29, 5.14]};
s[134] = {l: 'ФЕГ Антоан дьо Сент - Екзюпери', n: 'Френска ЕГ Антоан дьо Сент - Екзюпери', b: [null, 5.089, 4.95, 4.97, 4.74], m: [null, 5.113, null, 4.89, 4.92]};
s[135] = {l: 'Художествена гимназия', n: 'Художествена гимназия Цанко Лавренов', b: [null, 4.671, 4.44, 4.6, 4.39], m: [null, null, null, null, null]};
s[136] = {l: 'Хуманитарна гимназия', n: 'Хуманитарна гимназия Св. Св. Кирил и Методий', b: [null, 5.128, 5.09, 5.11, 5.08], m: [null, 5.183, null, 5.01, 5.12]};

s[137] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [null, 4.171, 4.94, 4.62, 4.52], m: [null, 4.585, null, 5.11, 4.51]};
s[138] = {l: 'Икономика и управление', n: 'ЧПГ по икономика и управление', b: [null, 4.018, 4.28, 4.4, 3.69], m: [null, 4.753, null, 5.19, 4.49]};
s[139] = {l: 'Класик', n: 'ЧПГ Класик', b: [null, 4.438, 4.72, 4.18, 4.25], m: [null, 4.993, null, 4.73, 4.41]};
s[140] = {l: 'Стоян Сариев', n: 'ЧЕГ Стоян Сариев', b: [null, 4.89, 4.37, 4.16, 4.39], m: [null, 5.192, null, 5.17, 4.92]};


// Варна
s[141] = {l: '1 ЕГ', n: '1 ЕГ', b: [null, 5.499, 5.34, 5.39, 5.58], m: [null, 5.848, null, 5.63, 5.63]};
s[142] = {l: '3 ПМГ', n: '3 ПМГ Акад. Методий Попов', b: [null, 4.831, 4.63, 4.79, 4.94], m: [null, 5.119, null, 4.78, 4.96]};
s[143] = {l: '4 ЕГ', n: '4 ЕГ', b: [null, 5.303, 5.13, 5.12, 5.15], m: [null, 5.353, null, 5.18, 5.22]};
s[144] = {l: '7 СУ', n: '7 СУ Найден Геров', b: [null, 4.12, 3.75, 3.75, 4.02], m: [null, 4.342, null, 4.09, 4.4]};
s[145] = {l: 'Варненска морска гимназия', n: 'Варненска морска гимназия', b: [null, 3.777, 3.54, 3.7, 3.75], m: [null, 3.968, null, 4.08, 4.09]};
s[146] = {l: 'Варненска търг. гимназия', n: 'Варненска търговска гимназия', b: [null, 4.792, 4.49, 4.75, 4.57], m: [null, 4.848, null, 4.65, 4.51]};
s[147] = {l: 'ГПЧЕ Йоан Екзарх', n: 'ГПЧЕ Йоан Екзарх', b: [null, 5.457, 5.38, 5.39, 5.4], m: [null, 5.51, null, 5.41, 5.32]};
s[148] = {l: 'МГ д-р Петър Берон', n: 'МГ Д-р Петър Берон', b: [null, 5.29, 5.14, 5.29, 5.37], m: [null, 5.533, null, 5.53, 5.43]};
s[149] = {l: 'НУИ', n: 'НУИ Добри Христов', b: [null, 4.44, 4.43, 4.61, 4.27], m: [null, 4.832, null, 4.64, 4.51]};
s[150] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 4.414, 4.27, 4.27, 4.25], m: [null, 4.832, null, 4.84, 4.74]};
s[151] = {l: 'Спец. у-ще за уч. с нар. зр.', n: 'Специално у-ще за ученици с нарушено зрение', b: [null, 4.176, null, 4.12, null], m: [null, 4.16, null, 4.47, null]};
s[152] = {l: 'Сп.У Г. Бенковски', n: 'Спортно училище Г. Бенковски', b: [null, 3.718, 3.69, 3.74, 3.69], m: [null, 4.413, null, 3.93, 4.78]};
s[153] = {l: 'СУ Ал. С. Пушкин', n: 'СУ Ал. С. Пушкин', b: [null, 4.76, 4.77, 4.66, 4.91], m: [null, 4.96, null, 4.73, 5.0]};
s[154] = {l: 'СУ Гео Милев', n: 'СУ Гео Милев', b: [null, 4.156, 4.03, 4.12, 4.09], m: [null, 4.603, null, 4.45, 4.44]};
s[155] = {l: 'СУ Димчо Дебелянов', n: 'СУ Димчо Дебелянов', b: [null, 4.041, null, 4.11, 4.41], m: [null, 4.105, null, 4.13, 4.41]};
s[156] = {l: 'СУ за хуман. науки и изк.', n: 'СУ за хуманитарни науки и изкуства', b: [null, 4.634, 4.65, 4.6, 4.63], m: [null, 4.723, null, 4.64, 4.68]};
s[157] = {l: 'СУ Любен Каравелов', n: 'СУ Любен Каравелов', b: [null, 3.744, 3.55, 3.52, 3.68], m: [null, 3.681, null, 3.48, 3.7]};
s[158] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [null, 3.799, 3.78, 3.79, 3.7], m: [null, 3.95, null, 3.5, 4.24]};
s[159] = {l: 'СУ Св. Климент Охридски', n: 'СУ Свети Климент Охридски', b: [null, 4.592, 4.39, 4.29, 4.28], m: [null, 4.887, null, 4.9, 4.73]};
s[160] = {l: 'ПГ по електротехника', n: 'ПГ по електротехника', b: [null, 4.014, 3.79, 3.81, 3.81], m: [null, 3.99, null, 4.17, 4.16]};
s[161] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 4.374, 4.17, 4.38, 4.08], m: [null, 4.385, null, 4.13, 4.31]};
s[162] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство архитектура и геодезия', b: [null, 3.948, 3.78, 3.77, 3.57], m: [null, 3.719, null, 3.69, 3.67]};
s[163] = {l: 'ПГ по хим. и хр.-вк. техн.', n: 'ПГ по химични и хранително-вкусови технологии', b: [null, 3.7, 3.83, 3.69, 3.52], m: [null, 3.856, null, 3.99, 3.67]};
s[164] = {l: 'ПГ по текстил и моден дизайн', n: 'ПГ по текстил и моден дизайн', b: [null, 3.681, 3.63, 3.65, 3.51], m: [null, 3.695, null, 3.87, 3.89]};
s[165] = {l: 'Проф. техн. гимназия', n: 'Професионална техническа гимназия', b: [null, 3.844, 3.72, 3.71, 3.67], m: [null, 4.099, null, 4.04, 4.02]};

s[166] = {l: 'А. Екзюпери', n: 'ЧПГ Антоан дьо Сент-Екзюпери', b: [null, 4.856, 4.57, 4.66, 4.6], m: [null, 5.469, null, 5.17, 5.04]};
s[167] = {l: 'Джордж Байрон', n: 'ЧЕГ Джордж Байрон', b: [null, 4.46, 4.09, 4.25, 4.14], m: [null, 4.915, null, 5.08, 4.49]};
s[168] = {l: 'Мечтатели', n: 'ЧСУ Мечтатели', b: [null, null, null, 3.95, null], m: [null, null, null, 3.11, null]};
s[169] = {l: 'Монтесори', n: 'ЧСУ Монтесори Варна', b: [null, null, null, null, 4.87], m: [null, null, null, null, 5.14]};
s[170] = {l: 'Конто Трейд', n: 'Частна Търговска Гимназия Конто Трейд', b: [null, 4.08, 4.23, 3.98, 4.18], m: [null, 4.254, null, 4.34, 4.32]};

// Бургас
s[171] = {l: 'Английска ЕГ', n: 'Английска ЕГ', b: [null, 5.224, 5.06, 5.06, 4.97], m: [null, 5.775, null, 5.32, 5.43]};
s[172] = {l: 'Вечерно СУ', n: 'Вечерно СУ Захари Стоянов', b: [null, 3.575, 3.2, 3.37, 3.28], m: [null, 3.524, null, 3.44, 3.49]};
s[173] = {l: 'НЕГ Гьоте', n: 'Немска ЕГ Гьоте', b: [null, 5.449, 5.28, 5.45, 5.36], m: [null, 5.646, null, 5.57, 5.37]};
s[174] = {l: 'НУМСИ', n: 'НУМСИ', b: [null, 4.747, 4.52, 4.65, 4.49], m: [null, 4.978, null, 4.78, 4.54]};
s[175] = {l: 'ПГ за романски езици', n: 'ПГ за романски езици', b: [null, 5.022, 4.88, 4.93, 4.89], m: [null, 5.095, null, 4.98, 5.13]};
s[176] = {l: 'ПГ за чужди езици', n: 'ПГ за чужди езици', b: [null, 4.712, 4.68, 4.78, 4.75], m: [null, 5.111, null, 4.8, 4.81]};
s[177] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване', b: [null, 3.125, 3.09, 3.27, 3.24], m: [null, 3.367, null, 3.53, 3.19]};
s[178] = {l: 'ПГ по ел. и ел.', n: 'ПГ по електротехника и електроника', b: [null, 3.843, 3.82, 3.72, 3.71], m: [null, 4.195, null, 4.0, 4.29]};
s[179] = {l: 'ПГ по м. кораб. и риб.', n: 'ПГ по морско корабоплаване и риболов', b: [null, 3.662, 3.64, null, 3.25], m: [null, 3.928, null, 3.53, null]};
s[180] = {l: 'ПГ по мех. и електр.', n: 'ПГ по механоелектротехника и електроника', b: [null, 4.247, 3.89, 4.02, 3.88], m: [null, 4.234, null, 4.21, 4.17]};
s[181] = {l: 'ПГ по сград. и инст.', n: 'ПГ по сградостроителство и инсталации', b: [null, 3.04, 2.87, 2.72, 2.96], m: [null, 3.037, null, 3.08, 2.92]};
s[182] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [null, 4.295, 4.14, 4.19, 4.16], m: [null, 4.432, null, 4.18, 4.23]};
s[183] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [null, 3.258, 3.13, 2.93, 2.98], m: [null, 3.437, null, 3.02, 3.14]};
s[184] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 4.114, 3.98, 3.88, 3.99], m: [null, 3.94, null, 4.11, 4.4]};
s[185] = {l: 'ПГ по хим. техн.', n: 'ПГ по химични технологии', b: [null, 3.902, 3.71, 3.9, 3.68], m: [null, 4.07, null, 3.89, 3.7]};
s[186] = {l: 'ППМГ', n: 'ППМГ', b: [null, 5.489, 5.24, 5.33, 5.29], m: [null, 5.766, null, 5.65, 5.51]};
s[187] = {l: 'Проф. техн. гимназия', n: 'Професионална техническа гимназия', b: [null, 3.46, 3.19, 3.06, 3.15], m: [null, 2.99, null, 2.82, 3.67]};
s[188] = {l: 'Сп.У Юрий Гагарин', n: 'Спортно у-ще Юрий Гагарин', b: [null, 3.456, 3.24, 3.43, 3.59], m: [null, 2.911, null, 3.66, 3.92]};
s[189] = {l: 'СУ Димчо Дебелянов', n: 'СУ Димчо Дебелянов', b: [null, 3.766, 3.71, 3.45, 3.53], m: [null, 4.103, null, 3.86, 3.89]};
s[190] = {l: 'СУ Добри Чинтулов', n: 'СУ Добри Чинтулов', b: [null, 3.517, 3.19, 3.34, 3.42], m: [null, 3.699, null, 3.56, 3.6]};
s[191] = {l: 'СУ Еп. К. Преславски', n: 'СУ Еп. К. Преславски', b: [null, 3.885, 3.71, 3.72, 3.99], m: [null, 4.115, null, 4.12, 4.05]};
s[192] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [null, 3.486, 3.16, 3.5, 3.21], m: [null, 3.557, null, 3.79, 3.38]};
s[193] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [null, 3.186, 3.14, 3.62, 3.26], m: [null, 3.448, null, 3.96, 3.22]};
s[194] = {l: 'СУ Конст. Петканов', n: 'СУ Константин Петканов', b: [null, 3.367, 3.12, 3.4, 2.84], m: [null, 3.545, null, 3.43, 2.31]};
s[195] = {l: 'СУ Петко Росен', n: 'СУ Петко Росен', b: [null, 3.32, 3.08, 3.16, 3.29], m: [null, 3.065, null, 3.22, 3.69]};
s[196] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [null, 4.192, 3.97, 3.79, 3.74], m: [null, 4.668, null, 3.95, 4.35]};
s[197] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [null, 2.961, 2.97, 4.01, null], m: [null, 2.854, null, 3.69, 2.73]};
s[198] = {l: 'Търговска гимназия', n: 'Търговска гимназия', b: [null, 4.99, 4.74, 4.92, 4.77], m: [null, 5.112, null, 4.9, 4.82]};

s[199] = {l: 'Британика', n: 'ЧПГ Британика', b: [null, 4.309, 4.27, 4.68, 4.88], m: [null, 4.895, null, 4.66, 4.28]};

// Русе
s[201] = {l: 'АЕГ Гео Милев', n: 'Английска ЕГ Гео Милев', b: [null, 4.966, 5.09, 5.11, 5.11], m: [null, 5.695, null, 5.6, 5.41]};
s[202] = {l: 'Духовно училище', n: 'Русенско духовно училище', b: [null, 3.402, 3.09, 3.48, 3.25], m: [null, 3.799, null, 3.47, 3.11]};
s[203] = {l: 'МГ Баба Тонка', n: 'МГ Баба Тонка', b: [null, 5.151, 5.09, 5.26, 5.19], m: [null, 5.695, null, 5.33, 5.54]};
s[204] = {l: 'НУИ', n: 'НУИ Проф. Веселин Стоянов', b: [null, 4.282, 4.17, 4.41, 4.3], m: [null, 4.437, null, 4.28, 4.39]};
s[205] = {l: 'ПГ по дърв. и вътр. арх.', n: 'ПГ по дървообработване и вътрешна архитектура', b: [null, 3.618, 2.95, 3.14, 3.58], m: [null, 4.115, null, null, 3.2]};
s[206] = {l: 'ПГ по ел. и ел.', n: 'ПГ по електротехника и електроника', b: [null, 3.911, 3.85, 3.99, 3.73], m: [null, 4.261, null, 4.28, 4.23]};
s[207] = {l: 'ПГ по икон. и упр.', n: 'ПГ по икономика и управление', b: [null, 4.865, 4.38, 4.75, 4.75], m: [null, 4.977, null, 4.78, 4.91]};
s[208] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [null, 3.459, 3.29, 3.27, 3.2], m: [null, 3.384, null, 2.74, 3.04]};
s[209] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [null, 3.633, 3.29, 3.45, 3.34], m: [null, 5.303, null, 3.0, null]};
s[210] = {l: 'ПГ по пром. техн.', n: 'ПГ по промишлени технологии', b: [null, 3.394, 3.25, 3.47, 3.34], m: [null, 2.87, null, null, 5.63]};
s[211] = {l: 'ПГ по селско стопанство', n: 'ПГ по селско стопанство', b: [null, 3.228, 3.11, 3.31, 3.07], m: [null, 3.241, null, 3.28, 3.15]};
s[212] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [null, 4.089, 4.02, 3.99, 3.9], m: [null, 4.109, null, 4.08, 3.83]};
s[213] = {l: 'ПГ по р. кор. и кор.', n: 'ПГ по речно корабостроене и корабоплаване', b: [null, 3.684, 3.3, 3.38, 3.32], m: [null, 3.803, null, 3.53, 3.49]};
s[214] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [null, 3.342, 3.32, 3.3, 3.44], m: [null, 2.83, null, 5.61, 4.04]};
s[215] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Иван П. Павлов', b: [null, 4.018, 3.87, 3.79, 3.72], m: [null, 4.142, null, 3.88, 3.82]};
s[216] = {l: 'Сп.У Майор А. Узунов', n: 'Спортно у-ще Майор А. Узунов', b: [null, 3.727, 3.45, 3.63, 3.21], m: [null, 4.018, null, 3.93, 3.71]};
s[217] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [null, 4.433, 4.4, 4.48, 4.68], m: [null, 4.974, null, 4.95, 5.01]};
s[218] = {l: 'СУ Възраждане', n: 'СУ Възраждане', b: [null, 4.197, 3.84, 3.89, 3.92], m: [null, 4.287, null, 4.03, 4.06]};
s[219] = {l: 'СУ за евр. езици', n: 'СУ за европейски езици', b: [null, 4.977, 4.92, 4.73, 4.73], m: [null, 5.164, null, 5.03, 5.03]};
s[220] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [null, 3.846, 3.8, null, 3.96], m: [null, 3.866, null, null, 4.16]};
s[221] = {l: 'СУ Фридрих Шилер', n: 'СУ Фридрих Шилер', b: [null, 5.0, 4.9, 4.95, 4.75], m: [null, 5.175, null, 5.18, 4.94]};
s[222] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [null, 4.658, 4.44, 4.51, 4.25], m: [null, 4.835, null, 4.59, 4.73]};

s[223] = {l: 'Джордж Байрон', n: 'ЧПАГ Джордж Байрон', b: [null, 4.533, 4.03, 3.97, 4.4], m: [null, 5.313, null, 4.7, 4.65]};
s[224] = {l: 'Леонардо да Винчи', n: 'Първо ЧСУ Леонардо да Винчи ООД', b: [null, 4.81, 4.68, 4.42, 4.65], m: [null, 5.554, null, 5.02, 5.08]};

// Стара Загора
s[225] = {l: 'Вечерно СУ', n: 'Вечерно СУ Захари Стоянов', b: [null, 3.629, 3.35, 3.59, 3.48], m: [null, 3.532, null, 3.73, 3.56]};
s[226] = {l: 'ГПЧЕ Ромен Ролан', n: 'ГПЧЕ Ромен Ролан', b: [null, 5.353, 5.28, 5.29, 5.24], m: [null, 5.569, null, 5.46, 5.34]};
s[227] = {l: 'НУМСИ', n: 'НУМСИ', b: [null, 4.578, 4.29, 4.05, 4.39], m: [null, 4.024, null, 4.12, 4.17]};
s[228] = {l: 'ПГ по ел. и техн.', n: 'ПГ по електротехника и технологии', b: [null, 3.641, 3.45, 3.38, 3.45], m: [null, 3.892, null, 3.51, 3.66]};
s[229] = {l: 'ПГ по електроника', n: 'ПГ по електроника', b: [null, 3.796, 3.5, 3.69, 3.59], m: [null, 3.859, null, 3.9, 4.15]};
s[230] = {l: 'ПГ по вет. медицина', n: 'Национална ПГ по ветеринарна медицина', b: [null, 3.806, 3.77, 3.86, 3.82], m: [null, 3.783, null, 3.95, 3.75]};
s[231] = {l: 'ПГ по механ. и тр.', n: 'ПГ по механотехника и транспорт Н  Й  Вапцаров', b: [null, 3.544, 3.34, 3.19, 3.28], m: [null, 3.394, null, 3.21, 3.36]};
s[232] = {l: 'ПГ по обл. и хран.', n: 'ПГ по облекло и хранене', b: [null, 3.868, 3.66, 3.82, 3.63], m: [null, 4.32, null, 4.07, 3.87]};
s[233] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [null, 4.647, 4.38, 4.38, 4.42], m: [null, 4.726, null, 4.32, 4.47]};
s[234] = {l: 'ПГ по стр. и дърв.', n: 'ПГ по строителство и дървообработване', b: [null, 3.098, 2.97, 2.82, 3.15], m: [null, 3.0, null, 2.79, null]};
s[235] = {l: 'ППМГ Гео Милев', n: 'ППМГ Гео Милев', b: [null, 4.891, 4.87, 4.93, 4.82], m: [null, 5.12, null, 5.17, 4.95]};
s[236] = {l: 'Спортно у-ще', n: 'Спортно училище', b: [null, 3.642, 3.48, 3.29, 3.36], m: [null, 3.191, null, 3.49, 3.43]};
s[237] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [null, 4.09, 3.98, 4.05, 4.0], m: [null, 4.344, null, 4.27, 4.15]};
s[238] = {l: 'СУ Железник', n: 'СУ Железник', b: [null, 3.878, 2.26, 3.99, 3.57], m: [null, 3.983, null, 4.02, 3.82]};
s[239] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [null, 4.038, 3.92, 3.88, 3.87], m: [null, 4.126, null, 4.04, 3.98]};
s[240] = {l: 'СУ Максим Горки', n: 'СУ Максим Горки', b: [null, 4.697, 4.56, 4.66, 4.81], m: [null, 4.778, null, 4.9, 4.84]};
s[241] = {l: 'СУ Поп М. Кънчев', n: 'СУ Поп Минчо Кънев', b: [null, 3.133, 2.74, 3.2, 3.03], m: [null, null, null, null, null]};
s[242] = {l: 'СУ Хр. Смирненски', n: 'СУ Христо Смирненски', b: [null, 3.485, null, null, null], m: [null, 3.53, null, null, null]};
s[243] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [null, 3.369, 3.19, 3.32, null], m: [null, 3.088, null, 3.29, 2.84]};
s[244] = {l: 'Търговска гимназия', n: 'Търговска гимназия', b: [null, 5.095, 4.97, 4.98, 4.89], m: [null, 5.016, null, 4.64, 4.65]};

//Плевен
s[245] = {l: 'ГПЧЕ', n: 'ГПЧЕ', b: [null, 4.874, 4.77, 4.88, 4.81], m: [null, 5.314, null, 4.99, 5.15]};
s[246] = {l: 'МГ Гео Милев', n: 'МГ Гео Милев', b: [null, 5.154, 5.14, 5.13, 5.05], m: [null, 5.592, null, 5.21, 5.17]};
s[247] = {l: 'НУИ', n: 'НУИ Панайот Пипков', b: [null, 4.517, 4.15, 4.45, 4.3], m: [null, 4.333, null, 4.44, 4.3]};
s[248] = {l: 'ПГ Захарий Зограф', n: 'ПГ Захарий Зограф', b: [null, 3.153, 2.86, 2.67, 2.71], m: [null, 3.302, null, 2.42, 2.64]};
s[249] = {l: 'ПГ по ел. и хим. техн.', n: 'ПГ по електроника и химични технологии', b: [null, 4.028, 3.98, 4.09, 3.98], m: [null, 4.576, null, 4.71, 4.65]};
s[250] = {l: 'ПГ по лоз. и вин.', n: 'ПГ по лозарство и винарство', b: [null, 3.474, 3.22, 3.22, 3.28], m: [null, 3.58, null, 2.57, 4.22]};
s[251] = {l: 'ПГ по мениджмънт и хр. техн.', n: 'ПГ по мениджмънт и хранителни технологии', b: [null, 2.775, 2.86, 2.46, 2.71], m: [null, 3.61, null, 3.03, 2.9]};
s[252] = {l: 'ПГ по механ.', n: 'ПГ по механоелектротехника', b: [null, 3.73, 3.35, 3.56, 3.53], m: [null, 4.55, null, 4.04, 4.41]};
s[253] = {l: 'ПГ по облекло и текстил', n: 'ПГ по облекло и текстил', b: [null, 3.414, 3.44, 3.1, 3.01], m: [null, 2.93, null, 3.23, 4.01]};
s[254] = {l: 'ПГ по под., стр. и тр. техн.', n: 'ПГ по подемна строителна и транспортна техника', b: [null, 3.018, 2.9, 2.85, 3.1], m: [null, 3.024, null, 2.79, 3.48]};
s[255] = {l: 'ПГ по рест., търг. и обсл.', n: 'ПГ по ресторантьорство, търговия и обслужване', b: [null, 3.593, 3.61, 3.57, 3.47], m: [null, 3.778, null, 3.8, 3.69]};
s[256] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство архитектура и геодезия', b: [null, 4.052, 3.6, 3.74, 3.58], m: [null, 4.244, null, 3.64, 3.77]};
s[257] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [null, 3.322, 3.33, 3.22, 3.12], m: [null, 3.533, null, 3.9, 2.88]};
s[258] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 4.395, 4.08, 4.09, 4.11], m: [null, 4.488, null, 4.14, 4.6]};
s[259] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хранително-вкусови технологии', b: [null, 3.34, 3.22, 3.11, 3.31], m: [null, 3.1, null, 2.91, 3.51]};
s[260] = {l: 'Спортно у-ще', n: 'Спортно училище Георги Бенковски', b: [null, 3.675, 3.53, 3.67, 3.41], m: [null, 4.492, null, 4.39, 4.89]};
s[261] = {l: 'СУ Анастасия Димитрова', n: 'СУ Анастасия Димитрова', b: [null, 4.025, 3.3, 3.92, 3.34], m: [null, 4.21, null, 3.96, 3.32]};
s[262] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [null, 4.851, 4.81, 5.08, 4.93], m: [null, 5.229, null, 4.98, 5.04]};
s[263] = {l: 'СУ Пейо К. Яворов', n: 'СУ Пейо Крачолов Яворов', b: [null, 3.713, 3.85, 3.6, 3.7], m: [null, 4.009, null, 3.54, 3.96]};
s[264] = {l: 'СУ Стоян Заимов', n: 'СУ Стоян Заимов', b: [null, 4.342, 4.37, 4.58, 3.64], m: [null, 4.308, null, 4.99, 3.74]};
s[265] = {l: 'СУ Христо Смирненски', n: 'СУ Христо Смирненски', b: [null, 3.427, 3.14, 3.52, 3.41], m: [null, 3.603, null, 3.86, 3.65]};
s[266] = {l: 'Финансово-стопанска', n: 'Държавна финансово-стопанска гимназия', b: [null, 4.509, 4.3, 4.48, 4.45], m: [null, 4.494, null, 4.43, 4.67]};

// Сливен
s[271] = {l: 'Гимн. със зап. ез.', n: 'Профилирана гимназия с преподаване на западни езици', b: [null, 5.12, 4.95, 5.0, 5.06], m: [null, 5.419, null, 5.15, 5.2]};
s[272] = {l: 'ПГ по ел. и ел.', n: 'ПГ по електротехника и електроника', b: [null, 3.539, 3.39, 3.38, 3.37], m: [null, 3.605, null, 3.61, 3.47]};
s[273] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 4.417, 4.18, 4.43, 4.19], m: [null, 4.444, null, 4.27, 4.59]};
s[274] = {l: 'ПГ по механот,', n: 'ПГ по механотехника', b: [null, 3.045, 2.97, 3.02, 3.06], m: [null, 2.892, null, 3.15, 3.19]};
s[275] = {l: 'ПГ по стр. и геод.', n: 'Сливенска ПГ по строителство и геодезия', b: [null, 3.467, 3.43, 3.24, 3.35], m: [null, 3.34, null, 3.82, 3.67]};
s[276] = {l: 'ПГ по текстил и обл.', n: 'ПГ по текстил и облекло', b: [null, 3.334, 3.65, 3.28, 3.24], m: [null, 3.413, null, 3.47, 3.5]};
s[277] = {l: 'ПГ по хот. и тур.', n: 'ПГ по хотелиерство и туризъм', b: [null, 4.133, 4.1, 4.05, 4.32], m: [null, 4.02, null, 3.98, 4.36]};
s[278] = {l: 'ППМГ', n: 'ППМГ Добри Чинтулов', b: [null, 5.16, 4.86, 5.14, 4.77], m: [null, 5.458, null, 5.25, 5.12]};
s[279] = {l: 'Спортно у-ще', n: 'Спортно училище Димитър Рохов', b: [null, 3.745, 3.3, 3.66, 3.69], m: [null, 3.575, null, 3.61, 3.7]};
s[280] = {l: 'СУ Аргира Жечкова', n: 'СУ Аргира Жечкова', b: [null, null, 3.78, null, 3.82], m: [null, null, null, null, null]};
s[281] = {l: 'СУ К. Константинов', n: 'СУ Константин Константинов', b: [null, 4.165, 2.59, null, null], m: [null, 4.454, null, null, null]};
s[282] = {l: 'СУ Х. Мина Пашов', n: 'СУ Хаджи Мина Пашов', b: [null, 3.432, 2.82, 2.4, 3.03], m: [null, 3.601, null, null, 3.45]};
s[283] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [null, 3.642, 3.43, 3.62, 3.41], m: [null, 3.674, null, 3.84, 3.93]};
s[284] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо К. Яворов', b: [null, 3.917, 3.53, 3.77, 3.56], m: [null, 3.881, null, 3.81, 3.77]};
s[285] = {l: 'Худ. гимназия', n: 'Национална художествена гимназия', b: [null, 4.354, 3.92, 4.53, 4.38], m: [null, 4.026, null, 3.4, 3.47]};
s[286] = {l: 'Хуман. гимназия', n: 'Профилирана хуманитарна гимназия', b: [null, 4.458, 4.0, 4.47, 4.19], m: [null, 4.688, null, 4.83, 4.35]};

// Добрич
s[291] = {l: 'ЕГ Гео Милев', n: 'ЕГ Гео Милев', b: [null, 5.119, 5.27, 5.26, 5.11], m: [null, 5.399, null, 5.45, 5.26]};
s[292] = {l: 'ПГ по агр. стоп.', n: 'ПГ по аграрно стопанство', b: [null, 3.27, 3.24, 3.34, 3.25], m: [null, 3.544, null, 5.45, 2.97]};
s[293] = {l: 'ПГ по вет. медицина', n: 'ПГ по ветеринарна медицина Проф  д-р Георги Павлов', b: [null, 3.873, 3.58, 3.66, 3.84], m: [null, 3.998, null, 4.05, 3.95]};
s[294] = {l: 'ПГ по техн. и стр.', n: 'ПГ по техника и строителство', b: [null, 3.558, 3.31, 3.22, 3.24], m: [null, 6.0, null, 2.84, 3.07]};
s[295] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт обслужване и лека промишленост', b: [null, 3.314, 3.1, 3.14, 3.0], m: [null, 3.2, null, null, 2.62]};
s[296] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 3.86, 3.5, 3.63, 3.49], m: [null, 3.39, null, null, null]};
s[297] = {l: 'ПМГ Иван Вазов', n: 'ПМГ Иван Вазов', b: [null, 4.526, 4.37, 4.68, 4.47], m: [null, 4.928, null, 4.9, 4.88]};
s[398] = {l: 'Спортно у-ще', n: 'Спортно училище', b: [null, 3.11, 3.32, 3.23, 3.25], m: [null, 3.21, null, 3.29, 3.54]};
s[299] = {l: 'СУ Димитър Талев', n: 'СУ Димитър Талев', b: [null, 4.17, 4.08, 3.92, 4.18], m: [null, 4.74, null, 4.23, 4.53]};
s[300] = {l: 'СУ Любен Каравелов', n: 'СУ Любен Каравелов', b: [null, 3.846, 4.13, 4.08, 3.61], m: [null, 3.886, null, 4.2, 4.12]};
s[301] = {l: 'СУ Петко Славейков', n: 'СУ Петко Рачов Славейков', b: [null, 4.116, 4.41, 4.64, 4.19], m: [null, 4.771, null, 4.82, 4.81]};
s[302] = {l: 'СУ Св. Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [null, 4.511, 4.46, 4.41, 4.9], m: [null, 4.688, null, 4.44, 4.82]};
s[303] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [null, 4.193, 4.1, 4.26, 4.48], m: [null, 4.554, null, 4.57, 4.98]};
s[304] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска гимназия', b: [null, 4.356, 4.15, 4.32, 4.2], m: [null, 4.711, null, 4.3, 4.53]};

s[305] = {l: 'Леонардо да Винчи', n: 'ЧСУ Леонардо да Винчи', b: [null, null, 4.43, 4.55, 4.76], m: [null, null, null, 4.48, 4.94]};
s[306] = {l: 'Туризъм и предприемачество', n: 'Сдружение ЧПГ по туризъм и предприемачество', b: [null, 5.079, 5.07, 4.96, 5.15], m: [null, 5.514, null, 4.63, 5.26]};

// Шумен
s[311] = {l: 'Духовно училище', n: 'Духовно училище Нювваб', b: [null, 3.947, 3.59, 3.56, 3.67], m: [null, 3.846, null, 3.97, 4.14]};
s[312] = {l: 'ЕГ Никола Вапцаров', n: 'ЕГ Никола Йонков Вапцаров', b: [null, 5.007, 4.79, 4.96, 4.86], m: [null, 5.433, null, 5.2, 5.0]};
s[313] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 4.176, 3.92, 4.08, 3.97], m: [null, 4.165, null, 4.18, 4.12]};
s[314] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника електроника телекомуникации и транспорт', b: [null, 3.471, 3.48, 3.33, 3.5], m: [null, 3.606, null, 3.57, 3.85]};
s[315] = {l: 'ПГ по облекло', n: 'ПГ по облекло, хранене и химични технологии', b: [null, 3.553, 3.35, 3.53, 3.64], m: [null, 3.645, null, 3.64, 3.55]};
s[316] = {l: 'ПГ по с. стопанство', n: 'ПГ по селско стопанство и хранителни технологии', b: [null, 3.156, 3.04, 3.03, 3.14], m: [null, 3.448, null, 3.35, 3.5]};
s[317] = {l: 'ПГ по строителство', n: 'ПГ по строителство архитектура и геодезия', b: [null, 3.471, 3.37, 3.38, 3.23], m: [null, 3.618, null, 3.66, 3.63]};
s[318] = {l: 'ППМГ', n: 'ППМГ Нанчо Попович', b: [null, 4.904, 4.82, 5.1, 4.8], m: [null, 5.461, null, 5.18, 5.09]};
s[319] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [null, 3.66, 3.2, 3.62, 3.35], m: [null, 4.111, null, 3.96, 4.25]};
s[320] = {l: 'СУ Йоан Екз. Бълг.', n: 'СУ Йоан Екзарх Български', b: [null, 4.305, 4.28, 4.51, 4.28], m: [null, 4.509, null, 4.43, 4.48]};
s[321] = {l: 'СУ Панайот Волов', n: 'СУ Панайот Волов', b: [null, 4.279, 3.86, 4.09, 3.66], m: [null, 4.432, null, 4.25, 4.07]};
s[322] = {l: 'СУ Сава Доброплодни', n: 'СУ Сава Доброплодни', b: [null, 4.418, 4.3, 4.34, 4.75], m: [null, 4.835, null, 4.43, 4.82]};
s[323] = {l: 'СУ Трайко Симеонов', n: 'СУ Трайко Симеонов', b: [null, 3.496, 3.29, 3.29, 3.38], m: [null, 3.655, null, 3.71, 4.27]};

// Перник
s[325] = {l: 'V СУ', n: 'V СУ Петко Р. Славейков', b: [null, 3.486, 3.53, 2.77, 3.29], m: [null, 3.532, null, null, 3.54]};
s[326] = {l: 'VI СУ', n: 'VI СУ Св. Св. Кирил и Методий', b: [null, 3.898, 3.5, 4.01, 3.71], m: [null, 3.998, null, 4.18, 3.89]};
s[327] = {l: 'ГПЧЕ', n: 'ГПЧЕ Симеон Радев', b: [null, 5.093, 4.95, 4.98, 5.0], m: [null, 5.214, null, 5.01, 5.17]};
s[328] = {l: 'ПГ по енергетика', n: 'ПГ по енергетика и минна промишленост', b: [null, 3.266, 3.37, 3.31, 3.34], m: [null, 3.343, null, 3.43, 3.61]};
s[329] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 4.254, 3.96, 4.21, 4.03], m: [null, 4.303, null, 4.3, 4.37]};
s[330] = {l: 'ПГ Мария Кюри', n: 'Технологична ПГ Мария Кюри', b: [null, 3.584, 3.36, 3.02, 3.43], m: [null, 3.77, null, 3.14, 3.66]};
s[331] = {l: 'ПГ по облекло', n: 'ПГ по облекло и туризъм', b: [null, 3.549, 3.44, 3.56, 3.36], m: [null, 3.599, null, 3.74, 3.66]};
s[332] = {l: 'ПГ по техника', n: 'ПГ по техника и строителство', b: [null, 3.887, 3.67, 4.04, 3.78], m: [null, 3.923, null, 4.01, 4.2]};
s[333] = {l: 'ПМГ', n: 'ПМГ Христо Смирненски', b: [null, 4.507, 4.17, 4.52, 4.37], m: [null, 5.054, null, 4.77, 4.94]};
s[334] = {l: 'Спортно у-ще', n: 'Спортно училище Олимпиец', b: [null, 3.488, 3.28, 3.24, 3.23], m: [null, 3.33, null, 3.31, 3.61]};
s[335] = {l: 'СУРИЧЕ', n: 'СУРИЧЕ', b: [null, 4.758, 4.95, 4.61, 4.59], m: [null, 5.23, null, 4.99, 4.98]};

// Хасково
s[341] = {l: 'ЕГ', n: 'ЕГ Асен Златаров', b: [null, 5.077, 4.89, 5.05, 4.93], m: [null, 5.4, null, 5.25, 5.07]};
s[342] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване и строителство', b: [null, 3.84, 3.68, 3.63, 3.72], m: [null, 4.127, null, 4.14, 4.07]};
s[343] = {l: 'ПГ по л. пром.', n: 'ПГ по лека промишленост=', b: [null, 3.12, 3.05, 3.26, 2.93], m: [null, 3.028, null, 3.34, 2.96]};
s[344] = {l: 'ПГ по механ.', n: 'ПГ по механоелектротехника', b: [null, 3.305, 3.1, 3.2, 3.02], m: [null, 3.482, null, 3.48, 3.25]};
s[345] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт и аграрни технологии', b: [null, 3.146, 2.95, 3.08, 3.12], m: [null, 2.865, null, 3.07, 2.66]};
s[346] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 3.588, 3.4, 3.48, 3.24], m: [null, 3.59, null, 3.57, 3.4]};
s[347] = {l: 'ПМГ', n: 'ПМГ Акад. Боян Петканчин', b: [null, 5.169, 4.8, 5.21, 5.13], m: [null, 5.227, null, 4.97, 4.95]};
s[348] = {l: 'Спортно у-ще', n: 'Спортно у-ще Стефан Караджа', b: [null, 3.14, 3.03, 3.04, 3.12], m: [null, 3.438, null, 3.32, 3.18]};
s[349] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [null, 3.77, 3.57, 3.66, 3.72], m: [null, 4.47, null, 4.14, 4.25]};
s[350] = {l: 'СУ Св. П. Хилендарски', n: 'СУ Св. Паисий Хилендарски', b: [null, 3.94, 3.63, 3.51, 3.49], m: [null, 4.221, null, 3.78, 3.48]};
s[351] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска гимназия', b: [null, 4.251, 3.97, 4.0, 3.69], m: [null, 4.35, null, 3.97, 4.17]};

// Ямбол
s[355] = {l: 'Гимназия по строит.', n: 'Гимназия по строителство и архитектура, графика и дизайн', b: [null, 3.28, 3.33, 3.37, 3.5], m: [null, 2.964, null, 4.08, 3.61]};
s[356] = {l: 'ЕГ Васил Карагьозов', n: 'ЕГ Васил Карагьозов', b: [null, 4.737, 4.45, 4.81, 4.79], m: [null, 5.169, null, 4.9, 5.11]};
s[357] = {l: 'ПГ Васил Левски', n: 'Профилирана гимназия Васил Левски', b: [null, 4.506, 4.54, 4.78, 4.73], m: [null, 4.975, null, 4.86, 4.84]};
s[358] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 4.382, 3.8, 3.98, 3.97], m: [null, 4.962, null, 4.58, 4.82]};
s[359] = {l: 'ПГ по л. пром.', n: 'ПГ по лека промишленост, екология и химични технологии', b: [null, 3.049, 2.99, 3.74, 3.35], m: [null, 2.98, null, null, null]};
s[360] = {l: 'ПГ по хран. техн.', n: 'ПГ по хранителни технологии и туризъм', b: [null, 3.56, 3.44, 3.39, 3.31], m: [null, 3.623, null, 3.03, 2.98]};
s[361] = {l: 'ПГ по земеделие', n: 'ПГ по земеделие', b: [null, 3.01, 2.94, 2.85, 3.01], m: [null, 2.791, null, 2.82, 3.09]};
s[362] = {l: 'ПГ по подемна техн.', n: 'ПГ по подемна, строителна и транспортна техника', b: [null, 2.939, 2.75, 2.87, 2.85], m: [null, 2.923, null, 2.37, 2.7]};
s[363] = {l: 'ПМГ Атанас Радев', n: 'ПМГ Атанас Радев', b: [null, 5.197, 4.91, 5.08, 4.89], m: [null, 5.542, null, 5.19, 5.03]};
s[364] = {l: 'Спортно у-ще', n: 'Спортно училище Пиер дьо Кубертен', b: [null, 3.69, 3.49, 3.87, 3.87], m: [null, 3.271, null, 2.68, 5.92]};
s[365] = {l: 'СУ Св. Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [null, 4.062, 3.71, 3.98, 3.86], m: [null, 3.965, null, 4.28, 4.07]};
s[366] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [null, 3.696, 3.57, 3.62, 3.59], m: [null, 3.918, null, 4.18, 3.6]};

// Пазарджик
s[371] = {l: 'ЕГ Бертолт Брехт', n: 'ЕГ Бертолт Брехт', b: [null, 5.198, 4.98, 5.09, 5.12], m: [null, 5.416, null, 5.26, 5.16]};
s[372] = {l: 'ПМГ', n: 'ПМГ Константин Величков', b: [null, 4.822, 4.57, 4.94, 4.74], m: [null, 5.047, null, 4.86, 4.76]};
s[373] = {l: 'ПГ Иван С. Аксаков', n: 'Профилирана гимназия Иван С. Аксаков', b: [null, 4.246, 4.02, 3.87, 3.83], m: [null, 4.499, null, 4.15, 4.14]};
s[374] = {l: 'ПГ по икономика', n: 'ПГ по икономика и мениджмънт', b: [null, 4.291, 4.3, 4.43, 4.32], m: [null, 4.273, null, 4.13, 4.09]};
s[375] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [null, 3.579, 3.37, 3.44, 3.5], m: [null, 3.87, null, 3.67, 3.6]};
s[376] = {l: 'ПГ по пр. технологии', n: 'ПГ по промишлени технологии', b: [null, 3.05, 2.92, 2.88, 2.95], m: [null, 3.42, null, null, 3.48]};
s[377] = {l: 'ПГ по с. стопанство', n: 'ПГ по селско стопанство', b: [null, 3.266, 2.99, 3.26, 2.97], m: [null, 3.523, null, 3.65, 3.1]};
s[378] = {l: 'ПГ по строителство', n: 'ПГ по строителство и архитектура', b: [null, 3.525, 3.3, 3.44, 3.34], m: [null, 3.478, null, 3.37, 3.05]};
s[379] = {l: 'ПГ по фризьорство', n: 'ПГ по фризьорство и ресторантьорство', b: [null, 3.512, 3.15, 3.75, 2.97], m: [null, 3.444, null, null, null]};
s[380] = {l: 'ПГ по хим. и хр. техн.', n: 'ПГ по химични и хранителни технологии', b: [null, 3.671, 3.14, 3.17, 3.06], m: [null, 4.332, null, 2.84, 2.66]};
s[381] = {l: 'СУ Г. Бенковски', n: 'СУ Георги Бенковски', b: [null, 4.123, 4.18, 3.94, 3.7], m: [null, 4.13, null, 3.97, 3.73]};
s[382] = {l: 'СУ Георги Брегов', n: 'СУ Георги Брегов', b: [null, 4.175, 3.77, 3.24, 3.43], m: [null, 3.918, null, 3.5, 3.73]};
s[383] = {l: 'СУ Д-р Петър Берон', n: 'СУ Д-р Петър Берон', b: [null, 3.456, 3.03, 3.31, 3.66], m: [null, 3.627, null, 3.44, 4.16]};
s[384] = {l: 'СУ Димитър Гачев', n: 'СУ Димитър Гачев', b: [null, 2.845, 3.13, null, null], m: [null, 3.197, null, null, null]};

// Благоевград
s[391] = {l: '5 СУ', n: '5 СУ Георги Измирлиев', b: [null, 3.563, 3.65, 3.48, 3.6], m: [null, 3.914, null, 3.83, 3.87]};
s[392] = {l: '7 СУ', n: '7 СУ Кузман Шапкарев', b: [null, null, 3.71, 3.88, null], m: [null, null, null, 3.95, 2.44]};
s[393] = {l: 'ЕГ Акад. Л. Стоянов', n: 'ЕГ Акад. Людмил Стоянов', b: [null, 5.259, 5.23, 5.4, 5.24], m: [null, 5.433, null, 5.42, 5.4]};
s[394] = {l: 'ПМГ Акад. С. Корольов', n: 'ПМГ Акад. Сергей Корольов', b: [null, 5.225, 5.07, 5.02, 5.06], m: [null, 5.559, null, 5.19, 5.22]};
s[395] = {l: 'ПГ Ичко Бойчев', n: 'ПГ Ичко Бойчев', b: [null, 3.353, 3.23, 3.15, 3.31], m: [null, 3.61, null, 3.15, 3.32]};
s[396] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 4.62, 4.36, 4.46, 4.46], m: [null, 4.59, null, 4.16, 4.56]};
s[397] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и геодезия', b: [null, 4.137, 3.76, 3.74, 3.84], m: [null, 3.943, null, 3.87, 4.01]};
s[398] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм и лека промишленост', b: [null, 3.464, 3.37, 3.27, 3.39], m: [null, 3.21, null, 3.11, null]};
s[399] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [null, null, null, 2.81, 2.04], m: [null, null, null, 3.14, 3.06]};
s[400] = {l: 'СУИЧЕ', n: 'СУИЧЕ Св. Кл. Охридски', b: [null, 4.208, 4.12, 4.02, 3.71], m: [null, 4.439, null, 4.08, 4.07]};
s[401] = {l: 'Хуманитарна гимн.', n: 'Национална хуманитарна гимназия', b: [null, 4.521, 4.29, 4.43, 4.59], m: [null, 4.43, null, 4.48, 4.66]};

s[402] = {l: 'Димитър и Йоан', n: 'ЧСУ Димитър и Йоан', b: [null, 3.406, 3.43, null, null], m: [null, 3.363, null, null, null]};

// Велико Търново
s[405] = {l: 'ЕГ', n: 'ЕГ. Проф. д-р Асен Златаров', b: [null, 5.131, 5.0, 5.23, 4.99], m: [null, 5.358, null, 5.16, 5.2]};
s[406] = {l: 'ПГ по електроника', n: 'ПГ по електроника', b: [null, 3.597, 3.36, 3.32, 3.46], m: [null, 3.858, null, 3.41, 3.8]};
s[407] = {l: 'ПГ по икономика', n: 'Старопрестолна ПГ по икономика', b: [null, 4.51, 4.21, 4.39, 3.99], m: [null, 4.437, null, 4.36, 4.66]};
s[408] = {l: 'ПГ по моден дизайн', n: 'ПГ по моден дизайн', b: [null, 3.491, 3.16, 3.49, 3.59], m: [null, null, null, 3.52, null]};
s[409] = {l: 'ПГ по строителство', n: 'ПГ по строителство архитектура и геодезия', b: [null, 4.059, 3.87, 4.15, 4.06], m: [null, 3.979, null, 4.06, 4.56]};
s[410] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 3.982, 3.74, 4.11, 3.88], m: [null, 3.939, null, 3.83, 3.89]};
s[411] = {l: 'ПМГ Васил Друмев', n: 'ПМГ Васил Друмев', b: [null, 5.208, 5.11, 5.22, 5.03], m: [null, 5.431, null, 5.3, 5.27]};
s[412] = {l: 'Спортно у-ще', n: 'Спортно училище Георги Живков', b: [null, 3.888, 3.54, 3.82, 3.79], m: [null, 3.777, null, null, 4.35]};
s[413] = {l: 'СУ Вела Благоева', n: 'СУ Вела Благоева', b: [null, 3.653, 3.7, 4.29, 3.97], m: [null, 3.505, null, 4.12, 4.6]};
s[414] = {l: 'СУ Вл. Комаров', n: 'СУ Владимир Комаров', b: [null, 3.563, 3.52, 3.62, 3.14], m: [null, 3.569, null, 3.51, 3.24]};
s[415] = {l: 'СУ Г. С. Раковски', n: 'СУ Георги Стойков Раковски', b: [null, 3.224, 3.11, null, null], m: [null, 3.466, null, 4.07, null]};
s[416] = {l: 'СУ Емилиян Станев', n: 'СУ Емилиян Станев', b: [null, 4.563, 4.25, 4.55, 4.24], m: [null, 4.918, null, 4.7, 4.74]};
s[417] = {l: 'Хуманитарна гимн.', n: 'Профилирана Хуманитарна гимназия', b: [null, null, 4.13, 4.15, 3.52], m: [null, null, null, 4.08, null]};

s[418] = {l: 'АК - Аркус', n: 'ЧПГ АК - Аркус', b: [null, 4.985, 5.16, 5.49, 5.25], m: [null, 5.541, null, 5.53, 5.34]};

// Враца
s[421] = {l: 'ЕГ', n: 'Профилирана ЕГ Йоан Екзарх', b: [null, 4.952, 4.32, 4.65, 4.69], m: [null, 5.161, null, 5.02, 5.19]};
s[422] = {l: 'ПГ Д. Хаджитошин', n: 'ПГ Димитраки Хаджитошин', b: [null, 3.26, 3.05, 3.22, 3.36], m: [null, 2.786, null, 3.39, 3.66]};
s[423] = {l: 'ПГ по търговия', n: 'ПГ по търговия и ресторантьорство', b: [null, 3.611, 3.64, 3.43, 3.48], m: [null, 3.637, null, 3.64, 3.55]};
s[424] = {l: 'ППМГ', n: 'ППМГ Акад. Иван Ценов', b: [null, 5.141, 4.82, 4.93, 5.01], m: [null, 5.303, null, 5.09, 5.13]};
s[425] = {l: 'Спортно у-ще', n: 'Спортно училище Св. Климент Охридски', b: [null, 3.691, 3.19, 3.56, 3.42], m: [null, 3.805, null, 3.74, 3.84]};
s[426] = {l: 'СУ Васил Кънчов', n: 'СУ Васил Кънчов', b: [null, 4.048, 3.98, 4.55, 4.04], m: [null, 3.949, null, 4.32, 4.46]};
s[427] = {l: 'СУ Козма Тричков', n: 'СУ Козма Тричков', b: [null, 4.253, 3.91, 4.14, 4.02], m: [null, 4.241, null, 4.55, 4.48]};
s[428] = {l: 'СУ Мито Орозов', n: 'СУ Мито Орозов', b: [null, null, 4.4, 3.02, 3.09], m: [null, null, null, 3.38, 3.59]};
s[429] = {l: 'СУ Никола Войводов', n: 'СУ Никола Войводов', b: [null, 4.292, 3.93, 3.93, 4.23], m: [null, 4.123, null, 4.05, 4.48]};
s[430] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [null, 4.077, 3.91, 3.84, 4.18], m: [null, 4.169, null, 3.85, 4.2]};
s[431] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [null, 4.768, 4.53, 4.77, 4.68], m: [null, 5.06, null, 5.08, 5.2]};
s[432] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [null, 3.561, 3.41, 3.64, 3.49], m: [null, 3.753, null, 4.24, 4.01]};

// Габрово
s[435] = {l: 'Априловска гимн.', n: 'Национална априловска гимназия', b: [null, 5.12, 5.04, 5.29, 5.05], m: [null, 5.437, null, 5.35, 5.25]};
s[436] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 3.99, 3.76, 3.97, 3.79], m: [null, 3.894, null, 4.0, 4.23]};
s[437] = {l: 'ПМГ', n: 'ПМГ Акад. Иван Гюзелев', b: [null, 4.782, 4.81, 5.16, 4.97], m: [null, 5.2, null, 5.27, 5.14]};
s[438] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [null, 3.731, 3.49, 4.05, 3.43], m: [null, 3.815, null, 4.19, 3.69]};
s[439] = {l: 'СУ Райчо Каролев', n: 'СУ Райчо Каролев', b: [null, 3.871, 3.18, 3.73, 3.46], m: [null, 3.894, null, 3.62, 3.69]};
s[440] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [null, 4.002, 3.71, 3.79, 3.83], m: [null, 4.304, null, 4.07, 4.24]};

// Видин
s[441] = {l: 'ГПЧЕ', n: 'ГПЧЕ Йордан Радичков', b: [null, 5.115, 4.85, 5.07, 4.75], m: [null, 5.396, null, 5.13, 5.28]};
s[442] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 3.512, 3.44, 3.49, 3.58], m: [null, 3.585, null, 4.27, 3.79]};
s[443] = {l: 'ПГ Проф. д-р Асен Златаров', n: 'ПГ Проф. д-р Асен Златаров', b: [null, 4.118, 4.14, 4.3, 4.22], m: [null, 4.154, null, 4.18, 3.99]};
s[444] = {l: 'ППМГ', n: 'ППМГ Екзарх Антим I', b: [null, 4.625, 4.53, 4.79, 4.56], m: [null, 4.764, null, 4.78, 4.6]};
s[445] = {l: 'СУ Петко Рачов Славейков', n: 'СУ Петко Рачов Славейков', b: [null, 4.388, 3.56, 3.73, 3.7], m: [null, 4.475, null, 3.91, 3.72]};
s[446] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [null, 3.748, 4.21, 4.12, 4.41], m: [null, 3.818, null, 4.36, 4.38]};
s[447] = {l: 'СУ Цар Симеон Велики', n: 'СУ Цар Симеон Велики', b: [null, 4.772, 4.57, 4.24, 4.47], m: [null, 4.905, null, 4.48, 4.67]};
s[448] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [null, 3.241, 3.57, 2.97, 3.2], m: [null, 3.54, null, 2.53, null]};

// Монтана
s[451] = {l: '2 СУ', n: '2 СУ Никола Йонков Вапцаров', b: [null, 3.837, 3.83, 3.63, 3.66], m: [null, 3.844, null, 3.45, 3.56]};
s[452] = {l: '5 СУ', n: '5 СУ Христо Ботев', b: [null, null, 3.36, 3.27, null], m: [null, 3.39, null, 2.79, null]};
s[453] = {l: '6 СУ', n: '6 СУ Отец Паисий', b: [null, 3.801, 3.52, 3.13, 3.23], m: [null, 3.664, null, 3.27, 3.46]};
s[454] = {l: '7 СУ', n: '7 СУ Йордан Радичков', b: [null, 3.565, 3.26, 3.75, 3.22], m: [null, 3.886, null, 3.74, 3.47]};
s[455] = {l: 'ГПЧЕ', n: 'ГПЧЕ Петър Богдан', b: [null, 4.99, 4.91, 5.1, 4.59], m: [null, 5.422, null, 5.15, 4.8]};
s[456] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост', b: [null, 3.413, 3.29, 3.29, 3.04], m: [null, 3.153, null, 3.15, 3.41]};
s[457] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и компютърни науки', b: [null, 3.781, 3.65, 3.74, 3.74], m: [null, 3.953, null, 3.74, 3.93]};
s[458] = {l: 'ПГ по техника', n: 'ПГ по техника и електротехника', b: [null, 3.548, 3.47, 3.7, 3.44], m: [null, 3.626, null, 3.35, 3.33]};
s[459] = {l: 'ППМГ', n: 'ППМГ Св. Кл. Охридски', b: [null, 4.767, 4.6, 4.72, 4.49], m: [null, 5.054, null, 4.96, 4.95]};
s[460] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска ПГ', b: [null, 4.316, 4.38, 4.5, 4.24], m: [null, 4.553, null, 4.73, 4.41]};

// Кюстендил
s[461] = {l: 'ЕГ', n: 'ЕГ Д-р Петър Берон', b: [null, 4.766, 4.54, 4.86, 4.5], m: [null, 5.106, null, 5.09, 4.95]};
s[462] = {l: 'ПГ по икономика', n: 'ПГ по икономика и мениджмънт', b: [null, 4.368, 3.95, 3.92, 3.84], m: [null, 4.106, null, 3.74, 3.92]};
s[463] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост', b: [null, 2.915, 2.94, 2.77, 2.67], m: [null, 2.582, null, 3.01, 3.06]};
s[464] = {l: 'ПГ по с. стоп.', n: 'ПГ по селско стопанство', b: [null, 2.92, 2.7, null, 2.92], m: [null, null, null, null, 2.94]};
s[465] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 3.517, 3.44, 3.36, 3.48], m: [null, 3.593, null, 3.41, 3.61]};
s[466] = {l: 'ПМГ', n: 'ПМГ Проф. Емануил Иванов', b: [null, 5.039, 4.68, 5.01, 4.76], m: [null, 5.403, null, 5.08, 5.08]};
s[467] = {l: 'Спортно у-ще', n: 'Спортно училище Васил Левски', b: [null, 3.052, 2.93, 2.88, 2.98], m: [null, 3.257, null, 3.16, 3.2]};
s[468] = {l: 'Техн. гимназия', n: 'Професионална техническа гимназия', b: [null, 3.223, 2.89, 2.72, 2.96], m: [null, 3.213, null, 2.6, 3.11]};

// Кърджали
s[471] = {l: 'ЕГ Христо Ботев', n: 'ЕГ Христо Ботев', b: [null, 5.057, 4.91, 5.09, 5.03], m: [null, 5.275, null, 5.08, 4.92]};
s[472] = {l: 'ПГ Васил Левски', n: 'ПГ Васил Левски', b: [null, 3.103, 2.69, 2.84, 3.0], m: [null, null, null, null, null]};
s[473] = {l: 'ПГ по електротехника', n: 'ПГ по електротехника и електроника', b: [null, 3.477, 3.2, 3.24, 3.38], m: [null, 3.401, null, 3.53, 3.59]};
s[474] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 3.531, 3.44, 3.56, 3.99], m: [null, 3.533, null, 3.14, 4.19]};
s[475] = {l: 'ПГ по облекло', n: 'ПГ по облекло и дизайн', b: [null, 2.885, 2.98, 2.57, 2.69], m: [null, 2.685, null, null, null]};
s[476] = {l: 'ПГ по с. и г. стоп.', n: 'ПГ по селско и горско стопанство', b: [null, 3.072, 2.78, 2.76, 2.85], m: [null, 3.081, null, 2.83, 2.79]};
s[477] = {l: 'ПГ по строителство', n: 'ПГ по строителство', b: [null, 2.981, 3.13, 3.25, 3.12], m: [null, 3.168, null, 3.33, 2.9]};
s[478] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [null, 3.322, 3.13, 3.02, 3.09], m: [null, 3.504, null, 2.38, 4.41]};
s[479] = {l: 'СУ В. Д. - М.', n: 'СУ Владимир Димитров - Майстора', b: [null, null, 3.63, 3.8, 3.08], m: [null, null, null, 4.01, null]};
s[480] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [null, 3.389, 3.19, 3.19, 3.33], m: [null, 3.705, null, 3.65, 3.76]};
s[481] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [null, 4.142, 3.86, 3.96, 4.09], m: [null, 4.401, null, 4.13, 4.48]};
s[482] = {l: 'СУ Петко Славейков', n: 'СУ Петко Рачов Славейков', b: [null, 4.528, 4.34, 4.7, 4.94], m: [null, 4.845, null, 4.74, 5.05]};

// Търговище
s[485] = {l: '1 СУ', n: 'Първо СУ Св. Седмочисленици', b: [null, 4.921, 4.76, 4.8, 4.87], m: [null, 5.423, null, 5.24, 5.2]};
s[486] = {l: '2 СУ', n: '2 СУ Проф. Никола Маринов', b: [null, 4.604, 4.46, 4.44, 4.46], m: [null, 4.871, null, 4.51, 4.76]};
s[487] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и строителство', b: [null, 3.2, 3.35, 3.07, 3.1], m: [null, 4.342, null, 3.54, null]};
s[488] = {l: 'ПГ по земеделие', n: 'ПГ по земеделие', b: [null, 3.316, 3.03, 2.81, 3.25], m: [null, 2.984, null, 2.99, 3.35]};
s[489] = {l: 'ПГ по икон. инф.', n: 'ПГ по икономическа информатика', b: [null, 4.148, 3.9, 3.89, 3.75], m: [null, 3.838, null, 4.04, 4.25]};
s[490] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм и хранително-вкусови технологии Алеко Константинов', b: [null, 3.697, 3.48, 3.54, 3.36], m: [null, 3.682, null, 3.66, 3.55]};
s[491] = {l: 'ПГИЧЕ', n: 'ПГИЧЕ', b: [null, 4.418, null, null, null], m: [null, 4.933, null, null, null]};
s[492] = {l: 'Спортно у-ще', n: 'Спортно училище', b: [null, 3.663, 3.67, 3.14, 3.08], m: [null, 3.937, null, 3.29, 3.48]};
s[493] = {l: 'Техн. гимназия', n: 'Професионална техническа гимназия', b: [null, 3.627, 3.52, 3.62, 3.58], m: [null, 3.904, null, 4.21, 3.91]};
s[494] = {l: 'У-ще за уч. с увр. слух', n: 'Специално училище за ученици с увреден слух', b: [null, 3.016, null, 3.16, 3.01], m: [null, null, null, null, null]};

// Ловеч
s[495] = {l: 'ЕГ Екзарх Йосиф I', n: 'Профилирана ЕГ Екзарх Йосиф I', b: [null, 5.368, 5.23, 5.39, 5.29], m: [null, 5.621, null, 5.19, 5.19]};
s[496] = {l: 'ПГ по вет. медицина', n: 'Национална ПГ по ветеринарна медицина', b: [null, 3.824, 3.43, 3.73, 3.67], m: [null, 4.119, null, 3.96, 3.98]};
s[497] = {l: 'ПГ по икономика', n: 'ПГ по икономика търговия и услуги', b: [null, 4.063, 3.68, 3.8, 3.73], m: [null, 3.985, null, 3.54, 3.29]};
s[498] = {l: 'ПГ по механ.', n: 'ПГ по механоелектротехника', b: [null, 3.709, 3.42, 3.49, 3.51], m: [null, 4.11, null, 3.54, 3.76]};
s[499] = {l: 'ППМГ', n: 'ППМГ', b: [null, 4.621, 4.33, 4.49, 4.34], m: [null, 4.851, null, 4.34, 4.5]};
s[500] = {l: 'СУ Димитър Митев', n: 'СУ Димитър Митев', b: [null, null, null, 2.96, 3.0], m: [null, null, null, null, 2.95]};
s[501] = {l: 'СУ Св. Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [null, 4.575, 3.89, 3.96, 3.86], m: [null, 4.46, null, 3.93, 4.2]};
s[502] = {l: 'СУ Тодор Кирков', n: 'СУ Тодор Кирков', b: [null, 3.737, 3.43, 3.29, 3.51], m: [null, 3.705, null, 3.15, 3.99]};

// Силистра
s[505] = {l: 'ЕГ Пейо Яворов', n: 'ЕГ Пейо Яворов', b: [null, 5.114, 5.03, 5.06, 4.98], m: [null, 5.453, null, 5.33, 5.16]};
s[506] = {l: 'Земеделска гимназия', n: 'Професионална земеделска гимназия', b: [null, 3.058, 2.92, 3.02, 3.14], m: [null, 3.227, null, 3.37, 3.71]};
s[507] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост', b: [null, 3.074, 3.03, 3.19, null], m: [null, 3.17, null, 3.36, null]};
s[508] = {l: 'ПГ по механ.', n: 'ПГ по механотехника', b: [null, 3.405, 3.27, 3.43, 3.32], m: [null, 4.08, null, 3.96, null]};
s[509] = {l: 'ПГ по произв. техн.', n: 'ПГ по производствени технологии', b: [null, 3.701, 3.26, 3.43, 3.45], m: [null, 3.993, null, 3.93, 3.51]};
s[510] = {l: 'ПГ по стоп. упр.', n: 'ПГ по стопанско управление, администрация и услуги', b: [null, 4.479, 4.22, 4.3, 4.51], m: [null, 4.33, null, 3.94, 4.54]};
s[511] = {l: 'ПГ по строителство', n: 'ПГ по строителство', b: [null, 3.225, 3.42, 2.94, 3.44], m: [null, 3.343, null, 3.15, 2.48]};
s[512] = {l: 'ПМГ', n: 'ПМГ Св. Кл. Охридски', b: [null, 4.776, 4.61, 4.92, 4.94], m: [null, 5.191, null, 5.08, 5.07]};
s[513] = {l: 'Спортно у-ще', n: 'Спортно училище Дръстър', b: [null, 3.584, 3.43, 3.53, 3.38], m: [null, 3.716, null, 4.51, null]};
s[514] = {l: 'СУ Никола Вапцаров', n: 'СУ Никола Йонков Вапцаров', b: [null, 4.35, 3.92, 4.05, 4.48], m: [null, 4.725, null, 4.27, 4.88]};

// Разград
s[515] = {l: 'ГПЧЕ Екзарх Йосиф', n: 'ГПЧЕ Екзарх Йосиф', b: [null, 4.958, 4.97, 5.15, 4.75], m: [null, 5.21, null, 5.28, 5.06]};
s[516] = {l: 'ПГ по икономика', n: 'ПГ по икономика Робер Шуман', b: [null, 3.873, 3.71, 3.89, 3.71], m: [null, 3.871, null, 3.92, 3.93]};
s[517] = {l: 'ПГ по облекло', n: 'ПГ по облекло Станка Николица Спасо-Еленина', b: [null, 3.377, 3.12, 3.26, 3.27], m: [null, 3.572, null, null, null]};
s[518] = {l: 'ПГ по с. стоп.', n: 'ПГ по селско стопанство и хранително-вкусови технологии Ангел Кънчев', b: [null, 3.074, 3.01, 3.0, 2.93], m: [null, 3.47, null, 3.17, 2.96]};
s[519] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт и строителство Христо Смирненски', b: [null, 3.46, 3.35, 3.23, 3.28], m: [null, 5.84, null, null, null]};
s[520] = {l: 'ПГ по хим. техн.', n: 'ПГ по химични технологии и биотехнологии Мария Кюри', b: [null, 3.28, 3.19, 3.48, 3.46], m: [null, 3.36, null, 3.8, 5.43]};
s[521] = {l: 'ППМГ', n: 'ППМГ Акад. Никола Обрешков', b: [null, 5.034, 4.72, 4.96, 5.15], m: [null, 5.101, null, 5.12, 5.14]};
s[522] = {l: 'Спортно у-ще', n: 'Спортно училище - Разград', b: [null, 3.073, 3.13, 3.14, 3.3], m: [null, 2.82, null, null, null]};
s[523] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [null, 3.303, 3.44, 3.09, null], m: [null, 3.37, null, 3.38, null]};
s[524] = {l: 'Техническа гимназия', n: 'Национална професионална техническа гимназия Шандор Петьофи', b: [null, 3.71, 3.58, 3.64, 3.67], m: [null, 3.719, null, 3.86, 4.09]};

// Смолян
s[525] = {l: 'ЕГ Иван Вазов', n: 'ЕГ Иван Вазов', b: [null, 5.105, 4.96, 5.06, 5.08], m: [null, 5.365, null, 5.19, 5.1]};
s[526] = {l: 'ПГ за прил. изк.', n: 'ПГ за приложни изкуства', b: [null, 4.025, 4.07, null, 3.89], m: [null, null, null, null, null]};
s[527] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [null, 4.074, 3.94, 4.14, 4.03], m: [null, 3.982, null, 4.4, 4.14]};
s[528] = {l: 'ПГ по техника', n: 'ПГ по техника и технологии', b: [null, 3.507, 3.49, 3.64, 3.4], m: [null, 3.631, null, 3.6, 3.01]};
s[529] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм и строителство', b: [null, 4.028, 3.64, 3.96, 3.79], m: [null, 3.467, null, 3.49, 3.95]};
s[530] = {l: 'ППМГ В. Левски', n: 'ППМГ Васил Левски', b: [null, 5.016, 4.64, 5.09, 5.12], m: [null, 5.29, null, 5.16, 5.21]};
s[531] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [null, 4.555, 4.14, 4.65, 4.72], m: [null, 4.659, null, 4.72, 5.04]};
s[532] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [null, 4.215, 3.75, 4.08, null], m: [null, 4.32, null, 4.49, null]};
