
let j = [];

j.push({q: 'Който няма миксер - много бърка', a: 'Немур Ведар'});
j.push({q: 'Ако кучето лае, значи още е сурово', a: 'Виетнамска мъдрост'});
j.push({q: 'Всяка тъпотия може да се оправдае с древна китайска мъдрост', a: 'Древна китайска мъдрост'});
j.push({q: 'Голата истина не винаги е приятна за гледане', a: 'Немур Ведар'});
j.push({q: 'В този живот най-тежко им е на леките жени', a: 'Немур Ведар'});
j.push({q: 'Ако спориш с идиот, той вероятно прави същото', a: 'Немур Ведар'});

function randomJoke() {
  return j[Math.floor(Math.random() * j.length)];
}