
let j = [];

j.push({q: 'Който няма миксер - много бърка', a: 'Немур Ведар'});
j.push({q: 'Ако кучето лае, значи още е сурово', a: 'Виетнамска мъдрост'});
j.push({q: 'Всяка тъпотия може да се оправдае с древна китайска мъдрост', a: 'Древна китайска мъдрост'});
j.push({q: 'Голата истина не винаги е приятна за гледане', a: 'Немур Ведар'});
j.push({q: 'В този живот най-тежко им е на леките жени', a: 'Немур Ведар'});
j.push({q: 'Ако спориш с идиот, той вероятно прави същото', a: 'Немур Ведар'});
j.push({q: 'Аз съм на мнение, че единият от двата отбора ще спечели', a: 'Божинката'});
j.push({q: 'Ако се събудите сутрината и не трябва да ставате, значи сте спали прав', a: 'Немур Ведар'});
j.push({q: 'Ако котката не вие след къпане, значи не я изстисквате правилно', a: 'Немур Ведар'});
j.push({q: 'Ако кон ти казва, че си луд - прав е', a: 'Немур Ведар'});
j.push({q: 'БЕЛ се пише с три букви, но се учи цял живот', a: 'Немур Ведар'});
j.push({q: 'Оценките не правят човека, но помагат', a: 'МОН'});
j.push({q: 'Не е важно как изглеждаш, важното е да не те снимат', a: 'Жена ми'});
j.push({q: 'Човешко е да се греши, но някои хора са твърде човечни', a: 'Немур Ведар'});

function randomJoke() {
  return j[Math.floor(Math.random() * j.length)];
}