// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Triavna
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["700403"] = {n: "СУ Петко Славейков", f: "СУ Петко Рачов Славейков", c: false, p: {
  "1079": {n: "Природни науки", d: [
    [[167,176,167,352,352,317.5], [176,176,229.5,262,176,262], [161,161,0,227,227,0], [159,0,0,159,0,0]],
    [[96.5,96.5,123,361.5,361.5,312], [219.5,219.5,0,267.5,267.5,0], null, null],
    [[106.5,106.5,227,384.5,287,384.5], null, null, null]
  ]},
}};
