// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Godech
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["2300163"] = {n: "СУ Асен Златаров", f: "СУ Проф. д-р Асен Златаров", c: false, p: {
  "2469": {n: "Софтуерни и хардуерни науки", d: [
    [[135.5,135.5,270,400.75,400.75,399.75], [135.5,135.5,0,135.5,135.5,0], null, null],
    [[30,30,57,392.75,392.75,309], null, null, null],
    [[95,95,133,476.5,269,476.5], null, [40,40,99,317,269,317], null],
    [[90,90,110.5,279.25,269,279.25], null, [90,0,0,269,0,0], null]
  ]},
  "4421": {n: "Природни науки", d: [
    [[94,94,123,346,183,346], null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
}};
