// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Tutrakan
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1900701"] = {n: "СУ Йордан Йовков", f: "СУ Йордан Йовков", c: false, p: {
  "3995": {n: "Предприемачески", d: [
    [[58,0,0,340,0,0], [58,0,0,340,0,0], [58,0,0,340,0,0], [58,0,0,340,0,0]],
    [[107,0,0,393,0,0], [107,0,0,393,0,0], [107,0,0,393,0,0], [107,0,0,393,0,0]],
    [[30,0,0,390,0,0], [30,0,0,390,0,0], [30,0,0,390,0,0], [30,0,0,390,0,0]]
  ]},
  "0291": {n: "Икономическо развитие", d: [
    [[38,0,0,279.5,0,0], [38,0,0,279.5,0,0], [38,0,0,279.5,0,0], [38,0,0,279.5,0,0]],
    [[52,0,0,419,0,0], [52,0,0,419,0,0], [52,0,0,419,0,0], [52,0,0,419,0,0]],
    [null, null, null, null]
  ]},
  "4981": {n: "Природни науки", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[52,0,0,408.5,0,0], [52,0,0,408.5,0,0], [52,0,0,408.5,0,0], [52,0,0,408.5,0,0]]
  ]},
}};
ruoSchools["1900702"] = {n: "СУ Христо Ботев", f: "СУ Христо Ботев", c: false, p: {
  "0354": {n: "Програмист на роботи", d: [
    [[168,0,0,393,0,0], [168,0,0,393,0,0], [168,0,0,393,0,0], [168,0,0,393,0,0]],
    [[64,0,0,419.5,0,0], [64,0,0,419.5,0,0], [64,0,0,419.5,0,0], [64,0,0,419.5,0,0]],
    [[163,0,0,425,0,0], [163,0,0,425,0,0], [163,0,0,425,0,0], [163,0,0,425,0,0]]
  ]},
  "0357": {n: "Икономист", d: [
    [[30,0,0,306.5,0,0], [30,0,0,306.5,0,0], [30,0,0,306.5,0,0], [30,0,0,306.5,0,0]],
    [[146,0,0,402.5,0,0], [146,0,0,402.5,0,0], [146,0,0,402.5,0,0], [146,0,0,402.5,0,0]],
    [[30,0,0,376.5,0,0], [30,0,0,376.5,0,0], [30,0,0,376.5,0,0], [30,0,0,376.5,0,0]]
  ]},
}};
