// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Balchik
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["800061"] = {n: "СУ Христо Ботев", f: "СУ Христо Ботев", c: false, p: {
  "797": {n: "Икономическо развитие", d: [
    [[224,0,0,430,0,0], [351.5,0,0,351.5,0,0], [78,0,0,78,0,0], null],
    [[172,0,0,377.5,0,0], null, [206,0,0,245,0,0], null],
    [[161,0,0,398.5,0,0], [144,0,0,144,0,0], [121,0,0,121,0,0], null]
  ]},
  "786": {n: "Производство на кулинарни изделия и напитки", d: [
    [[92,0,0,190,0,0], null, null, null],
    [[97,0,0,264,0,0], null, null, [100,0,0,100,0,0]],
    [[73,0,0,185,0,0], null, [84,0,0,173,0,0], null]
  ]},
  "4246": {n: "Хуманитарни науки", d: [
    [[147,0,0,358.5,0,0], [319.5,0,0,319.5,0,0], [78,0,0,319.5,0,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4528": {n: "Природни науки", d: [
    [null, null, null, null],
    [[90,0,0,346,0,0], [346,0,0,346,0,0], [197,0,0,346,0,0], null],
    [[118,0,0,298.5,0,0], null, [181,0,0,308,0,0], null]
  ]},
  "5096": {n: "Производство и обслужване в ЗХР", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[78,0,0,181,0,0], null, [74,0,0,86,0,0], null]
  ]},
}};
