// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Burgas
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["200236"] = {n: "Английска ЕГ", f: "Английска ЕГ Гео Милев", c: false, p: {
  "3723": {n: "Английски език / Испански език", d: [
    [null, [362.5,362.5,366,385,362.5,385], null, null],
    [[365.8,372.75,365.8,455.75,439.5,455.8], [361.5,361.5,361.75,455.75,430.75,455.75], [342.5,358,343,358.3,358.3,342.5], null],
    [[362,362.75,362,457.75,417,457.75], [357.25,357.5,357.25,393.5,365.5,393.5], null, null],
    [[340.75,340.75,342.75,447.5,408.25,447.5], [329.75,329.75,336,420.5,405.75,420.5], [363.75,363.75,0,363.75,363.75,0], null]
  ]},
  "3722": {n: "Английски език/Китайски език", d: [
    [null, [335.5,341,335.5,363.5,355.5,363.5], [332,0,332,342,0,342], null],
    [[338,341.5,338,434,403.75,434], [334,335.25,334,403.75,403.75,345.25], null, null],
    [[331.5,331.5,332.5,416.25,379.75,416.25], [306.5,306.5,312,379.75,379.75,364], null, null],
    [[325,325,327.25,432.5,386.25,432.5], [310.5,310.5,315,340.75,340.75,322], [447,0,447,447,0,447], null]
  ]},
  "4118": {n: "Английски език /Немски език", d: [
    [null, [360.5,360.5,362,402,394,402], [357,0,357,357.5,0,357.5], [330.5,0,330.5,330.5,0,330.5]],
    [[376.8,376.75,377.8,418,413.5,418], [373,375.25,373,418,413.5,418], [374.75,0,375,374.8,0,374.8], null],
    [[360.5,360.5,360.75,466.25,415.5,466.25], [352,352,352,431.75,410,431.75], null, null],
    [[339,352.25,339,481.25,399.75,481.25], [324.75,324.75,330,373.75,358,373.75], null, null]
  ]},
  "3724": {n: "Английски език /Руски език", d: [
    [null, [344.5,344.5,347,381,370.5,381], [326,0,326,326,0,326], null],
    [[358.5,359.75,358.5,463.25,399.25,463.3], [349.5,349.5,351,463.25,399.25,463.25], [440.75,441,0,440.8,440.8,0], null],
    [[345,348.75,345,399.75,399.75,380], [335.75,335.75,338.25,372.5,372.5,352.75], null, null],
    [[331.5,332.5,331.5,408,373.5,408], [319.25,319.25,321.75,373.5,373.5,328.75], null, null]
  ]},
  "3729": {n: "Графичен дизайн / Английски език / Испански език", d: [
    [null, [388,389.5,388,434,434,393.5], null, null],
    [[386,388.25,386,473,428.25,473], [377.5,380.25,377.5,416.5,380.25,416.5], null, null],
    [[390,391.75,390,460.75,413,460.75], [392.25,0,392.25,432.5,0,432.5], null, null],
    [null, null, null, null]
  ]},
  "4824": {n: "Графичен дизайн / Английски език / Китайски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[356.5,359.5,356.5,457.25,387.25,457.25], [353.5,353.5,356.5,388.25,387.25,388.25], null, null],
    [null, null, null, null]
  ]},
  "28100": {n: "Графичен дизайн", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[378,378,382.5,460.5,403,460.5], [367.75,367.75,372.75,383.5,383.5,372.75], null, null]
  ]},
}};
ruoSchools["200237"] = {n: "НЕГ Гьоте", f: "Немска езикова гимназия Гьоте", c: false, p: {
  "3189": {n: "Математически профил/ Немски език / Английски език / М / ИНФ", d: [
    [null, null, null, null],
    [[441,441,443.5,490.5,478,490.5], [434.5,434.5,440.5,459.5,459.5,453.5], null, null],
    [[444,448,444,494,467,494], [440,440,460.5,460.5,441.5,460.5], null, null],
    [[431,431,434,486,472,486], [425,425,429,429,425,429], null, null]
  ]},
  "1955": {n: "Немски език / Английски език", d: [
    [null, [407,407,407,434.5,430,434.5], [362.5,0,362.5,402,0,402], null],
    [[416.5,416.5,418,490,490,488], [414.5,414.5,415,459,440.5,459], null, null],
    [[414.5,414.5,415,489,476.5,489], [406.5,410.5,406.5,439.5,439.5,438.5], null, null],
    [[394,394,395,488.5,484,488.5], [382.5,385.5,382.5,428,422.5,428], [354.5,0,354.5,354.5,0,354.5], null]
  ]},
}};
ruoSchools["200216"] = {n: "ОбУ Васил Левски", f: "ОбУ Васил Левски - Бургас", c: false, p: {
  "2479": {n: "Работник в производството на кулинарни изделия в заведенията за хранене и развлечения", d: [
    [null, null, null, null],
    [[30,30,56,138,138,81], null, null, null],
    [[30,30,52,239.5,115,239.5], [121,0,121,121,0,121], [40,40,0,92,92,0], [30,30,0,30,30,0]],
    [null, null, null, null]
  ]},
  "28461": {n: "Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[54,54,69,155,155,148], [52,0,52,52,0,52], null, null]
  ]},
}};
ruoSchools["200248"] = {n: "ПГ по ел. и ел.", f: "ПГ по електротехника и електроника", c: false, p: {
  "4094": {n: "Електротехник, Електрически инсталации", d: [
    [null, [179,179,0,232.5,232.5,0], null, null],
    [[199,199,0,331.5,331.5,0], [191,191,0,296,296,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2420": {n: "Компютърна техника и технологии", d: [
    [null, [236,236,0,342.5,342.5,0], null, null],
    [[217,217,279,386.5,386.5,279], [233.5,233.5,0,273,273,0], null, null],
    [[196,196,0,344,344,0], [137,137,0,331.5,331.5,0], [235.5,235.5,0,235.5,235.5,0], null],
    [null, null, null, null]
  ]},
  "4095": {n: "Медицинска техника", d: [
    [null, [161,161,0,246.5,246.5,0], [284,0,284,284,0,284], [267.5,0,267.5,267.5,0,267.5]],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2424": {n: "Приложно програмиране", d: [
    [null, [284,284,0,350.5,350.5,0], [286,286,0,299.5,299.5,0], null],
    [[268,268,368,374,374,368], [240.5,240.5,247,333.5,333.5,247], [123,123,0,234.5,234.5,0], null],
    [[235,235,339.5,365,365,339.5], [141,141,0,352.5,352.5,0], [143,143,276,276,143,276], null],
    [null, null, null, null]
  ]},
  "4093": {n: "Програмист на роботи", d: [
    [null, [210,210,0,245,245,0], null, null],
    [[144.5,144.5,0,328,328,0], [109,109,0,238,238,0], [195.5,196,0,195.5,195.5,0], null],
    [[119,119,207,334,334,207], [119,119,0,334,334,0], [147.5,147.5,0,147.5,147.5,0], null],
    [null, null, null, null]
  ]},
  "2433": {n: "Програмно осигуряване", d: [
    [null, [229,229,306,306,283.5,306], null, null],
    [[156.5,156.5,193,281.5,281.5,193], [113.5,113.5,0,239,239,0], [160,160,0,160,160,0], null],
    [[94,94,176,230.5,230.5,176], [188,188,0,188,188,0], null, null],
    [null, null, null, null]
  ]},
  "4772": {n: "Електротехник, Електрообзавеждане на подемна и асансьорна техника", d: [
    [null, null, null, null],
    [[143,143,0,348.5,348.5,0], [92,92,0,308.5,308.5,0], [248,248,0,248,248,0], null],
    [[171,171,0,294.5,294.5,0], [160,160,0,294.5,294.5,0], null, null],
    [null, null, null, null]
  ]},
  "4914": {n: "Възобновяеми енергийни източници", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[83,83,268,292,292,268], [268,0,268,268,0,268], [142,142,0,162,162,0], null],
    [null, null, null, null]
  ]},
  "29163": {n: "Асансьорна техника и съоръжения", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[142.5,142.5,0,343,343,0], [130.5,130.5,0,219,219,0], null, null]
  ]},
  "28978": {n: "Информационна инфраструктура", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[104,104,299,433,433,299], [413,413,0,413,413,0], null, null]
  ]},
  "28981": {n: "Компютърни системи и технологии", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[166.5,166.5,244,357.5,357.5,244], [279,279,0,312.75,312.75,0], [217.5,217.5,0,220.5,220.5,0], null]
  ]},
  "28973": {n: "Разработка на софтуер", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[162.5,162.5,244,340.25,340.25,244], [340.25,340.25,0,340.25,340.25,0], [256.5,256.5,0,256.5,256.5,0], null]
  ]},
  "29036": {n: "Роботика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[116,116,0,367.25,367.25,0], [269,269,0,332.75,332.75,0], [242.5,242.5,0,242.5,242.5,0], null]
  ]},
}};
ruoSchools["200120"] = {n: "ПГ по компют. програм.", f: "ПГ по комп. програмиране и иновации", c: false, p: {
  "2959": {n: "Приложно програмиране", d: [
    [null, [280.75,280.75,298.5,427.5,427.5,298.5], [278,287.5,278,287.5,287.5,278], null],
    [[346.3,346.25,450.5,459.5,459.5,450.5], [307,307,332,440,440,332], null, [247,247,0,247,247,0]],
    [[303.25,306.25,303.25,441,441,429.75], [119.75,119.75,166,400.25,400.25,166], null, [217,217,0,217,217,0]],
    [null, null, null, null]
  ]},
  "3693": {n: "Програмиране на изкуствен интелект", d: [
    [null, [237.25,237.25,292,301,280,301], null, null],
    [[311.5,317.5,311.5,473,417.75,473], [280,280,290.75,403.75,297.75,403.75], [290.5,299,291,298.8,298.8,290.5], null],
    [[303.25,303.25,336.25,460.75,460.75,336.5], [404.75,404.75,0,420.25,420.25,0], null, null],
    [null, null, null, null]
  ]},
  "3970": {n: "Програмиране на роботи с АЕ и НЕ", d: [
    [null, [222.75,222.75,240.75,311,311,240.75], [282.75,282.75,0,282.75,282.75,0], null],
    [[281.5,281.5,290.8,450.75,450.75,347.3], [250.25,250.25,318.5,450.75,450.75,343.25], null, null],
    [[243.75,243.75,245.75,451.75,415,451.75], [111,111,293.75,294,293.25,294], [288.25,288.25,0,289.5,289.5,0], null],
    [null, null, null, null]
  ]},
  "4783": {n: "Приложно програмиране - обучение чрез работа", d: [
    [null, null, null, null],
    [[344.8,344.75,368.8,475.5,475.5,472], [336,336,0,423.5,423.5,0], null, null],
    [[160.5,160.5,221.5,433.5,433.5,422.5], [130,130,0,412,412,0], [284,0,284,284,0,284], null],
    [null, null, null, null]
  ]},
  "28427": {n: "Интелигентни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[318.5,318.5,320,435.25,435.25,418.25], [214.25,215.25,214.25,418.25,311.75,418.25], [267.5,279,267.5,311.75,311.75,267.5], [244.5,0,0,244.5,0,0]]
  ]},
  "28430": {n: "Интелигентни системи - дуална", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[280.5,280.5,284,461,443.5,461], [228.5,228.5,411.25,411.25,392.5,411.25], [299,299,0,299,299,0], null]
  ]},
  "28429": {n: "Роботика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[181.5,181.5,225.5,462,462,382.5], [151.75,151.75,0,406.5,406.5,0], [203,203,0,236.5,236.5,0], null]
  ]},
}};
ruoSchools["200244"] = {n: "ПГ по мех. и електр.", f: "ПГ по механоелектротехника и електроника", c: false, p: {
  "1858": {n: "Автомобилна мехатроника", d: [
    [null, [243,243,0,266.5,266.5,0], null, null],
    [[267,267,0,442.5,442.5,0], [266,266,0,360.5,360.5,0], null, null],
    [[276.5,276.5,0,431.5,431.5,0], [271.5,271.5,0,325.5,325.5,0], null, null],
    [null, null, null, null]
  ]},
  "1853": {n: "Автотранспортна техника", d: [
    [null, [230.5,230.5,0,296,296,0], null, null],
    [[216.5,216.5,0,384,384,0], [210,210,0,255,255,0], null, null],
    [[208,208,228,353.5,353.5,228], [193,193,0,307,307,0], null, null],
    [null, null, null, null]
  ]},
  "1835": {n: "Електрообзавеждане на производството", d: [
    [null, [201,201,0,287.5,287.5,0], null, null],
    [[200,200,0,312,312,0], [190,190,0,250,250,0], null, null],
    [[189,189,0,302.5,302.5,0], [187,187,0,289,289,0], null, [175,175,0,175,175,0]],
    [null, null, null, null]
  ]},
  "1848": {n: "Компютърни мрежи", d: [
    [null, [294,294,303,400,400,303], null, null],
    [[289.5,289.5,0,413.5,413.5,0], [292.5,292.5,0,392,392,0], null, null],
    [[280,280.5,280,430,430,280], [259,259,0,331,331,0], null, null],
    [null, null, null, null]
  ]},
  "1841": {n: "Мехатроника", d: [
    [null, [257,257,0,288.5,288.5,0], [291.5,291.5,0,291.5,291.5,0], [264,264,0,264,264,0]],
    [[258.5,258.5,0,358.5,358.5,0], [264.5,264.5,0,312,312,0], null, null],
    [[242,242,0,399,399,0], [208,208,0,325,325,0], [279,279,0,279,279,0], null],
    [null, null, null, null]
  ]},
  "1845": {n: "Микропроцесорна техника", d: [
    [null, [247,247,0,282.5,282.5,0], [286,286,0,286,286,0], null],
    [[238,238,239,368,368,239], [201,201,239,277.5,277.5,239], [276.5,277,0,276.5,276.5,0], null],
    [[118,118,248,363.5,363.5,248], [178,178,0,242.5,242.5,0], [188,188,0,261,261,0], null],
    [null, null, null, null]
  ]},
  "4400": {n: "Ремонт на летателни апарати", d: [
    [null, [167,167,0,227.5,227.5,0], [284.5,284.5,0,284.5,284.5,0], null],
    [[208,208,0,341,341,0], [194,194,0,328.5,328.5,0], [321.5,322,0,321.5,321.5,0], null],
    [[217.5,217.5,0,327.5,327.5,0], [138,138,0,320,320,0], null, null],
    [null, null, null, null]
  ]},
  "29538": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[250,250,0,402.5,402.5,0], [241.5,241.5,247,310,310,247], [219,219,0,219,219,0], null]
  ]},
  "29541": {n: "Експлоатация и техническо обслужване на въздухоплавателни средства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[273,273,0,413,413,0], [253,253,0,388,388,0], [261,261,0,261,261,0], null]
  ]},
  "29534": {n: "Електроснабдяване и електрообзавеждане", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[217.5,217.5,247,369,369,247], [206.5,206.5,0,292,292,0], null, null]
  ]},
  "29532": {n: "Индустриална мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[247.5,247.5,0,439.5,439.5,0], [223.5,223.5,0,326,326,0], null, null]
  ]},
  "29548": {n: "Комуникационни и компютърни мрежи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[266,266,0,388.5,388.5,0], [238,238,0,370,370,0], null, null]
  ]},
  "29544": {n: "Микропроцесорни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[216.5,216.5,0,338,338,0], [156,156,0,338,338,0], [263,263,0,263,263,0], null]
  ]},
}};
ruoSchools["200243"] = {n: "ПГ по м. кораб. и риб.", f: "ПГ по морско корабоплаване и риболов", c: false, p: {
  "2417": {n: "Корабни машини и механизми", d: [
    [null, [101.5,101.5,0,101.5,101.5,0], [270,270,0,270,270,0], null],
    [[106,106,0,336.5,336.5,0], null, null, null],
    [[82,82,0,175,175,0], null, null, null],
    [[76,76,0,158,158,0], null, null, null]
  ]},
  "2395": {n: "Корабоводене-морско", d: [
    [null, [85,85,0,322,322,0], [103,103,0,220,220,0], [174.5,250,174.5,250,250,174.5]],
    [[79,79,0,397.5,397.5,0], [160.5,160.5,0,243,243,0], [101,101,0,101,101,0], null],
    [[120,120,184.5,316,316,201], [277,277,0,277,277,0], null, [256.5,256.5,0,256.5,256.5,0]],
    [null, null, null, null]
  ]},
  "2438": {n: "Електрообзавеждане на кораби", d: [
    [null, [71,82,71,229.5,229.5,154], [101.5,101.5,129,143,143,129], [208.5,208.5,0,208.5,208.5,0]],
    [[115,115,140,277,277,265], [265,0,265,265,0,265], [175,176,175,175.5,175.5,175], [258,258,0,258,258,0]],
    [[124,124,136,247,247,186], null, null, null],
    [null, null, null, null]
  ]},
  "28424": {n: "Корабоводене - морско", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[70,70,274.5,280,228,280], [80.5,80.5,0,80.5,80.5,0], [148,148,0,170.5,170.5,0], null]
  ]},
  "28431": {n: "Митническо обслужване", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[105,105,109,276,276,273], [276,276,0,276,276,0], null, null]
  ]},
}};
ruoSchools["200252"] = {n: "ПГ по сград. и инст.", f: "ПГ по сградостроителство и инсталации", c: false, p: {
  "4397": {n: "Вътрешни облицовки и настилки", d: [
    [null, null, [149.5,207,149.5,207,207,149.5], [168,0,168,168,0,168]],
    [[30,30,0,95,95,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3210": {n: "Електрически инсталации", d: [
    [null, [217,0,217,217,0,217], [138,138,0,230,230,0], [155,155,0,155,155,0]],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4633": {n: "Електрически машини и апарати", d: [
    [null, null, null, null],
    [[80,80,100,185,185,161], null, [175,175,0,175,175,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4645": {n: "Електрически машини и апарати- дуална система на обучение", d: [
    [null, null, null, null],
    [[30,30,0,233,233,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4937": {n: "Газова техника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,30,135,135,98], null, null, null],
    [null, null, null, null]
  ]},
  "4935": {n: "Електрообзавеждане на транспортна техника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[30,61,30,214,214,120], null, [30,0,30,30,0,30], null],
    [null, null, null, null]
  ]},
  "29411": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,71,30,183,155,183], null, [172,172,0,172,172,0], null]
  ]},
  "29416": {n: "Строителство и архитектура", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[46,46,46,326.5,275,326.5], [207,275,207,326.5,275,326.5], null, null]
  ]},
}};
ruoSchools["200245"] = {n: "ПГ по стр., арх. и геод.", f: "ПГ по строителство, архитектура и геодезия", c: false, p: {
  "345": {n: "Водно строителство", d: [
    [null, [295,295,301,333,333,328], null, [281,0,281,281,0,281]],
    [[334,334,358,382.5,381.5,382.5], [336,336,358,381.5,381.5,374], [302,0,302,302,0,302], null],
    [[341,341,341,376,376,351], [336,336,341,376,376,351], null, null],
    [[332.5,332.5,334,405,405,359.5], [322,322,342,352.5,352.5,348], null, null]
  ]},
  "348": {n: "Геодезия", d: [
    [null, [326.5,326.5,326.5,400.5,400.5,332.5], [325.5,325.5,0,325.5,325.5,0], null],
    [[359,359,360,415.5,391.5,415.5], [358,358,367.5,378,378,378], null, null],
    [[360.5,360.5,362,460.5,410.5,460.5], [359,359,362,389,389,383.5], null, null],
    [[355.5,355.5,362.5,414,400,414], [352,352,363.5,369,369,363.5], null, null]
  ]},
  "351": {n: "Недвижими имоти", d: [
    [null, [303,303,303.5,322,307.5,322], [323,0,323,323,0,323], [303.5,0,303.5,303.5,0,303.5]],
    [[319.5,319.5,322,419,356,419], [312.5,314,312.5,377.5,356,377.5], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "350": {n: "Парково строителство и озеленяване", d: [
    [null, [299,299,299.5,334.5,301.5,334.5], [306,318.5,306,322,318.5,322], null],
    [[319,320.5,319,370,358,370], [319,319,326,370,357.5,370], null, null],
    [[335,335,335,434,350.5,434], [332.5,332.5,332.5,358.5,347,358.5], null, null],
    [null, null, null, null]
  ]},
  "340": {n: "Строителство и архитектура с АЕ", d: [
    [null, [362,382,362,427.5,382,427.5], null, null],
    [[384.5,386.5,384.5,457,439.5,457], [384,389,384,431,431,406], null, null],
    [[389,389,392.5,461,457.5,461], [401,402,401,423,405,423], null, null],
    [[387.5,388,387.5,450,450,447], [401.5,401.5,0,409.5,409.5,0], null, null]
  ]},
  "343": {n: "Строителство и архитектура с НЕ", d: [
    [null, [336,339,336,361.5,361.5,353], null, null],
    [null, null, null, null],
    [[374,374,374,444.5,410,444.5], [374,374,378.5,391,391,378.5], null, null],
    [[358,358,359.5,400,391,400], [353,353,375,383.5,383,383.5], null, null]
  ]},
  "29552": {n: "Парково строителство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[323,323.5,323,369,355.5,369], [319,319,323,350.5,350.5,348.5], null, null]
  ]},
}};
ruoSchools["200249"] = {n: "ПГ по транспорт", f: "ПГ по транспорт", c: false, p: {
  "992": {n: "Автотранспортна техника", d: [
    [null, [120,120,0,183,183,0], [182,182,0,192,192,0], [231,231,0,231,231,0]],
    [[132,132,0,242,242,0], [132,132,0,218,218,0], null, null],
    [[132,132,0,304,304,0], [138,138,0,138,138,0], [73,73,0,73,73,0], [142,142,0,142,142,0]],
    [null, null, null, null]
  ]},
  "997": {n: "Електрически превозни средства", d: [
    [null, [123,123,0,247.5,247.5,0], [176,176,0,218.5,218.5,0], [223.5,223.5,0,223.5,223.5,0]],
    [[90,90,0,250,250,0], [107,107,0,219.5,219.5,0], [197,197,0,197,197,0], [219.5,219.5,0,219.5,219.5,0]],
    [[70,70,0,206,206,0], [70,70,0,95,95,0], null, null],
    [null, null, null, null]
  ]},
  "3117": {n: "Пристанищна механизация", d: [
    [null, [30,30,0,226,226,0], [89,89,0,154,154,0], [100,100,0,151,151,0]],
    [[127,127,0,225,225,0], null, null, null],
    [[94,94,0,159,159,0], [159,159,0,159,159,0], null, null],
    [[76,76,0,265,265,0], [126,126,0,126,126,0], null, null]
  ]},
  "4286": {n: "Автомобилна мехатроника", d: [
    [null, [142,142,0,226.5,226.5,0], [130,130,0,142,142,0], [82,82,0,172,172,0]],
    [[113,113,0,249.5,249.5,0], [119,119,0,249.5,249.5,0], [91,91,0,245.5,245.5,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4634": {n: "Пристанищна механизация-обучение чрез работа", d: [
    [null, null, null, null],
    [[157,157,0,241,241,0], null, null, null],
    [[112,112,0,190,190,0], [143,143,0,143,143,0], null, null],
    [null, null, null, null]
  ]},
  "28578": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[145,145,0,296,296,0], [83,83,0,145,145,0], [189.5,189.5,0,189.5,189.5,0], null]
  ]},
  "28598": {n: "Организация на автомобилния транспорт", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[84,84,0,84,84,0], null, null, null]
  ]},
  "28585": {n: "Хибридни и електрически пътни превозни средства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[66,66,0,259.5,259.5,0], null, null, null]
  ]},
}};
ruoSchools["200242"] = {n: "ПГ по туризъм", f: "ПГ по туризъм", c: false, p: {
  "377": {n: "Кетъринг", d: [
    [null, [210,215,210,309,309,269], null, null],
    [[209.5,209.5,218,322,260.5,322], [191,226,191,272,260.5,272], [287,287,0,287,287,0], null],
    [[194.5,244.5,194.5,347,281,347], [170,170,195,305.5,194,305.5], null, null],
    [null, null, null, null]
  ]},
  "373": {n: "Организация на обслужване в хотелиерството", d: [
    [null, [279.5,290,279.5,339,309.5,339], [315,0,315,315,0,315], null],
    [[273.5,282.5,273.5,347,333.5,347], [273.5,286.5,273.5,319,290,319], [284.5,0,285,294,0,294], null],
    [[233.5,233.5,240,351.5,285.5,351.5], [240,251,240,351.5,251,351.5], null, null],
    [null, null, null, null]
  ]},
  "3030": {n: "Организация на туризма и свободното време", d: [
    [null, [244,253,244,320,281.5,320], null, null],
    [[242,254,242,334.5,334.5,331], [233.5,233.5,242,334.5,334.5,306.5], [302,0,302,302,0,302], [285.5,0,285.5,285.5,0,285.5]],
    [[216,242,216,335,332,335], [206,0,206,329,0,329], null, null],
    [null, null, null, null]
  ]},
  "375": {n: "Производство и обслужване в заведенията за хранене и развлечения", d: [
    [null, [215,215,238,332,264.5,332], null, null],
    [[192,194,192,323.5,245.5,323.5], [184,188.5,184,272.5,245.5,272.5], [258,0,258,258,0,258], null],
    [[146,146,146,332,303.5,332], [143,143,192,287.5,287.5,242], [292,0,292,292,0,292], [269,0,269,269,0,269]],
    [null, null, null, null]
  ]},
  "384": {n: "Производство на кулинарни изделия и", d: [
    [null, [206.5,226,206.5,283.5,255,283.5], [314,0,314,314,0,314], [306,0,306,306,0,306]],
    [[202,202,207,312.5,312.5,289], [192,193,192,289,193,289], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "380": {n: "Производство на хляб, хлебни и сладкарски изделия - Испански език", d: [
    [null, [199,253.5,199,301,271,301], null, null],
    [[230.5,232,230.5,299.5,267,299.5], [256.5,0,256.5,290,0,290], [282,0,282,282,0,282], null],
    [[149,155,149,292.5,292.5,274], [129,129,129,237.5,131,237.5], null, null],
    [null, null, null, null]
  ]},
  "4629": {n: "Производство на кулинарни изделия и напитки-обучение чрез работа", d: [
    [null, null, null, null],
    [[202,213.5,202,385,326,385], [196,213.5,196,385,256.5,385], [228.5,0,229,228.5,0,228.5], null],
    [[214,215,214,327.5,327.5,317], [209.5,242.5,209.5,310.5,310.5,216.5], null, null],
    [null, null, null, null]
  ]},
  "4898": {n: "Производство на хляб, хлебни и сладкарски изделия - Английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[172.5,173,172.5,334.5,310.5,334.5], [163,169,163,300,300,166], null, null],
    [null, null, null, null]
  ]},
  "28737": {n: "Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[126,150,126,291.5,268,291.5], [96,96,153,291.5,96,291.5], [235.5,244.5,235.5,268,268,235.5], [96,0,0,96,0,0]]
  ]},
  "28739": {n: "Готварство - дуална", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[76,76,86,330,289,330], [289,289,0,289,289,0], [220,220,0,220,220,0], null]
  ]},
  "28745": {n: "Организиране на туристически пътувания", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[176.5,189,176.5,324.5,294.5,324.5], [97,97,176.5,294.5,294.5,256], [247,0,247,247,0,247], null]
  ]},
  "28743": {n: "Производство на хляб, хлебни и сладкарски изделия", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[186,193.5,186,336.5,218.5,336.5], [163,163,280.5,280.5,163,280.5], null, null]
  ]},
  "28733": {n: "Ресторантьорство и кетъринг - Немски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[144,145,144,316,233,316], [139,0,139,213,0,213], [167,167,226.5,226.5,195,226.5], null]
  ]},
  "28736": {n: "Ресторантьорство и кетъринг - Руски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[135,135,135,289,289,283], [58,159,58,238,189,238], [135,135,0,163.5,163.5,0], null]
  ]},
  "28720": {n: "Хотелиерство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[240.5,246,240.5,365.5,365.5,314], [237,0,237,314,0,314], null, null]
  ]},
}};
ruoSchools["200247"] = {n: "ПГ по хим. техн.", f: "ПГ по химични технологии", c: false, p: {
  "412": {n: "Екология и опазване на околната среда", d: [
    [null, [120,120,124,227,140,227], [299,0,299,303,0,303], null],
    [[106,106,152.5,255,225,255], [195,205,195,224,205,224], [168,168,205,217,217,205], null],
    [[85,108,85,326,277.5,326], null, null, null],
    [[123,123,148,227,123,227], null, [123,123,0,123,123,0], [142,0,0,142,0,0]]
  ]},
  "408": {n: "Електронна търговия", d: [
    [null, [148.5,148.5,179,260.5,260.5,202], [273.5,273.5,278.5,300.5,273.5,300.5], [273.5,273.5,0,273.5,273.5,0]],
    [[78,78,158,345,345,222], [158,158,158,209,209,158], [268.5,0,269,268.5,0,268.5], null],
    [[97,97,164,298,281,298], [162,162,0,162,162,0], [68,338,68,338,338,68], null],
    [null, null, null, null]
  ]},
  "409": {n: "Икономическа информатика", d: [
    [null, [134,147.5,134,214,192,214], [226.5,226.5,288.5,288.5,272.5,288.5], null],
    [[90,90,125,273,240.5,273], null, [150,150,291,291,150,291], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "407": {n: "Системно програмиране", d: [
    [null, [161,161,171,254,254,192], [283,283,0,283,283,0], [274,0,274,274,0,274]],
    [[105,105,126.5,352.5,351.5,352.5], [105,105,126.5,351.5,351.5,126.5], [168,0,168,168,0,168], null],
    [[129,145,129,301,301,210], [210,0,210,210,0,210], [269,0,269,269,0,269], null],
    [null, null, null, null]
  ]},
  "410": {n: "Технология на фармацевтични и парфюмерийно-козметични продукти", d: [
    [null, [205.5,224,205.5,310,271.5,310], [309.5,0,309.5,309.5,0,309.5], [309.5,0,309.5,309.5,0,309.5]],
    [[248,250,248,372,286,372], [233,0,233,280,0,280], null, [298.5,0,298.5,298.5,0,298.5]],
    [[221,0,221,358,0,358], [202,0,202,314,0,314], [162,0,162,162,0,162], [210,0,210,210,0,210]],
    [[113,193,113,352.5,352.5,324], [127,213,127,313,213,313], [216,0,216,312,0,312], null]
  ]},
  "3863": {n: "Технология на хомеопатичните и фитопродукти", d: [
    [null, [79,79,150.5,191,144,191], [191,0,191,272.5,0,272.5], [253,253,272.5,272.5,260.5,272.5]],
    [null, null, null, null],
    [[132,158,132,213,158,213], [213,0,213,213,0,213], null, null],
    [null, null, null, null]
  ]},
  "4480": {n: "Осигуряване на продуктова информация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4478": {n: "Осигуряване на продуктова информация- дуална", d: [
    [null, null, null, null],
    [[185,0,185,268.5,0,268.5], [185,0,185,268.5,0,268.5], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4968": {n: "Търговия - обучение чрез работа", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[68,153,68,228,228,68], [68,0,68,68,0,68], [311.5,311.5,0,311.5,311.5,0], [284.5,284.5,0,284.5,284.5,0]],
    [null, null, null, null]
  ]},
  "28786": {n: "Електронна търговия, маркетинг и реклама", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[77,92,77,326,198,326], [193,193,210,236.5,193,236.5], null, null]
  ]},
  "28785": {n: "Информационни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[93,93,0,296,296,0], [296,296,0,296,296,0], [127,127,0,127,127,0], [118,0,0,271,0,0]]
  ]},
  "28787": {n: "Лабораторен контрол в химични, хранителни и биотехнологични производства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[88,88,221,337,176,337], null, [169,253,169,253,253,169], null]
  ]},
}};
ruoSchools["200250"] = {n: "Проф. техн. гимназия", f: "Професионална техническа гимназия", c: false, p: {
  "3890": {n: "Горско и ловно стопанство", d: [
    [null, null, null, null],
    [[30,30,30,133,108,133], null, [102,102,0,102,102,0], null],
    [[30,30,42,112,112,43], null, null, null],
    [null, null, null, null]
  ]},
  "1019": {n: "Електродомакинска техника - обучение чрез работа", d: [
    [null, null, null, null],
    [[38,38,40,165,165,92], null, null, null],
    [[71,71,74,88,84,88], null, [70,70,0,70,70,0], [30,30,0,30,30,0]],
    [null, null, null, null]
  ]},
  "1006": {n: "Топлотехника- топлинна, климатична, вентилационна и хладилна", d: [
    [null, null, [129.5,129.5,0,161,161,0], null],
    [[30,40,30,137,87,137], null, null, null],
    [[62,64,62,184,182,184], null, null, null],
    [null, null, null, null]
  ]},
  "4492": {n: "Мебелно производство - обучение чрез работа", d: [
    [null, null, null, null],
    [[60,82,60,126,112,126], null, null, null],
    [[30,30,30,72,72,70], null, null, null],
    [null, null, null, null]
  ]},
  "29017": {n: "Електроснабдяване и електрообзавеждане", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,52,103,103,80], null, null, null]
  ]},
  "29043": {n: "Индустриален дизайн и технологи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[56,0,56,78,0,78], null, null, null]
  ]},
  "29102": {n: "Индустриален дизайн и технологии - дуална", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "29019": {n: "Мебелно производство и реставрация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[52,52,54,127,127,113], null, null, null]
  ]},
  "29011": {n: "Отопление, вентилация, климатизация и газова техника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[42,48,42,368,368,130], null, [52,52,144,144,86,144], null]
  ]},
  "29031": {n: "Стопанисване на горите", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[54,54,76,133,128,133], null, [79,0,79,88,0,88], null]
  ]},
}};
ruoSchools["200235"] = {n: "ПГ за романски езици", f: "ПГ за романски езици", c: false, p: {
  "2091": {n: "Испански език / Английски език", d: [
    [null, [424,0,424,425,0,425], null, null],
    [[432.5,432.5,432.5,479,452,479], [428.5,0,428.5,449,0,449], null, null],
    [[409.5,409.5,409.5,468.5,446.5,468.5], [407,424.5,407,458,424.5,458], null, null],
    [[427,436.5,427,474,462.5,474], [420.5,420.5,0,420.5,420.5,0], null, null]
  ]},
  "2099": {n: "ИсЕ+ФрЕ", d: [
    [null, [385,401,385,405,405,402.5], null, null],
    [[398.5,398.5,398.5,472,439,472], [391.5,398.5,391.5,428,428,423], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3032": {n: "Френски език / Италиански език", d: [
    [null, [370.5,381.5,370.5,396.5,389,396.5], null, null],
    [[381.5,388,381.5,434.5,424,434.5], [376,388.5,376,424,424,415], null, null],
    [[380.5,384,380.5,427,402,427], [375.5,378,375.5,404.5,398,404.5], null, null],
    [[342.5,347,342.5,428.5,356.5,428.5], [323.5,323.5,326,348,347,348], [312.5,0,312.5,312.5,0,312.5], null]
  ]},
  "2080": {n: "Предприемачески профил / Испански език / Френски език / Предприемачество / ИТ", d: [
    [null, [395,395,397,409,407.5,409], null, null],
    [[415,416.5,415,486,437.5,486], [412,412,412,451.5,437.5,451.5], null, null],
    [[379.5,381.5,379.5,427,420.5,427], [367,371.5,367,403,403,403], null, null],
    [null, null, null, null]
  ]},
  "2058": {n: "Предприемачески профил / Испански език /АЕ/ Предприемачество / География и икономика", d: [
    [null, [341.5,341.5,342.5,386.5,386.5,377.5], [367,0,367,367,0,367], null],
    [[341,342.5,341,463,388.5,463], [340,340.5,340,442.5,346.5,442.5], [321,0,321,321,0,321], null],
    [[338,339,338,411,386,411], [336,336,336.5,355.5,338,355.5], null, null],
    [[406,412.5,406,454,417,454], [413.5,414,413.5,414.5,414,414.5], null, null]
  ]},
  "2063": {n: "Френски език / Английски език", d: [
    [null, [368,368,377,428.5,428.5,401], [378,0,378,378,0,378], null],
    [[379,379,381.5,450.5,419,450.5], [358,373,358,410,373,410], null, null],
    [[358.5,365.5,358.5,490.5,403.5,490.5], [358,358,358.5,403.5,403.5,402.5], [382,382,0,382,382,0], null],
    [[362,373.5,362,434,411.5,434], [351,376.5,351,419.5,376.5,419.5], [349.5,349.5,0,349.5,349.5,0], null]
  ]},
  "2073": {n: "Природни науки/БЗО и ХООС/Френски език/Английски език", d: [
    [null, [343.5,344.5,343.5,372,359,372], [359,0,359,359,0,359], null],
    [[351,361.5,351,424,378.5,424], [341.5,347,341.5,391.5,347,391.5], [316,316,0,316,316,0], null],
    [[348,348,350,461.5,448,461.5], [350,350,355,461.5,448,461.5], [340,0,340,340,0,340], [318.5,318.5,0,318.5,318.5,0]],
    [[351,352,351,439,420.5,439], [338,348.5,338,439,350,439], null, null]
  ]},
  "30096": {n: "Хуманитарни науки/ БЕЛ/ ИЦ/ Испански език/ Френски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[371,375,371,454.5,404.5,454.5], [372,397,372,402.5,398.5,402.5], null, null]
  ]},
}};
ruoSchools["200238"] = {n: "ПГ за чужди езици", f: "ПГ за чужди езици Васил Левски", c: false, p: {
  "4277": {n: "Aнглийски език / Руски език", d: [
    [null, [354.5,354.5,355.25,389.75,354.5,389.75], null, null],
    [[357,357.25,357,437.75,414.25,437.8], [351,357.25,351,426.5,406.25,426.5], null, null],
    [[326.75,327.5,326.75,420.5,387,420.5], [323.5,324,323.5,391.5,378.75,391.5], [356.25,356.25,357.25,357.25,356.25,357.25], null],
    [[319.5,319.5,320.75,447,409.25,447], [311.5,311.5,312,374,340,374], [316,316,329.75,329.75,316,329.75], null]
  ]},
  "3205": {n: "Предприемачески профил / Руски език / Предприемачество / ИТ", d: [
    [null, [329.75,347.25,329.75,352.25,352.25,348.25], null, null],
    [[314.3,314.25,314.8,407,371.75,407], [309,315,309,407,371.75,407], null, null],
    [[303.5,303.5,304.25,374.5,360.5,374.5], [290.5,293.5,290.5,360.5,360.5,344.75], [339,339,0,339,339,0], null],
    [[311.5,311.5,312,368,353.25,368], [304,304,304.5,347.25,347.25,340.75], null, null]
  ]},
  "2788": {n: "Руски език / Aнглийски език", d: [
    [null, [334.5,334.75,334.5,382.75,378.75,382.75], [373,0,373,373,0,373], null],
    [[320.3,320.75,320.3,470.25,383.75,470.3], [312.5,312.75,312.5,414.25,383.75,414.25], [335.25,335,347,347.3,335.3,347.3], null],
    [[336,342,336,414.75,370.25,414.75], [324,327,324,361,361,356.25], null, null],
    [[319.25,319.25,319.5,430.5,385.5,430.5], [312.75,321.25,312.75,372.5,321.25,372.5], null, null]
  ]},
  "3031": {n: "Руски език / Немски език", d: [
    [null, [326.5,329.5,326.5,399,367.25,399], null, [354.5,0,354.5,354.5,0,354.5]],
    [[313.5,314.25,313.5,382.5,382.5,354.8], [308.5,310,308.5,348.25,327,348.25], [327.25,0,327,330,0,330], [317.5,0,317.5,317.5,0,317.5]],
    [[306.25,306.25,312.25,422.25,422.25,420.75], [295.75,306.25,295.75,390.25,311.5,390.25], [355.5,355.5,0,355.5,355.5,0], null],
    [[297.5,297.5,299.5,338,319.75,338], [287.5,289.25,287.5,338,316.75,338], [306,0,306,306,0,306], null]
  ]},
  "5060": {n: "Природни науки / Руски език / БЗО / ХООС", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[314,315.25,314,404.25,346.75,404.25], [291.5,296.25,291.5,329,329,329], null, null],
    [[295.5,295.5,296,394.5,374,394.5], [285,290.5,285,307,301,307], [304.75,304.75,327.25,327.25,304.75,327.25], [257.5,0,0,257.5,0,0]]
  ]},
}};
ruoSchools["200239"] = {n: "ППМГ", f: "ППМГ Акад. Никола Обрешков", c: false, p: {
  "2780": {n: "Математически профил / Математика / Информатика", d: [
    [null, [434.25,434.25,0,437.25,437.25,0], null, null],
    [[458.3,458.25,458.5,500,498,500], [455.25,455.25,0,457,457,0], null, null],
    [[454.75,455.75,454.75,499.25,499,499.25], [453.5,453.5,453.75,454.25,454.25,453.75], null, null],
    [[434.75,435.5,434.75,498.5,494.5,498.5], [428.5,428.5,430.5,431.5,428.5,431.5], null, null]
  ]},
  "2786": {n: "Природни науки / БЗО / ХООС", d: [
    [null, [423.25,423.25,0,431,431,0], null, null],
    [[455.5,457.75,455.5,495,484.25,495], [455.25,0,455.25,455.25,0,455.25], null, null],
    [[459.5,460.5,459.5,494,494,494], null, null, null],
    [[433.75,437.5,433.75,493,474,493], [432.25,0,432.25,432.25,0,432.25], null, null]
  ]},
  "2784": {n: "Софтуерни и хардуерни науки / Информатика / Информационни технологии", d: [
    [null, null, null, null],
    [[454.8,455,454.8,484.5,484,484.5], [454.5,454.5,0,454.5,454.5,0], null, null],
    [[442,443,442,485,485,456.75], [437.5,437.5,437.75,452,452,443], null, null],
    [[423,423,426.25,491.25,491.25,457.25], [419.25,419.25,421,426.25,422.25,426.25], null, null]
  ]},
}};
ruoSchools["200228"] = {n: "СУ Йордан Йовков", f: "СУ Йордан Йовков", c: false, p: {
  "4280": {n: "Търговия", d: [
    [null, [208.25,208.25,250.5,378.25,303.5,378.25], [316.5,330.25,316.5,356.25,356.25,322.5], [316,0,316,316,0,316]],
    [[119.3,134.5,119.3,274.25,233.5,274.3], [119.25,180.5,119.25,210,210,119.25], [157.25,232,157,296.5,296.5,221.5], [221.5,274.5,221.5,274.5,274.5,221.5]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3115": {n: "Съдебна администрация", d: [
    [null, [166.5,184.5,166.5,383,291.75,383], [269,279,269,313.75,301.5,313.75], [274,0,274,306.75,0,306.75]],
    [[277,277,281.5,453,305,453], [227.75,231.75,227.75,360,302,360], [283.5,0,284,303.8,0,303.8], [307.25,0,307.25,307.25,0,307.25]],
    [[219.25,219.25,219.75,387,344.5,387], [204.5,266.25,204.5,329.5,313.75,329.5], [309,0,309,329,0,329], null],
    [null, null, null, null]
  ]},
  "4873": {n: "Съдебна администрация - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[87,87,141.5,341.5,341.5,323.5], [148,0,148,311.75,0,311.75], [311.75,0,311.75,311.75,0,311.75], [311.75,0,311.75,311.75,0,311.75]],
    [[203.75,203.75,218,371.75,363.75,371.75], [200,363.75,200,363.75,363.75,339], [224,0,224,224,0,224], null]
  ]},
  "30095": {n: "Киберсигурност - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[124.25,124.25,157,387.75,363.25,387.75], [136,136,324.25,334,334,324.25], null, [176.5,0,0,176.5,0,0]]
  ]},
}};
ruoSchools["200230"] = {n: "СУ Димчо Дебелянов", f: "СУ Димчо Дебелянов", c: false, p: {
  "2875": {n: "Компютърна графика", d: [
    [null, [54,54,263,316.5,212,316.5], [127.5,127.5,203.5,278.5,244.5,278.5], [268,0,268,268,0,268]],
    [[105,105,108,317,285,317], [120,120,181,305.5,236,305.5], null, [166,166,0,166,166,0]],
    [[126,126,148,283,239,283], [167,167,210.5,210.5,167,210.5], [120,0,120,120,0,120], null],
    [[95,95,137,262,242.5,262], null, null, [69.5,0,0,69.5,0,0]]
  ]},
  "4298": {n: "Природни науки", d: [
    [null, [163,163,194,194,163,194], [30,30,0,246.5,246.5,0], [106,140,106,297.5,246.5,297.5]],
    [[90,91,90,322,91,322], [172.5,0,172.5,172.5,0,172.5], [128,0,128,128,0,128], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
}};
ruoSchools["200231"] = {n: "СУ Добри Чинтулов", f: "СУ Добри Чинтулов", c: false, p: {
  "4253": {n: "Български танц, Танцьор", d: [
    [null, null, [173,173,0,173,173,0], [225,0,225,225,0,225]],
    [[144,144,212,454,454,290], null, [201,201,0,201,201,0], null],
    [[54,65,54,299,203,299], [151,0,151,151,0,151], null, null],
    [null, null, null, null]
  ]},
  "4249": {n: "Модерен танц,Танцьор", d: [
    [null, [202,0,202,202,0,202], [205,0,205,205,0,205], null],
    [[188,215.5,188,232,232,224], null, null, null],
    [[158,158,174,206,163,206], [158,158,0,158,158,0], null, null],
    [null, null, null, null]
  ]},
  "195": {n: "Музика", d: [
    [null, [301.5,301.5,365.25,389,389,365.25], null, null],
    [[283,344.25,283,427.5,407,427.5], null, null, null],
    [[308.5,308.5,320.25,446.5,381,446.5], [277.5,0,277.5,337.25,0,337.25], null, null],
    [[258,258,276,430.5,430.5,421], null, null, null]
  ]},
  "28881": {n: "Танцово изкуство - български народни танци", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[157,157,166,273,169.5,273], null, null, null]
  ]},
  "28882": {n: "Танцово изкуство - модерен танц", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[165,0,165,313,0,313], [260.5,0,260.5,260.5,0,260.5], null, null]
  ]},
}};
ruoSchools["200229"] = {n: "СУ Конст. Преславски", f: "СУ Еп. Конст. Преславски", c: false, p: {
  "1000": {n: "Екскурзоводско обслужване", d: [
    [null, [170,170,179.5,260,228,260], [252.5,0,252.5,286.5,0,286.5], null],
    [[117,117,131,302,302,234], [111,111,145,237,237,171], [315.5,0,316,315.5,0,315.5], [271.5,271.5,0,271.5,271.5,0]],
    [[81,119,81,355,319.5,355], [129,319.5,129,319.5,319.5,129], [287.5,0,287.5,287.5,0,287.5], null],
    [null, null, null, null]
  ]},
  "3355": {n: "Компютърна анимация", d: [
    [null, [245,251.5,245,312,307.5,312], [263,273,263,301,273,301], null],
    [[268.5,269,268.5,395,395,391], [252,252,254,351,351,334.5], [319,0,319,319,0,319], [255,255,0,289,289,0]],
    [[195,205,195,448,352,448], [187,189.5,187,352,352,187], [205,205,288,288,205,288], null],
    [null, null, null, null]
  ]},
  "4321": {n: "Моден дизайн", d: [
    [null, [229,0,229,320.5,0,320.5], [316.5,0,316.5,316.5,0,316.5], null],
    [[213.5,226,213.5,411,233.5,411], [196,203,196,293,226,293], [258.5,0,259,258.5,0,258.5], [227.5,0,227.5,227.5,0,227.5]],
    [[107,119,107,346,275,346], [172,172,188,226,172,226], [156,0,156,279,0,279], null],
    [[206,253,206,384,253,384], [187,190,187,262,190,262], [301,0,301,301,0,301], null]
  ]},
  "1011": {n: "Рекламна графика", d: [
    [null, [217,217,227,332.5,309.5,332.5], [277.5,285.5,277.5,285.5,285.5,277.5], null],
    [[238.5,238.5,254,421,421,305], [205,205,216.5,322,322,305], [305,313,305,312.5,312.5,305], null],
    [[202,226,202,345,317.5,345], [236,0,236,345,0,345], null, null],
    [[184.5,190,184.5,382,308,382], [210.5,0,210.5,295,0,295], [159,318,159,318,318,187], null]
  ]},
  "29060": {n: "Анимация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[204,247,204,426.5,303,426.5], null, [221,0,221,285.5,0,285.5], null]
  ]},
  "29010": {n: "Екскурзовод", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[90,97.5,90,297,263.5,297], [97.5,97.5,0,97.5,97.5,0], [84,84,173,173,118,173], null]
  ]},
}};
ruoSchools["200227"] = {n: "СУ Иван Вазов", f: "СУ Иван Вазов", c: false, p: {
  "3790": {n: "Асистент на лекар по дентална медицина", d: [
    [null, [164,169,164,274,169,274], [308,0,308,308,0,308], null],
    [[185,229,185,384,260.5,384], null, null, null],
    [[211,254.5,211,339,310,339], [208.5,0,208.5,323,0,323], null, null],
    [null, null, null, null]
  ]},
  "1800": {n: "Извършване на термални процедури в балнеологични и други възстановителни центрове", d: [
    [null, [160,160,174,222,217.5,222], [287.5,0,287.5,287.5,0,287.5], null],
    [[168,171,168,336,313,336], [112,112,153,336,195.5,336], [139.5,0,140,302,0,302], null],
    [[158,158,164,407,286.5,407], [149,0,149,179.5,0,179.5], null, null],
    [null, null, null, null]
  ]},
  "29870": {n: "Асистиране в денталната медицина - дуална", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[76,90,76,418,418,371.5], [242,0,242,242,0,242], null, null]
  ]},
  "29867": {n: "Балнеологични и възстановителни процедури - дуална", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[134,134,151,374,374,368.5], null, [113,0,113,113,0,113], null]
  ]},
}};
ruoSchools["200232"] = {n: "СУ Конст. Петканов", f: "СУ Константин Петканов", c: false, p: {
  "2884": {n: "Графичен дизайн", d: [
    [null, [151,151,289.5,289.5,151,289.5], [198.5,237.5,198.5,237.5,237.5,237], [204,290.5,204,290.5,290.5,204]],
    [[85,103,85,297.5,103,297.5], [282,0,282,297.5,0,297.5], [257.5,0,258,257.5,0,257.5], [315.5,0,315.5,315.5,0,315.5]],
    [[119,119,198.5,341,225,341], [198.5,0,198.5,281,0,281], [312,0,312,312,0,312], null],
    [[90,91,90,313,216,313], [163,0,163,163,0,163], [231,0,231,231,0,231], null]
  ]},
  "2887": {n: "Спедитор-логистик - обучение чрез работа", d: [
    [null, [155,155,0,333,333,0], [140,140,0,140,140,0], [116,143,116,143,143,116]],
    [[102,102,108,321.5,321.5,302.5], null, null, null],
    [[77,77,85,401,248,401], null, null, null],
    [null, null, null, null]
  ]},
  "29159": {n: "Спедиторски услуги - дуална", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,41,78,357.5,337.5,357.5], [163,163,0,337.5,337.5,0], null, null]
  ]},
}};
ruoSchools["200233"] = {n: "СУ Петко Росен", f: "СУ Петко Росен", c: false, p: {
  "4097": {n: "Интериорен дизайн", d: [
    [null, [310,0,310,310,0,310], [231,0,231,231,0,231], [198.5,0,198.5,198.5,0,198.5]],
    [[124,141,124,315.5,226,315.5], [205.5,0,205.5,315.5,0,315.5], [222,0,222,224,0,224], null],
    [[114,114,143,272,272,212], null, null, null],
    [null, null, null, null]
  ]},
  "2860": {n: "Организация и технология на фризьорските услуги", d: [
    [null, null, [187,0,187,209.5,0,209.5], null],
    [[57,57,93,331.5,204,331.5], null, null, null],
    [[115,118,115,304.5,205,304.5], null, null, null],
    [null, null, null, null]
  ]},
  "30014": {n: "Интериорен и екстериорен дизайн", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[54,54,100,343,343,318], [283.5,0,283.5,283.5,0,283.5], null, null]
  ]},
  "30001": {n: "Фризьорство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[52,52,52,334,158,334], null, null, null]
  ]},
}};
ruoSchools["200226"] = {n: "ОбУ Кл. Охридски", f: "Обединено училище Св. Климент Охридски", c: false, p: {
  "1043": {n: "Автотранспортна техника", d: [
    [null, null, [30,0,30,174,0,174], null],
    [[30,30,62,258.5,193,258.5], null, null, null],
    [[74,74,0,223,223,0], null, null, null],
    [null, null, null, null]
  ]},
  "4928": {n: "Сътрудник социални дейности", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[78,0,78,187.5,0,187.5], null, null, null],
    [null, null, null, null]
  ]},
  "29504": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[50,50,0,144,144,0], null, null, null]
  ]},
  "29506": {n: "Социални дейности", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,0,41,225,0,225], null, [100,0,100,100,0,100], null]
  ]},
}};
ruoSchools["200234"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "268": {n: "Изобразително изкуство", d: [
    [null, [184,209.25,184,327.5,209.25,327.5], null, null],
    [[342,351.5,342,451,392,451], [332.25,0,332.25,332.25,0,332.25], null, null],
    [[262,273.5,262,400.75,361.5,400.75], [393,0,393,393,0,393], null, null],
    [[283,365,283,452.5,400.75,452.5], null, null, null]
  ]},
  "260": {n: "Икономическо развитие", d: [
    [null, [90,90,116,289.5,271,289.5], [289,0,289,297.5,0,297.5], null],
    [[131,131,141,323.5,323.5,306], [132,132,157.5,273.5,273.5,272], [165.5,166,178,266.5,255,266.5], [276.5,0,276.5,276.5,0,276.5]],
    [[122,122,185,318,295.5,318], [207,295.5,207,304,295.5,304], [202,276.5,202,282.5,276.5,282.5], null],
    [null, null, null, null]
  ]},
  "267": {n: "Софтуерни и хардуерни науки", d: [
    [null, [72,122,72,285,263,285], [278,290,278,295.5,295.5,278], [273,0,273,276.5,0,276.5]],
    [[160,165,160,342.5,342.5,339.5], [144,144,154,294,200.5,294], [225,0,225,225,0,225], [255,255,0,255,255,0]],
    [[30,30,228.5,288,288,274], [229,246,229,288,288,269.5], [217,0,217,326.5,0,326.5], [292,292,0,292,292,0]],
    [null, null, null, null]
  ]},
  "29971": {n: "Дизайн на дигитални и печатни медии", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[195,205,195,372.5,372.5,327.5], [152,205,152,290.5,259,290.5], [201,240,201,288,240,288], null]
  ]},
  "29966": {n: "Природни науки", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[89,89,118,345.5,309.5,345.5], null, [314,0,314,314,0,314], [195,0,0,195,0,0]]
  ]},
}};
ruoSchools["200246"] = {n: "Търговска гимназия", f: "Търговска гимназия", c: false, p: {
  "789": {n: "Банково дело", d: [
    [null, [362.5,365.5,362.5,395.5,395.5,372], [358,358,0,358,358,0], null],
    [[369,369,369,416,415,416], [368.5,380,368.5,415,415,410], [343.5,0,344,343.5,0,343.5], null],
    [[378,378.5,378,455,412.5,455], [371.5,371.5,380.5,394,394,380.5], null, null],
    [null, null, null, null]
  ]},
  "824": {n: "Бизнес - администрация", d: [
    [null, [381,381,401,419,399,419], null, null],
    [[388,391,388,461,461,442], [386,400.5,386,406,406,401], null, null],
    [[395.5,399.5,395.5,432,432,422.5], [397.5,402,397.5,424.5,424.5,422.5], null, null],
    [null, null, null, null]
  ]},
  "796": {n: "Икономика и мениджмънт с АЕ", d: [
    [null, [406,414,406,435,414,435], [414,414,0,414,414,0], [321.5,0,321.5,321.5,0,321.5]],
    [[426.5,426.5,429.5,468.5,455.5,468.5], [434.5,452.5,434.5,452.5,452.5,446], null, null],
    [[425,426,425,477.5,453.5,477.5], [426,426,0,433,433,0], null, null],
    [null, null, null, null]
  ]},
  "817": {n: "Икономика и мениджмънт с РЕ", d: [
    [null, [378,378,380,445,405.5,445], null, null],
    [[388.5,390,388.5,426,426,424], [388,398.5,388,426,426,423], null, null],
    [[405,405,406.5,439,420,439], [393.5,393.5,422,422,420,422], null, null],
    [null, null, null, null]
  ]},
  "781": {n: "Оперативно счетоводство", d: [
    [null, [344,344,344.5,404.5,404.5,400.5], null, null],
    [[354.5,354.5,355,437.5,437.5,429], [352.5,354.5,352.5,410,375,410], null, null],
    [[356,356,356,479.5,395,479.5], [354,359.5,354,423,364,423], null, null],
    [null, null, null, null]
  ]},
  "28380": {n: "Административни и офис дейности - AE", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[382,382,383.5,433.5,416.5,433.5], [354.5,361.5,354.5,416.5,416.5,401], null, null]
  ]},
  "28376": {n: "Банково, застрахователно и осигурително дело - AE", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[364.5,364.5,370,436,420.5,436], [354.5,354.5,356.5,389.5,385.5,389.5], null, null]
  ]},
  "28379": {n: "Мениджмънт и икономика - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[423,426.5,423,463.5,457,463.5], [421,422.5,421,438,428,438], null, null]
  ]},
  "28385": {n: "Мениджмънт и икономика - РЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[395.5,399,395.5,421.5,421.5,421.5], [393,393,394.5,417.5,409.5,417.5], null, null]
  ]},
  "30054": {n: "Оперативно счетоводство - АЕ/НЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[347,347,347,401.5,382,401.5], [338.5,338.5,339.5,348,348,346], null, null]
  ]},
  "28372": {n: "Оперативно счетоводство - АЕ/РЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[349,349,354.5,413.5,389,413.5], [348,354,348,390.5,354,390.5], null, null]
  ]},
}};
