// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Dulovo
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1900327"] = {n: "ПГ по облекло и трансп.", f: "ПГ по облекло и транспорт", c: false, p: {
  "0045": {n: "Монтьор на транспортна техника с очакван недостиг", d: [
    [[30,0,0,245.5,0,0], [30,0,0,245.5,0,0], [30,0,0,245.5,0,0], [30,0,0,245.5,0,0]],
    [[41,0,0,230,0,0], [41,0,0,230,0,0], [41,0,0,230,0,0], [41,0,0,230,0,0]],
    [[92,0,0,283.5,0,0], [92,0,0,283.5,0,0], [92,0,0,283.5,0,0], [92,0,0,283.5,0,0]]
  ]},
  "0046": {n: "Моделиер-технолог на облекло", d: [
    [[41,0,0,255,0,0], [41,0,0,255,0,0], [41,0,0,255,0,0], [41,0,0,255,0,0]],
    [[114,0,0,335,0,0], [114,0,0,335,0,0], [114,0,0,335,0,0], [30,0,0,335,0,0]],
    [[65,0,0,270,0,0], [65,0,0,270,0,0], [65,0,0,270,0,0], [65,0,0,270,0,0]]
  ]},
  "0047": {n: "Монтьор на селскостопанска техника", d: [
    [[30,0,0,166,0,0], [30,0,0,166,0,0], [30,0,0,176,0,0], [30,0,0,176,0,0]],
    [[80.5,0,0,178,0,0], [80.5,0,0,178,0,0], [80.5,0,0,178,0,0], [30,0,0,178,0,0]],
    [[86,0,0,259,0,0], [86,0,0,259,0,0], [86,0,0,259,0,0], [86,0,0,259,0,0]]
  ]},
}};
ruoSchools["1900301"] = {n: "СУ Васил Левски", f: "СУ Васил Левски", c: false, p: {
  "3704": {n: "Приложен програмист", d: [
    [[176,0,0,381,0,0], [174,0,0,381,0,0], [165.5,0,0,381,0,0], [165.5,0,0,381,0,0]],
    [[192,0,0,384,0,0], [192,0,0,384,0,0], [192,0,0,384,0,0], [192,0,0,384,0,0]],
    [[205,0,0,383,0,0], [189,0,0,383,0,0], [189,0,0,383,0,0], [189,0,0,383,0,0]]
  ]},
  "0088": {n: "Хуманитарни науки", d: [
    [[193.5,0,0,354.25,0,0], [184.5,0,0,354.25,0,0], [184.5,0,0,354.25,0,0], [184.5,0,0,354.25,0,0]],
    [[206,0,0,382.5,0,0], [206,0,0,382.5,0,0], [206,0,0,382.5,0,0], [206,0,0,382.5,0,0]],
    [[249,0,0,422.5,0,0], [249,0,0,422.5,0,0], [249,0,0,422.5,0,0], [249,0,0,422.5,0,0]]
  ]},
  "0094": {n: "Природни науки", d: [
    [[214,0,0,408.5,0,0], [205,0,0,408.5,0,0], [205,0,0,408.5,0,0], [205,0,0,408.5,0,0]],
    [[206,0,0,400.5,0,0], [206,0,0,400.5,0,0], [206,0,0,400.5,0,0], [206,0,0,400.5,0,0]],
    [[286,0,0,448,0,0], [286,0,0,448,0,0], [286,0,0,448,0,0], [286,0,0,448,0,0]]
  ]},
}};
