// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Radomir
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1403657"] = {n: "ПГ по транспорт", f: "ПГ по транспорт", c: false, p: {
  "2611": {n: "Автотранспортна техника, Техник по транспортна техника", d: [
    [[44,0,0,425.5,0,0], null, null, null],
    [[30,0,0,234,0,0], null, null, null],
    [[30,0,0,193.5,0,0], null, null, null]
  ]},
  "3482": {n: "Спедиция, транспортна и складова логистика, Спедитор-логист", d: [
    [[86,0,0,105,0,0], null, null, null],
    [[93,0,0,191,0,0], null, null, null],
    [null, null, null, null]
  ]},
}};
ruoSchools["1403655"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "0721": {n: "Математически профил - математика и информатика", d: [
    [[181.5,0,0,395,0,0], [177,0,0,199,0,0], null, null],
    [[185.5,0,0,401,0,0], null, null, null],
    [[147,0,0,351.5,0,0], [162,0,0,283.5,0,0], null, null]
  ]},
  "3766": {n: "Приложен програмист - приложно програмиране", d: [
    [[211,0,0,394.5,0,0], [268.5,0,0,268.5,0,0], null, null],
    [[211,0,0,415.5,0,0], null, null, null],
    [[163,0,0,415,0,0], null, null, null]
  ]},
}};
ruoSchools["1403656"] = {n: "Техническа ПГ", f: "Техническа ПГ Никола Вапцаров", c: false, p: {
  "3213": {n: "Икономист-информатик - Икономическа информатика", d: [
    [[34,0,0,279,0,0], [158.5,0,0,158.5,0,0], null, null],
    [[73,0,0,320.5,0,0], null, null, null],
    [[73,0,0,262,0,0], null, null, null]
  ]},
  "3214": {n: "Техник на електронна техника - Промишлена електроника", d: [
    [[30,0,0,177,0,0], [125,0,0,125,0,0], null, null],
    [[36,0,0,173,0,0], null, null, null],
    [[80.5,0,0,238,0,0], null, null, null]
  ]},
}};
