// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Krichim
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["1601403"] = {n: "СУ Петко Славейков", f: "СУ Петко Рачов Славейков", c: false, p: {
  "514": {n: "Икономическа информатика", d: [
    [[45,45,69,287,287,279.5], null, null, null],
    [[89,89,93,359.5,253,359.5], [247,0,247,247,0,247], null, null],
    [[30,30,74,270.5,270.5,257], [217,0,217,217,0,217], [44,44,0,213,213,0], null],
    [null, null, null, null]
  ]},
  "29940": {n: "Предприемачески", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,30,256.5,256.5,256], null, null, null]
  ]},
}};
