// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Drianovo
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["700205"] = {n: "ПГ по иконом. и техника", f: "ПГ по икономика и техника", c: false, p: {
  "1323": {n: "Икономика и мениджмънт", d: [
    [[116,116,167,386.5,116,386.5], [242.5,0,242.5,242.5,0,242.5], [30,30,133,242.5,30,242.5], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "1325": {n: "Организация на туризма и свободното време", d: [
    [[103,215,103,260.5,260.5,172], null, [124,252,124,252,252,124], null],
    [[105,171,105,340.5,171,340.5], null, [171,0,171,177,0,177], null],
    [[110,119,110,347,119,347], null, null, null],
    [null, null, null, null]
  ]},
  "1322": {n: "Машини и системи с ЦПУ-дуална форма на обучение", d: [
    [null, null, null, null],
    [[63,63,0,201,201,0], null, [171,171,0,171,171,0], null],
    [[90,90,0,323.5,323.5,0], null, null, null],
    [null, null, null, null]
  ]},
  "30049": {n: "Автоматизирани системи и технологии в машиностроенето", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[96,96,291.5,291.5,164.5,291.5], null, [80.5,80.5,0,213,213,0], null]
  ]},
  "30088": {n: "Мениджмънт и икономика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[94,0,94,208.5,0,208.5], null, null, null]
  ]},
}};
ruoSchools["700204"] = {n: "СУ Максим Райкович", f: "СУ Максим Райкович", c: false, p: {
  "3906": {n: "Системно програмиране", d: [
    [[71,71,94,320,320,315.5], [220,220,0,220,220,0], [159,0,159,159,0,159], null],
    [[142,142,155,328.5,322,328.5], [275.5,322,275.5,322,322,275.5], null, null],
    [[92,92,113,304,304,292], [78,0,78,237,0,237], null, null],
    [null, null, null, null]
  ]},
  "29521": {n: "Интегриране на дигитални технологии", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[106,106,176,397.5,397.5,232.5], [224,224,0,256,256,0], null, null]
  ]},
}};
