// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Hisaria
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["1603708"] = {n: "СУ Хр. Смирненски", f: "СУ Христо Смирненски", c: false, p: {
  "1859": {n: "Готвач", d: [
    [[30,30,93,327,221,327], null, null, null],
    [[30,30,96,229.5,170,229.5], null, null, null],
    [[76,76,85,380.5,204,380.5], [72,72,0,72,72,0], null, null],
    [null, null, null, null]
  ]},
  "3973": {n: "Спедитор-логистик", d: [
    [[128,128,171,290.5,290.5,283], [250.5,250.5,0,250.5,250.5,0], [170,170,0,397.5,397.5,0], null],
    [[118,118,188,416,416,323.5], null, [230,230,320.5,320.5,230,320.5], [310,0,310,310,0,310]],
    [[124,124,225,417,417,337.5], null, [310,310,0,310,310,0], null],
    [null, null, null, null]
  ]},
  "3972": {n: "Хотелиер", d: [
    [[90,90,254,362.5,275,362.5], [324,0,324,324,0,324], [162.5,162.5,0,162.5,162.5,0], null],
    [[162,162,166,386,379,386], [299,0,299,299,0,299], [299,0,299,299,0,299], null],
    [[63,68,63,343,310,343], [343,0,343,343,0,343], [92,92,177,177,145,177], null],
    [null, null, null, null]
  ]},
  "28852": {n: "Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[58,58,98,359,198,359], null, null, null]
  ]},
  "28860": {n: "Организиране на туристически пътувания", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[100,106,100,402,352.5,402], null, null, null]
  ]},
  "28849": {n: "Спедиторски услуги", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[74,74,108,358.5,358.5,330], null, null, null]
  ]},
}};
