// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Dobrich
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["800020"] = {n: "ЕГ Гео Милев", f: "ЕГ Гео Милев", c: false, p: {
  "1719": {n: "Английски език с втори чужд Немски език", d: [
    [[387.5,0,0,478,0,0], [381,0,0,382,0,0], null, null],
    [[396,0,0,474.5,0,0], [366.5,0,0,390,0,0], null, null],
    [[376.5,0,0,458,0,0], [370.5,0,0,370.5,0,0], null, null],
    [[422,0,0,493,0,0], [411,0,0,411,0,0], null, null]
  ]},
  "1722": {n: "Английски език с втори чужд Френски език - 0,5 / Руски език - 0,5", d: [
    [[375.5,0,0,483,0,0], [362.5,0,0,375.5,0,0], null, null],
    [[390.5,0,0,485,0,0], [385.5,0,0,386,0,0], null, null],
    [[379,0,0,465.5,0,0], [370,0,0,375,0,0], null, null],
    [[381,0,0,463.5,0,0], [367.5,0,0,410.5,0,0], null, null]
  ]},
  "1712": {n: "Немски език с втори чужд Английски език", d: [
    [[365,0,0,488,0,0], [362.5,0,0,368.5,0,0], null, null],
    [[385.5,0,0,489,0,0], [354,0,0,384,0,0], null, null],
    [[337,0,0,460.5,0,0], [322,0,0,366,0,0], [452.5,0,0,452.5,0,0], null],
    [[407,0,0,474.5,0,0], null, null, null]
  ]},
  "1714": {n: "Немски език с втори чужд Руски език", d: [
    [[336,0,0,395,0,0], [326,0,0,359.5,0,0], null, [311,0,0,360.5,0,0]],
    [[340,0,0,456,0,0], [285.5,0,0,379,0,0], [342,0,0,342,0,0], null],
    [[246.5,0,0,431.5,0,0], [235.5,0,0,316.5,0,0], null, null],
    [[304.5,0,0,461,0,0], [304,0,0,390,0,0], [295,0,0,295,0,0], null]
  ]},
}};
ruoSchools["800003"] = {n: "ОбУ Йордан Йовков", f: "ОбУ Йордан Йовков", c: false, p: {
  "966": {n: "Работник в ЗХР", d: [
    [[30,0,0,238,0,0], null, null, [83,0,0,83,0,0]],
    [[30,0,0,165,0,0], null, null, null],
    [[30,0,0,129,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "29834": {n: "Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,0,0,129,0,0], null, null, null]
  ]},
}};
ruoSchools["800019"] = {n: "ПМГ Иван Вазов", f: "ПМГ Иван Вазов", c: false, p: {
  "1145": {n: "Приложно програмиране", d: [
    [[224.5,0,0,416,0,0], [191.5,0,0,345,0,0], null, null],
    [[157,0,0,417.5,0,0], [180.5,0,0,282.5,0,0], [220.5,0,0,319,0,0], null],
    [[88,0,0,411.5,0,0], [160,0,0,160,0,0], [137,0,0,137,0,0], null],
    [null, null, null, null]
  ]},
  "1170": {n: "Природни науки - биология", d: [
    [[258,0,0,395,0,0], [239,0,0,353,0,0], [299.5,0,0,317.5,0,0], [144,0,0,144,0,0]],
    [[237,0,0,439.5,0,0], [228,0,0,258.5,0,0], null, null],
    [[168,0,0,455,0,0], [153,0,0,153,0,0], null, null],
    [[222,0,0,385.5,0,0], [91,0,0,378,0,0], null, null]
  ]},
  "1163": {n: "Софтуерни и хардуерни науки", d: [
    [[203.5,0,0,350,0,0], [199,0,0,350,0,0], [184.5,0,0,184.5,0,0], null],
    [[184,0,0,403.5,0,0], [160.5,0,0,184,0,0], [147.5,0,0,276.5,0,0], [276.5,0,0,276.5,0,0]],
    [[67,0,0,348,0,0], [187,0,0,305,0,0], [151,0,0,305,0,0], null],
    [[111,0,0,406,0,0], [363,0,0,378,0,0], [326.5,0,0,326.5,0,0], null]
  ]},
  "4558": {n: "Математика - Информатика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "28401": {n: "Разработка на софтуер", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[52,0,0,428,0,0], [326.5,0,0,326.5,0,0], [146,0,0,146,0,0], null]
  ]},
}};
ruoSchools["800026"] = {n: "ПГ по агр. стоп.", f: "Професионална гимназия по аграрно стопанство", c: false, p: {
  "3715": {n: "Растителна защита и агрохимия", d: [
    [[41,0,0,242,0,0], [41,0,0,217,0,0], [118,0,0,352.5,0,0], null],
    [[73,0,0,323.5,0,0], [221,0,0,235,0,0], [128,0,0,284.5,0,0], null],
    [[99,0,0,329.75,0,0], [202.25,0,0,202.25,0,0], [131,0,0,228,0,0], null],
    [null, null, null, null]
  ]},
  "685": {n: "Техник на ССТ - дуална форма на обучение", d: [
    [[139,0,0,228,0,0], [115,0,0,168,0,0], [183,0,0,183,0,0], null],
    [[150.5,0,0,310,0,0], [119.5,0,0,181.5,0,0], null, null],
    [[109,0,0,301,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "4706": {n: "Трайни насаждения", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "28825": {n: "Агрономство и агробизнес", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[119.5,0,0,256.5,0,0], null, null, null]
  ]},
  "28704": {n: "Механизация и цифровизация в аграрния сектор", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[59,0,0,364.5,0,0], [186,0,0,245.5,0,0], [171.5,0,0,171.5,0,0], null]
  ]},
}};
ruoSchools["800022"] = {n: "ПГ по вет. медицина", f: "ПГ по ветеринарна медицина", c: false, p: {
  "1167": {n: "Асистент на лекар по дентална медицина", d: [
    [[149.25,0,0,403.5,0,0], null, null, [170,0,0,300.5,0,0]],
    [[115,0,0,278.25,0,0], null, null, null],
    [[170,0,0,336.5,0,0], null, [146.5,0,0,227,0,0], null],
    [null, null, null, null]
  ]},
  "1120": {n: "Ветеринарен техник", d: [
    [[123.5,0,0,365.25,0,0], [118,0,0,118,0,0], [188.5,0,0,255.75,0,0], null],
    [[152.5,0,0,374.5,0,0], [152.5,0,0,229.25,0,0], [299,0,0,299,0,0], null],
    [[149.5,0,0,366.25,0,0], [166.25,0,0,219,0,0], [161.5,0,0,161.5,0,0], null],
    [[145.5,0,0,405.5,0,0], null, [126.5,0,0,126.5,0,0], null]
  ]},
  "1156": {n: "Контрол по качество на храни и напитки", d: [
    [[127,0,0,295.25,0,0], [206.75,0,0,216,0,0], [277.5,0,0,277.5,0,0], null],
    [[117.25,0,0,320.25,0,0], null, [179.75,0,0,232.5,0,0], null],
    [[126,0,0,325.25,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "3536": {n: "Лаборант", d: [
    [[223,0,0,285.5,0,0], null, null, null],
    [[146,0,0,351.75,0,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "29743": {n: "Асистиране в денталната медицина", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[147,0,0,348.25,0,0], null, null, null]
  ]},
  "29740": {n: "Контрол на качеството и безопасност на храните", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[95.5,0,0,226.5,0,0], null, null, null]
  ]},
}};
ruoSchools["800021"] = {n: "ПГ по техника", f: "ПГ по техника и строителство", c: false, p: {
  "1922": {n: "Електрически превозни средства", d: [
    [[84,0,0,231.25,0,0], null, [150.5,0,0,150.5,0,0], null],
    [[93,0,0,335.75,0,0], null, null, null],
    [[170,0,0,356.5,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "4243": {n: "Компютърна техника и технологии", d: [
    [[93,0,0,316.5,0,0], null, null, null],
    [[111,0,0,281,0,0], null, null, [144.5,0,0,261,0,0]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "1892": {n: "Програмно осигуряване", d: [
    [[200,0,0,293.75,0,0], [207.5,0,0,262.5,0,0], null, null],
    [[127,0,0,291,0,0], null, null, null],
    [[93,0,0,323.5,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "3705": {n: "Промишлен дизайн", d: [
    [[41,0,0,247,0,0], [178,0,0,247,0,0], null, null],
    [[143,0,0,250,0,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "29684": {n: "Интериорен и екстериорен дизайн", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[165,0,0,229,0,0], [229,0,0,229,0,0], null, null]
  ]},
  "29680": {n: "Киберсигурност", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[156.5,0,0,349.5,0,0], [156.5,0,0,156.5,0,0], null, null]
  ]},
  "29679": {n: "Компютърни системи и технологии", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[130.5,0,0,318,0,0], null, null, null]
  ]},
  "29683": {n: "Хибридни и електрически пътни превозни средства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,0,0,242.75,0,0], null, null, null]
  ]},
}};
ruoSchools["800328"] = {n: "ПГ по транспорт", f: "ПГ по транспорт, обслужване и лека промишленост", c: false, p: {
  "2588": {n: "Автомобилна мехатроника - дуална форма", d: [
    [[63,0,0,176.5,0,0], null, [65,0,0,203,0,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2595": {n: "Електрически превозни средства", d: [
    [[62,0,0,191,0,0], null, null, null],
    [[57,0,0,175,0,0], [156.5,0,0,156.5,0,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2639": {n: "Модист", d: [
    [[96,0,0,241.5,0,0], [82,0,0,82,0,0], null, null],
    [[126,0,0,222,0,0], null, null, null],
    [[94,0,0,97,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "2571": {n: "Подемно-транспортна техника, монтирана на ППС", d: [
    [[65,0,0,279.5,0,0], null, [72,0,0,102,0,0], null],
    [[52,0,0,211,0,0], null, null, null],
    [[75,0,0,246.5,0,0], null, [216,0,0,216,0,0], null],
    [null, null, null, null]
  ]},
  "2578": {n: "Фризьор", d: [
    [[98,0,0,260,0,0], [94,0,0,96,0,0], null, null],
    [[79,0,0,237.5,0,0], null, [196,0,0,196,0,0], null],
    [[115,0,0,347,0,0], [94,0,0,94,0,0], null, null],
    [null, null, null, null]
  ]},
  "29288": {n: "Автомобилна техника и мехатроника - 8 а", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[42,0,0,147,0,0], null, [161,0,0,182,0,0], null]
  ]},
  "29293": {n: "Моден дизайн - 8в", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[129,0,0,171,0,0], null, null, null]
  ]},
  "29290": {n: "Подемно-транспортна техника, монтирана на пътни транспортни средства - 8 в", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[83,0,0,161,0,0], null, null, null]
  ]},
  "29289": {n: "Фризьорство - 8 б", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[74,0,0,243.5,0,0], null, null, null]
  ]},
}};
ruoSchools["800028"] = {n: "ПГ по туризъм", f: "ПГ по туризъм П. К. Яворов", c: false, p: {
  "676": {n: "Готвач", d: [
    [[151,0,0,272.5,0,0], [161,0,0,235,0,0], [187,0,0,187,0,0], null],
    [[179.5,0,0,288,0,0], [179.5,0,0,187,0,0], null, null],
    [[126,0,0,328,0,0], [198,0,0,198,0,0], [96,0,0,211,0,0], null],
    [null, null, null, null]
  ]},
  "669": {n: "Кетъринг", d: [
    [[65,0,0,243,0,0], [52,0,0,199,0,0], [123,0,0,209,0,0], null],
    [[131,0,0,250,0,0], [131,0,0,131,0,0], [110,0,0,187,0,0], null],
    [[176,0,0,322.5,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "661": {n: "Хотелиер", d: [
    [[87,0,0,287.5,0,0], [41,0,0,209,0,0], [194,0,0,194,0,0], null],
    [[102,0,0,278,0,0], null, [147,0,0,147,0,0], [76,0,0,176,0,0]],
    [[158,0,0,316,0,0], [52,0,0,52,0,0], null, null],
    [null, null, null, null]
  ]},
  "4491": {n: "Хлебар-сладкар", d: [
    [null, null, null, null],
    [[89,0,0,273,0,0], [134,0,0,134,0,0], [78,0,0,274,0,0], null],
    [[94,0,0,257,0,0], [191,0,0,191,0,0], [127,0,0,167,0,0], [185,0,0,207,0,0]],
    [null, null, null, null]
  ]},
  "28104": {n: "Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[136,0,0,311.5,0,0], null, null, null]
  ]},
  "28105": {n: "Ресторантьорство и кетъринг", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[143,0,0,367,0,0], null, null, null]
  ]},
  "28108": {n: "Сладкарство и пекарство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[91,0,0,384.5,0,0], [186,0,0,186,0,0], [137,0,0,178,0,0], null]
  ]},
  "28106": {n: "Хотелиерство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[109,0,0,321.5,0,0], [109,0,0,109,0,0], [157,0,0,157,0,0], null]
  ]},
}};
ruoSchools["800013"] = {n: "СУ Димитър Талев", f: "СУ Димитър Талев", c: false, p: {
  "1596": {n: "Софтуерни и хардуерни науки", d: [
    [[272.25,0,0,440,0,0], [244.5,0,0,348,0,0], null, null],
    [[266.5,0,0,391.75,0,0], [251.5,0,0,262.5,0,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4918": {n: "Програмист на роботи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[235.5,0,0,370.75,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "29670": {n: "Информационни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[211.5,0,0,432,0,0], [282.5,0,0,282.5,0,0], null, null]
  ]},
}};
ruoSchools["800016"] = {n: "СУ Л. Каравелов", f: "СУ Любен Каравелов", c: false, p: {
  "2584": {n: "Софтуерни и хардуерни науки", d: [
    [[216.5,0,0,418,0,0], [206,0,0,277.5,0,0], [219.25,0,0,248,0,0], [162,0,0,162,0,0]],
    [[185.5,0,0,447.75,0,0], [175.25,0,0,200,0,0], [174,0,0,174,0,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4899": {n: "Програмиране на изкуствен интелект", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[237,0,0,425.5,0,0], [230.5,0,0,233.5,0,0], null, null],
    [null, null, null, null]
  ]},
  "29395": {n: "Интелигентни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[115.5,0,0,414.75,0,0], [53,0,0,305,0,0], null, null]
  ]},
}};
ruoSchools["800017"] = {n: "СУ Петко Славейков", f: "СУ Петко Рачов Славейков", c: false, p: {
  "1099": {n: "Чужди езици-Английски език", d: [
    [[310,0,0,463.5,0,0], [294.75,0,0,347.25,0,0], [272.5,0,0,313.5,0,0], [195,0,0,195,0,0]],
    [[273,0,0,380.75,0,0], [172,0,0,380.75,0,0], [166,0,0,380.75,0,0], [274,0,0,274,0,0]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4992": {n: "Икономическо развитие", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[237.5,0,0,450.5,0,0], [218.5,0,0,229.75,0,0], null, null],
    [[243.5,0,0,448.25,0,0], [244,0,0,383.75,0,0], [282.5,0,0,282.5,0,0], null]
  ]},
}};
ruoSchools["800015"] = {n: "СУ Кл. Охридски", f: "СУ Климент Охридски", c: false, p: {
  "2079": {n: "Графичен дизайнер", d: [
    [[175.5,0,0,443,0,0], [366.5,0,0,397.5,0,0], [397.5,0,0,397.5,0,0], null],
    [[255,0,0,470.25,0,0], [401,0,0,401,0,0], null, null],
    [[280.75,0,0,461.5,0,0], [267.5,0,0,430,0,0], null, null],
    [null, null, null, null]
  ]},
  "2060": {n: "Музика", d: [
    [[220.5,0,0,460.25,0,0], [378,0,0,378,0,0], null, [378,0,0,378,0,0]],
    [[295,0,0,474,0,0], null, null, null],
    [[346,0,0,475.25,0,0], [343.25,0,0,343.25,0,0], null, null],
    [[347.5,0,0,468.5,0,0], [305.5,0,0,422,0,0], [304,0,0,304,0,0], null]
  ]},
  "2070": {n: "Танцьор", d: [
    [[288.75,0,0,411,0,0], [299.5,0,0,340,0,0], null, null],
    [[297.5,0,0,461,0,0], [369,0,0,369,0,0], null, null],
    [[300,0,0,413.5,0,0], [338.75,0,0,338.75,0,0], null, null],
    [null, null, null, null]
  ]},
  "28129": {n: "Графичен дизайн", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[339,0,0,469.75,0,0], null, null, null]
  ]},
  "28125": {n: "Танцово изкуство - български народни танци", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[273.25,0,0,483.25,0,0], [214,0,0,363.5,0,0], null, null]
  ]},
}};
ruoSchools["800018"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "1700": {n: "Хуманитарни науки", d: [
    [[306,0,0,446,0,0], [297,0,0,356.75,0,0], null, null],
    [[293,0,0,427.5,0,0], [268,0,0,403.75,0,0], null, null],
    [[240.5,0,0,458.75,0,0], [187,0,0,266.5,0,0], null, null],
    [[111,0,0,400.75,0,0], [193.25,0,0,396.5,0,0], [232.5,0,0,232.5,0,0], null]
  ]},
}};
ruoSchools["800023"] = {n: "Финансово-стопанска", f: "Финансово-стопанска гимназия", c: false, p: {
  "3050": {n: "Електронна търговия", d: [
    [[259,0,0,366,0,0], [246.5,0,0,360.5,0,0], [309,0,0,309,0,0], [211.5,0,0,211.5,0,0]],
    [[244.5,0,0,386,0,0], [214,0,0,363,0,0], [334,0,0,334,0,0], null],
    [[226.5,0,0,428,0,0], [226,0,0,226,0,0], null, null],
    [null, null, null, null]
  ]},
  "686": {n: "Икономическа информатика", d: [
    [[281,0,0,449.5,0,0], [277,0,0,349.5,0,0], null, null],
    [[254,0,0,425,0,0], [202.5,0,0,342,0,0], null, [346.5,0,0,346.5,0,0]],
    [[274.5,0,0,447.5,0,0], [224.5,0,0,334,0,0], [400.5,0,0,400.5,0,0], [334,0,0,334,0,0]],
    [[176,0,0,446,0,0], [328.5,0,0,345,0,0], [189,0,0,189,0,0], null]
  ]},
  "3703": {n: "Митническа и данъчна администрация", d: [
    [[221.5,0,0,364,0,0], [205,0,0,298,0,0], [211.5,0,0,211.5,0,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "701": {n: "Оперативно счетоводство", d: [
    [[203,0,0,410,0,0], [185,0,0,319.5,0,0], [185,0,0,319.5,0,0], null],
    [[216,0,0,355.5,0,0], [152.5,0,0,206,0,0], null, null],
    [[191,0,0,444,0,0], [170,0,0,319,0,0], [175,0,0,175,0,0], null],
    [[65,0,0,337,0,0], [232.5,0,0,252.5,0,0], [240,0,0,240,0,0], null]
  ]},
  "28969": {n: "Електронна търговия, маркетинг и реклама", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[260,0,0,383.5,0,0], [319,0,0,373.5,0,0], null, null]
  ]},
}};
