// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Suvorovo
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["400166"] = {n: "ПГ по сел. стоп.", f: "ПГ по селско стопанство", c: false, p: {
  "4406": {n: "Ветеринарен техник - БИБРИЧЕ_РЕ", d: [
    [[46,0,0,334.5,0,0], null, [70,0,0,214,0,0], null],
    [[52,52,110,271,180,271], null, null, null],
    [[93,0,0,224,0,0], null, null, null]
  ]},
  "3822": {n: "Подпомагане на деца - БИБРИЧЕ_РЕ", d: [
    [[51,0,0,252.5,0,0], null, [115,0,0,115,0,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2505": {n: "Пътно-строителна техника - БИБРИЧЕ_РЕ", d: [
    [[74,0,0,265,0,0], null, [92,0,0,92,0,0], null],
    [[73,73,0,231.5,231.5,0], null, null, null],
    [[30,0,0,214,0,0], null, [30,0,0,65,0,0], null]
  ]},
  "5079": {n: "Трайни насаждения - БИБРИЧЕ_РЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[90,0,0,324,0,0], null, null, null]
  ]},
}};
ruoSchools["400163"] = {n: "СУ Никола Вапцаров", f: "СУ Никола Вапцаров", c: false, p: {
  "3745": {n: "Екскурзовод - РИЧЕ_АЕ", d: [
    [[30,0,0,354.5,0,0], [354.5,0,0,354.5,0,0], [314,0,0,330.5,0,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3742": {n: "Хуманитарни науки_РИЧЕ_АЕ_проф. предм._БЕЛ_Философия", d: [
    [[229,0,0,229,0,0], [229,0,0,229,0,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4649": {n: "Производство и обслужване в заведенията за хранене и развлечения -РИЧЕ-АЕ", d: [
    [null, null, null, null],
    [[30,41,30,285,210,285], null, null, null],
    [[41,0,0,348.5,0,0], [242,0,0,242,0,0], null, null]
  ]},
}};
