// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Belogradchik
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["500201"] = {n: "СУ Христо Ботев", f: "СУ Христо Ботев", c: false, p: {
  "367": {n: "Монтьор на транспортна техника", d: [
    [[30,30,74,190.5,190.5,98], null, null, null],
    [[30,30,55,106,106,105], null, null, null],
    [[30,30,68,214.5,170,214.5], null, null, null],
    [null, null, null, null]
  ]},
  "4297": {n: "Организатор на туристическа агентска дейност", d: [
    [[30,147.5,30,297.5,175,297.5], null, null, null],
    [[95,127,95,388.25,220,388.25], [220,220,0,220,220,0], null, null],
    [[30,45,30,322,322,174], null, null, null],
    [null, null, null, null]
  ]},
  "4074": {n: "Техник-технолог в хранително-вкусовата промишленост-дуална форма", d: [
    [[139.5,208.5,139.5,378.5,208.5,378.5], null, null, null],
    [[94.5,135,94.5,314.25,195,314.25], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "5017": {n: "Ресторантьор", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[103,149.5,103,378.5,378.5,340], null, null, null],
    [null, null, null, null]
  ]},
  "28889": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,30,151.5,151.5,49.5], null, null, null]
  ]},
  "28908": {n: "Организиране на туристически пътувания", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[38,38,41,262,262,144], null, null, null]
  ]},
  "28900": {n: "Ресторнтьорство и кетъринг", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[97.5,97.5,141,318.75,243.25,318.75], null, null, null]
  ]},
}};
