// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Elin-pelin
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["2300170"] = {n: "СУ Васил Левски", f: "СУ Васил Левски", c: false, p: {
  "2737": {n: "Компютърен график", d: [
    [[188,188,193,318,277,318], [173,173,173,203,203,196], [188,222,188,222,222,188], null],
    [[223.5,233,223.5,424,331,424], [208,209,208,218,209,218], null, null],
    [[222,226.5,222,402.5,402.5,364], [170,170,352.5,352.5,204,352.5], null, null],
    [null, null, null, null]
  ]},
  "4392": {n: "Компютърен график - РИЧЕ", d: [
    [[174.5,174.5,190,377,270,377], [132,132,167,172,172,167], [131,131,172,172,131,172], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2731": {n: "Предприемачество", d: [
    [[225.5,225.5,230,402,402,356.5], [193,203.5,193,213,213,201], null, null],
    [[184,186,184,407.5,407.5,375.5], [108,108,156,184,182.5,184], [332,332,0,332,332,0], [221,221,0,221,221,0]],
    [[153,153,233,413,385.5,413], null, [375.5,375.5,0,375.5,375.5,0], [375.5,375.5,0,375.5,375.5,0]],
    [[258.25,258.25,259.25,431,404,431], [219.5,0,0,246.5,0,0], [238.5,0,0,319.5,0,0], [153.5,0,0,153.5,0,0]]
  ]},
  "2728": {n: "Софтуерни и хардуерни науки", d: [
    [[167.5,167.5,186.5,455.75,370.25,455.75], [114.5,114.5,139.75,147.5,147.5,139.75], [182.5,182.5,203,342,342,203], [149.5,149.5,0,149.5,149.5,0]],
    [[179,179,183,449.5,433.75,449.5], [116,119.5,116,181.5,181.5,157], [433.75,433.75,0,433.75,433.75,0], [143.75,143.75,247.75,362,362,247.75]],
    [[88.5,154,88.5,417.75,417.75,413.5], null, [106,240.5,106,240.5,240.5,106], null],
    [[85.5,101.5,85.5,432.25,432.25,383.25], [104,0,0,169.25,0,0], null, null]
  ]},
  "30041": {n: "Компютърна графика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[235,236,235,433.5,409,433.5], [80,0,0,176,0,0], [191,0,0,329.5,0,0], null]
  ]},
}};
