// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Kubrat
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1701602"] = {n: "ПГ по профес.", f: "ПГ по професионално обучение", c: false, p: {
  "0998": {n: "Ресторантьор", d: [
    [[85,0,0,178,0,0], [142.5,0,0,142.5,0,0], [98,0,0,98,0,0], null],
    [[89,0,0,270,0,0], [77,0,0,184,0,0], null, null],
    [[76,0,0,193.5,0,0], null, null, null]
  ]},
  "0988": {n: "\"Техник-растениевъд\"", d: [
    [[51,0,0,140,0,0], [115,0,0,115.5,0,0], [69,0,0,163.5,0,0], null],
    [[93,0,0,214.5,0,0], [93,0,0,181,0,0], [186,0,0,186,0,0], [66,0,0,66,0,0]],
    [[64,0,0,118,0,0], null, [85,0,0,182,0,0], null]
  ]},
}};
ruoSchools["1701601"] = {n: "СУ Христо Ботев", f: "СУ Христо Ботев", c: false, p: {
  "0894": {n: "Природни науки", d: [
    [[171,0,0,258,0,0], [165,0,0,254,0,0], null, null],
    [[207,0,0,388.5,0,0], [198,0,0,283.5,0,0], null, null],
    [[82,0,0,330,0,0], null, [144,0,0,144,0,0], null]
  ]},
  "0876": {n: "Чужди езици - АЕ", d: [
    [[265.5,0,0,450,0,0], [258,0,0,263,0,0], null, null],
    [[293,0,0,441,0,0], [282,0,0,283,0,0], null, null],
    [[209,0,0,414,0,0], [195,0,0,195,0,0], null, null]
  ]},
}};
