// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Krumovgrad
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2024, 2025];

let ruoSchools = {};
ruoSchools["909503"] = {n: "ПГ по транспорт", f: "ПГ по транспорт Хр. Смирненски", c: false, p: {
  "2966": {n: "\" Монтьор на транспортна техника\"", d: [
    [[82,0,0,265,0,0], null, [142,0,0,142,0,0], null],
    [[38,0,0,270,0,0], null, null, null]
  ]},
  "2965": {n: "\" Сътрудник в малък и среден бизнес\"", d: [
    [[116,0,0,222,0,0], null, null, null],
    [[56,0,0,210,0,0], null, null, null]
  ]},
}};
ruoSchools["909501"] = {n: "СУ Васил Левски", f: "СУ Васил Левски", c: false, p: {
  "3956": {n: "Обществени науки", d: [
    [[94,0,0,352.5,0,0], null, null, null],
    [[124,0,0,438,0,0], null, null, null]
  ]},
  "2846": {n: "Природни науки", d: [
    [[164,0,0,464,0,0], null, [352.5,0,0,352.5,0,0], null],
    [[86,0,0,445.5,0,0], null, null, null]
  ]},
  "3256": {n: "Софтуерни и хардуерни науки", d: [
    [[251.5,0,0,439,0,0], null, null, null],
    [[89,0,0,407,0,0], [131,0,0,224,0,0], [131,0,0,224,0,0], null]
  ]},
}};
