// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Tervel
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["800105"] = {n: "ПГ по техника и облекло", f: "ПГ по техника и облекло Д. Михайлов", c: false, p: {
  "635": {n: "Автоматизация на непрекъснати производства", d: [
    [[30,0,0,337.5,0,0], null, null, null],
    [[50,0,0,311,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "638": {n: "Електрически машини и апарати", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[66,0,0,66,0,0], null, null, null]
  ]},
  "644": {n: "Монтьор на селскостопанска техника", d: [
    [[54,0,0,200.5,0,0], null, [84,0,0,92,0,0], [125,0,0,25,0,0]],
    [[42,0,0,315.5,0,0], null, null, null],
    [[58,0,0,175,0,0], null, [72,0,0,170,0,0], null]
  ]},
  "652": {n: "Производство на облекло от текстил", d: [
    [[59,0,0,177,0,0], null, [89,0,0,91,0,0], null],
    [[62,0,0,312,0,0], null, [187,0,0,187,0,0], null],
    [[56,0,0,227,0,0], null, [91,0,0,96,0,0], null]
  ]},
  "4832": {n: "Автоматизирани системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[30,0,0,232,0,0], null, [30,0,0,112,0,0], null]
  ]},
}};
ruoSchools["800094"] = {n: "СУ Йордан Йовков", f: "СУ Йордан Йовков", c: false, p: {
  "1003": {n: "Софтуерни и хардуерни науки", d: [
    [[90,0,0,350,0,0], null, null, null],
    [[119,0,0,405,0,0], [91,0,0,109,0,0], null, null],
    [[111,0,0,377.5,0,0], [98,0,0,98,0,0], null, null]
  ]},
}};
