// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Sandanski
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["102013"] = {n: "Земеделска гимн.", f: "Земеделска професионална гимназия", c: false, p: {
  "2268": {n: "Професия \"Изпълнител на термални процедури\" - специалност \"Извършване на термални процедури в балнеологични и други възстановителни центрове \" с разширено изучаване на АЕ", d: [
    [[201.5,203,201.5,355,266.5,355], [200.5,200.5,204,219.5,219.5,217.5], null, null],
    [[195.5,195.5,198,356,246.5,356], [189.5,189.5,228,262,246,262], null, null],
    [[273,280.5,273,386,323,386], [323,323,0,323,323,0], null, null],
    [null, null, null, null]
  ]},
  "4173": {n: "Професия \"Монтьор на селскостопанска техника\" - специалност \"Механизация на селското стопанство\"", d: [
    [[138,145,138,231.5,231.5,193.5], [155,155,179,216.5,216.5,193.5], null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2248": {n: "Професия \"Организатор Интернет приложения\" - специалност \"Електронна търговия\" с интензивно изучаване на АЕ", d: [
    [[325,325,326,470.5,414,470.5], null, null, null],
    [[326,326.5,326,466,452,466], null, [323.5,323.5,0,323.5,323.5,0], null],
    [[387.5,387.5,388.5,458,458,437.5], null, null, null],
    [null, null, null, null]
  ]},
  "2271": {n: "Професия \"Организатор на туристическа агентска дейност\" - специалност \"Организация на туризма и свободното време\" с интензивно изучаване на АЕ", d: [
    [[307,307,307.5,427.5,338,427.5], [304.5,304.5,0,324,324,0], null, null],
    [[275.5,288,275.5,386,386,378.5], null, null, null],
    [[332,332,332,398.5,398.5,392], [341,355.5,341,360,355.5,360], null, null],
    [null, null, null, null]
  ]},
  "3259": {n: "Професия \"Спедитор-логистик\" - специалност \"Спедиция,транспортна и складова логистика\" с разширено изучаване на АЕ", d: [
    [[261.5,261.5,273.5,312,312,306], [252,261,252,282,282,252], null, null],
    [[265.5,265.5,266,376.5,376.5,360], [266,323.5,266,323.5,323.5,266], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2251": {n: "Професия \"Техник-технолог по качеството на храни и напитки\" -специалност \"Контрол по качеството и безопасност на храни и напитки\" с разширено изучаване на АЕ", d: [
    [[220,220.5,220,313.5,294.5,313.5], [220,225,220,294.5,294.5,220], null, null],
    [[192,194,192,333,333,272.5], [188.5,0,188.5,247,0,247], null, null],
    [[272.5,272.5,285.5,388.5,376.5,388.5], [285.5,301,285.5,347.5,314,347.5], null, null],
    [null, null, null, null]
  ]},
  "4498": {n: "Професия \"Агроеколог\", специалност \"Агроекология\"", d: [
    [null, null, null, null],
    [[147,147,175,212,212,181], [140,142,140,185,185,178], [178.5,178.5,0,193,193,0], null],
    [[189,189,204.5,267,267,265], [194,194,204.5,267,267,264], [256.5,0,256.5,256.5,0,256.5], null],
    [null, null, null, null]
  ]},
  "4929": {n: "Професия \"Техник-озеленител\" - специалност \"Парково строителство и озеленяване\"", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[184,184,186.5,264.5,264.5,202], [187,252,187,264.5,264.5,189], null, null],
    [null, null, null, null]
  ]},
  "28813": {n: "Балнеологични и възстановителни процедури - РИЧЕ-АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[168,168,169,398.5,297,398.5], null, null, null]
  ]},
  "28816": {n: "Готварство-без интензивно и без разширено АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[169,175.5,169,405.5,239.5,405.5], null, null, null]
  ]},
  "28807": {n: "Електронна търговия, маркетинг и реклама - РИЧЕ- АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[280.5,280.5,338,434.5,431,434.5], null, null, null]
  ]},
  "28820": {n: "Лозаро-винарство-без интензивно и без разширено АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[110,110,127,178,178,167], null, null, null]
  ]},
  "28809": {n: "Организиране на туристически пътувания - РИЧЕ- АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[261,263,261,424.5,370.5,424.5], null, null, null]
  ]},
  "28811": {n: "Спедиторски услуги - РИЧЕ-АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[195,195,200,329.5,329.5,260], null, null, null]
  ]},
}};
ruoSchools["102007"] = {n: "Техническа гимн.", f: "Професионална техническа гимназия", c: false, p: {
  "3820": {n: "Електродомакинска техника", d: [
    [[44,76,44,143,143,141], [143,143,0,143,143,0], [109,109,135,210,210,207.5], null],
    [[30,30,64,226,226,149], [125,125,0,148,148,0], [48,48,143,143,141,143], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2243": {n: "Машини и системи с цифрово програмно управление (ЦПУ)", d: [
    [[54,54,95,276,173,276], null, [66,66,121,196,155,196], null],
    [[68,88,68,193,193,159], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4751": {n: "Промишлена електроника, РИЧЕ АЕ", d: [
    [null, null, null, null],
    [[58,199.5,58,199.5,199.5,160], null, [356,356,0,356,356,0], null],
    [[77,77,128,261,261,128], [117,117,0,193,193,0], [154,154,165,280,208,280], [193,193,0,217,217,0]],
    [null, null, null, null]
  ]},
  "4868": {n: "Производство на облекло от текстил", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[84,84,94,236,147,236], [145,0,145,236,0,236], [149,149,157,223,149,223], null],
    [null, null, null, null]
  ]},
  "29508": {n: "Автоматизирани системи и технологии в машиностроенето-без интензивно и без разширено АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[54,54,66,190,190,152], null, null, null]
  ]},
  "29503": {n: "Електроснабдяване и електрообзавеждане -без интензивно и без разширено АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,41,76,205,205,196], null, null, null]
  ]},
}};
ruoSchools["104101"] = {n: "ПГ Яне Сандански", f: "ПГ Яне Сандански", c: false, p: {
  "2461": {n: "Математически - М-Инф.-ИИЧЕ-АЕ", d: [
    [[72.5,233.5,72.5,482,399,482], [255.75,255.75,0,255.75,255.75,0], [162.25,197.25,162.25,208.75,208.75,183], null],
    [[362.25,362.25,373,485.25,434.75,485.25], [355.25,0,355.25,357.25,0,357.25], null, null],
    [[163.5,163.5,173,465.25,424.25,465.25], [163.5,163.5,173,260,163.5,260], null, null],
    [[164,197.5,164,455.25,455.25,442.75], null, null, null]
  ]},
  "3002": {n: "Предприемачески - Предприемачество-ИТ-ИИЧЕ-АЕ", d: [
    [[86,86,92,285,167,285], [84,84,95,148,143,148], null, null],
    [[80,80,126,351,351,216.5], [202,202,0,351,351,0], [207,207,0,207,207,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2477": {n: "Софтуерни и хардуерни науки - Инф.-ИТ-ИИЧЕ-АЕ", d: [
    [[130,130,144,342,342,283], [124,124,196,261.5,261.5,196], null, null],
    [[156,156,191,262,260.5,262], [30,30,0,189.5,189.5,0], [198,198,0,198,198,0], null],
    [[205,205,211,409,409,256.5], [217,217,256.5,300.5,300.5,256.5], null, [219,0,219,219,0,219]],
    [null, null, null, null]
  ]},
  "2484": {n: "Чужди езици - АЕ-ИспЕ-ИИЧЕ-АЕ", d: [
    [[222.5,222.5,228,419.25,328.75,419.25], [222.5,222.5,325.5,325.5,222.5,325.5], null, null],
    [[310.25,317.5,310.25,452.25,452.25,431.25], [268,0,268,360.5,0,360.5], null, null],
    [[264,265,264,447.75,368.75,447.75], [277.25,281.5,277.25,301,281.5,301], null, null],
    [[290.5,301,290.5,483.25,483.25,467.25], null, null, null]
  ]},
  "2487": {n: "Чужди езици - АЕ-НЕ-ИИЧЕ-АЕ", d: [
    [[176.25,176.25,196,399.25,399.25,394.75], [179.5,179.5,0,179.5,179.5,0], null, null],
    [[257.25,257.25,262,408.75,408.75,389.5], [241.5,251.75,241.5,388,347,388], null, null],
    [[242.5,242.5,252,432.5,432.5,426.5], [252,282.5,252,297.5,297.5,267.25], null, null],
    [[301.25,301.25,303,475,421.75,475], null, null, null]
  ]},
  "28695": {n: "Графичен дизайн-РИЧЕ-АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[238,253,238,409,339,409], null, null, null]
  ]},
}};
