// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Plovdiv
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["1690450"] = {n: "ЕГ Иван Вазов", f: "ЕГ Иван Вазов", c: false, p: {
  "1816": {n: "Чужди езици АЕ", d: [
    [[384,384,405.5,487,487,472], [384,384,403.5,418.5,384,418.5], [383,0,383,383,0,383], null],
    [[391,391,426,480,470.5,480], [380,380,425,434.5,424.5,434.5], [404.5,0,404.5,404.5,0,404.5], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "1812": {n: "Чужди езици ИспЕ", d: [
    [[369,369,429.5,490,448,490], [365.5,365.5,429,434,434,429], null, null],
    [[388.5,388.5,437,482,482,480], [373.5,373.5,434,434,418,434], [343,343,0,343,343,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "1814": {n: "Чужди езици ИтЕ", d: [
    [[344.5,344.5,401,467.5,455,467.5], [339.5,339.5,399,429,359,429], null, null],
    [[363.5,363.5,414.5,475,460.5,475], [346.5,346.5,410.5,433,371.5,433], [399.5,0,399.5,399.5,0,399.5], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "1821": {n: "Чужди езици НЕ", d: [
    [[361.5,361.5,396.5,479,479,459], [352,352,393,411,383.5,411], null, null],
    [[379,379,416,478.5,474,478.5], [365,365,410.5,439.5,409,439.5], [408.5,0,408.5,408.5,0,408.5], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "1819": {n: "Чужди езици ФЕ", d: [
    [[341.5,341.5,399,483.5,371.5,483.5], [338,338,392.5,418.5,349.5,418.5], [331.5,331.5,0,331.5,331.5,0], null],
    [[350,350,411,470,378.5,470], [343,343,409.5,425,357,425], [333.5,333.5,366.5,366.5,333.5,366.5], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "5032": {n: "Чужди езици /АЕ/", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[392.5,392.5,421,472,463.5,472], [391,391,417.5,448,417.5,448], null, null],
    [[373,373,419,459.5,456,459.5], [370,370,426,434,393,434], null, null]
  ]},
  "5036": {n: "Чужди езици /Исп.Е/", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[399,399,453,489,485,489], [398,398,0,420.5,420.5,0], null, null],
    [[376,376,448.5,494,481.5,494], [367,367,0,376,376,0], null, null]
  ]},
  "5037": {n: "Чужди езици /Италиански език/", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[361.5,361.5,418,472,460.5,472], [360,360,421.5,452,397.5,452], null, null],
    [[334.5,334.5,412.5,446,427,446], [332,332,411.5,446,362,446], null, null]
  ]},
  "5035": {n: "Чужди езици /НЕ/", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[377.5,377.5,413.5,483,457,483], [364.5,364.5,413,426.5,422.5,426.5], null, null],
    [[353.5,353.5,390.5,485.5,470,485.5], [339,339,376,410,389.5,410], null, null]
  ]},
  "5040": {n: "Чужди езици /ФЕ/", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[346,346,411.5,460,371,460], [338,338,405.5,443.5,358.5,443.5], [324.5,324.5,393.5,393.5,324.5,393.5], null],
    [[333,333,396.5,457.5,374.5,457.5], [328,328,364.5,430.5,365.5,430.5], null, null]
  ]},
}};
ruoSchools["1690449"] = {n: "ЕГ Пловдив", f: "ЕГ Пловдив", c: false, p: {
  "579": {n: "Чужди езици АЕ", d: [
    [[374,374,419.5,497.5,495,497.5], [359,359,413.5,426,406.5,426], null, null],
    [[400,400,436,492.5,490,492.5], [394.5,394.5,435,451,451,444], null, null],
    [[403.5,403.5,431.5,483,478,483], [402.5,402.5,424,446,440,446], [373.5,0,373.5,375,0,375], null],
    [[384,384,407.5,477,477,477], [376.5,376.5,404.5,415,415,406], null, null]
  ]},
  "582": {n: "Чужди езици НЕ", d: [
    [[402,402,418,494,491,494], [387,387,0,401,401,0], [347,347,0,347,347,0], null],
    [[413.5,413.5,449,492,492,492], [393,393,448,448,411.5,448], null, null],
    [[423,423,442.5,493,493,491.5], [422.5,422.5,439.5,441.5,436.5,441.5], [382,0,382,382,0,382], null],
    [[396,396,405.5,492,488,492], [375,375,385.5,435.5,395,435.5], null, null]
  ]},
}};
ruoSchools["1690346"] = {n: "МГ Акад. Кирил Попов", f: "МГ Акад. Кирил Попов", c: false, p: {
  "2869": {n: "Компютърна графика AE, Компютърен график", d: [
    [[451.75,458.75,451.75,499.5,485.5,499.5], [447.5,447.5,0,447.5,447.5,0], null, null],
    [[466,470.5,466,497.5,489,497.5], [450.5,450.5,453.5,462.5,450.5,462.5], null, null],
    [[462.25,465,462.25,495.5,476.5,495.5], [458.75,0,458.75,458.75,0,458.75], null, null],
    [null, null, null, null]
  ]},
  "2793": {n: "Математически АЕ", d: [
    [[395,425.75,395,495.5,495.5,495], [389.75,422,389.75,424.5,424.5,395], null, null],
    [[442,450.5,442,499,498.5,499], [436.75,446.75,436.75,449,449,443.5], null, null],
    [[430.5,448.5,430.5,498,497.5,498], [427.5,448,427.5,457.75,457.75,427.5], [345.75,345.75,0,345.75,345.75,0], null],
    [[417.5,448,417.5,496.5,496.5,496], [408.75,427.75,408.75,444.5,444.5,417], null, null]
  ]},
  "2812": {n: "Математически НЕ", d: [
    [[380,413.5,380,494.5,482.25,494.5], [358.25,403.5,358.25,417,417,384.5], [331,0,331,331,0,331], null],
    [[427.25,437.5,427.25,475.75,450.25,475.75], [425.25,427.5,425.25,439.75,439.75,436.25], [331.25,331.25,0,331.25,331.25,0], null],
    [[411.25,431.75,411.25,478.5,478.5,477.5], [387,428.25,387,447.5,447.5,424.75], null, null],
    [[408,413.75,408,491,491,462.75], [375.75,406.5,375.75,420,420,408], null, null]
  ]},
  "2868": {n: "Системно програмиране AE, Системен програмист", d: [
    [[428.5,428.5,430,497,497,495], [424.5,424.5,424.5,430.25,427.75,430.25], null, null],
    [[442,442,450.75,493.5,493.5,484], [439.75,439.75,0,442.75,442.75,0], null, null],
    [[430.5,430.5,439.5,495.5,495.5,472.5], [429.5,429.5,440.25,440.25,430,440.25], [364.25,0,364.25,364.25,0,364.25], null],
    [null, null, null, null]
  ]},
  "29663": {n: "Интелигентни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[436.75,438,436.75,485.75,485.75,484.5], [433.25,433.25,0,433.25,433.25,0], null, null]
  ]},
  "29658": {n: "Компютърна графика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[439.5,452.25,439.5,494,491,494], [437.5,0,437.5,437.5,0,437.5], null, null]
  ]},
  "29666": {n: "Разработка на софтуер", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[422,422,426,477.5,477.5,477.5], [421.25,421.25,426,432.25,432.25,426], null, null]
  ]},
}};
ruoSchools["1690175"] = {n: "Търговска гимназия", f: "Търговска гимназия - Пловдив", c: false, p: {
  "1371": {n: "Банково дело, английски език", d: [
    [[360,360,360.5,436,436,397], [352.5,365.5,352.5,372.5,372.5,371], [378,0,378,378,0,378], [345,0,345,345,0,345]],
    [[375.5,379.5,375.5,454,417,454], [372.5,379.5,372.5,407.5,379.5,407.5], null, null],
    [[382.5,383.5,382.5,466.5,416.5,466.5], [381.5,395.5,381.5,416.5,416.5,415.5], null, null],
    [null, null, null, null]
  ]},
  "3353": {n: "Бизнес - администрация, английски език", d: [
    [[360,373,360,426,404,426], [354.5,357.5,354.5,383,373,383], null, [349.5,349.5,0,349.5,349.5,0]],
    [[383,384,383,452,442.5,452], [374,0,374,404.5,0,404.5], null, null],
    [[382.5,382.5,385.5,443,419,443], [382,386,382,392,386,392], null, null],
    [null, null, null, null]
  ]},
  "3854": {n: "Електронна търговия, английски език", d: [
    [[381,381.5,381,463,439.5,463], [380.5,391.5,380.5,430.5,430.5,380.5], null, null],
    [[389,390,389,463,453.5,463], [383,389,383,421,389,421], null, [329.5,0,329.5,329.5,0,329.5]],
    [[402,402,407,454.5,454,454.5], [402.5,402.5,407,454.5,402.5,454.5], null, null],
    [null, null, null, null]
  ]},
  "1388": {n: "Икономика и мениджмънт, немски език", d: [
    [[389,389.5,389,475,475,459], [381,0,381,398,0,398], null, null],
    [[405,415.5,405,493,468,493], [408.5,0,408.5,420,0,420], null, null],
    [[400.5,402.5,400.5,483.5,465,483.5], [397.5,398.5,397.5,421.5,400,421.5], null, null],
    [null, null, null, null]
  ]},
  "1387": {n: "Икономическа информатика, английски език", d: [
    [[401,401,402,489.5,489.5,444], null, null, null],
    [[409,409,410.5,466.5,465,466.5], [396.5,424,396.5,424,424,405], null, null],
    [[419,419,419.5,457,452.5,457], [419,419,0,425,425,0], null, null],
    [null, null, null, null]
  ]},
  "1377": {n: "Митническа и данъчна администрация, английски език", d: [
    [[373,373.5,373,434.5,431,434.5], [370.5,371.5,370.5,399.5,373,399.5], null, null],
    [[385,389,385,436,428.5,436], [375.5,383.5,375.5,402.5,383.5,402.5], null, null],
    [[391,394,391,462.5,442,462.5], [390.5,390.5,391.5,400.5,400.5,393], null, null],
    [null, null, null, null]
  ]},
  "1380": {n: "Оперативно счетоводство, английски език", d: [
    [[362.5,362.5,363,461,385.5,461], [356,362.5,356,378,378,366.5], null, null],
    [[398.5,398.5,398.5,469,469,469], [394.5,0,394.5,394.5,0,394.5], null, null],
    [[383.5,383.5,384,457.5,398.5,457.5], [379,383.5,379,400,383.5,400], null, null],
    [null, null, null, null]
  ]},
  "3352": {n: "Търговия, испански език", d: [
    [[360.5,360.5,360.5,436,388,436], [355,355,358.5,384.5,379.5,384.5], null, null],
    [[380,382.5,380,459.5,459.5,436], [369.5,376.5,369.5,404,376.5,404], [365,0,365,367,0,367], null],
    [[397.5,398.5,397.5,470.5,428,470.5], [395,414,395,414,414,397], null, null],
    [null, null, null, null]
  ]},
  "28287": {n: "Банково, застрахователно и осигурително дело", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[382,382,384.5,452.5,452.5,414.5], [378,382,378,410.5,407,410.5], null, null]
  ]},
  "28293": {n: "Електронна търговия, маркетинг и реклама", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[424,424,424,479,465,479], null, null, null]
  ]},
  "28292": {n: "Икономическа информатика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[413.5,414,413.5,455,441.5,455], [414,414,414.5,414.5,414,414.5], null, null]
  ]},
  "28294": {n: "Мениджмънт и икономика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[411,411,413.5,478.5,446,478.5], [411,411,0,414,414,0], null, null]
  ]},
  "28289": {n: "Митническо обслужване", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[388,392.5,388,459,459,423], [387,397.5,387,423,403.5,423], null, null]
  ]},
  "28291": {n: "Оперативно счетоводство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[380,393,380,466.5,393,466.5], [377.5,377.5,381.5,409.5,377.5,409.5], null, null]
  ]},
  "28288": {n: "Съдебна администрация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[387,390.5,387,460,423.5,460], [379,390.5,379,423.5,423.5,400.5], null, null]
  ]},
}};
ruoSchools["1690443"] = {n: "ОбУ Й. Йовков", f: "ОбУ Йордан Йовков", c: false, p: {
  "2776": {n: "работник в заведения за хранене и развлечения 3г.", d: [
    [[30,41,30,223,164,223], null, [88,134,88,134,134,88], [230,230,0,230,230,0]],
    [[58,58,65,257,186,257], [48,48,186,186,186,186], [46,46,65,65,46,65], null],
    [[44,46,44,112,112,93], null, null, null],
    [null, null, null, null]
  ]},
  "28538": {n: "ресторантьорство и кетъринг", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[48,48,60,201,163,201], null, null, null]
  ]},
}};
ruoSchools["1690246"] = {n: "ОбУ Пенчо Славейков", f: "ОбУ Пенчо Славейков", c: false, p: {
  "3042": {n: "Производство на мебели", d: [
    [[41,41,0,184,184,0], null, null, null],
    [[41,41,45,247,247,105], [30,30,0,30,30,0], null, null],
    [[61,61,0,144,144,0], null, null, null],
    [null, null, null, null]
  ]},
  "3041": {n: "Шивачество", d: [
    [[34,0,34,172,0,172], null, null, null],
    [[48,0,48,145,0,145], null, null, null],
    [[41,41,41,126,41,126], null, null, null],
    [null, null, null, null]
  ]},
  "4259": {n: "Шлосерство", d: [
    [[49,49,0,129,129,0], null, null, null],
    [[34,34,40,133,133,41], null, null, null],
    [[49,49,0,108,108,0], null, null, null],
    [null, null, null, null]
  ]},
  "28540": {n: "Автоматизирани системи и технологии в машиностроенето", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[56,56,0,84,84,0], null, null, null]
  ]},
  "28537": {n: "Мебелно производство и реставрация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[75,75,0,106,106,0], null, null, null]
  ]},
  "28530": {n: "Устойчива мода", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,0,41,122,0,122], null, null, null]
  ]},
}};
ruoSchools["1690272"] = {n: "ПГ по арх., строит. и геод.", f: "ПГ по архитектура строителство и геодезия", c: false, p: {
  "666": {n: "Архитектурна реставрация АЕ", d: [
    [[279.5,279.5,281.25,394.5,394.5,329], [274.75,274.75,275,306,286.5,306], [291.25,291.25,0,291.25,291.25,0], null],
    [[304.25,304.25,305,386.25,386.25,339], [296.5,296.5,301,339,332.5,339], [362,0,362,362,0,362], null],
    [[313.25,313.25,313.25,435.25,361,435.25], [310.25,313.5,310.25,342.25,341.5,342.25], null, null],
    [null, null, null, null]
  ]},
  "651": {n: "Водно строителство АЕ", d: [
    [[251.75,251.75,256.5,307.25,307.25,281.5], [248.25,248.25,249.75,282.5,282.5,281.5], [270.5,270.5,0,270.5,270.5,0], [293.75,293.75,0,293.75,293.75,0]],
    [[268.75,268.75,279.75,373.75,373.75,346.75], [266.25,266.25,280.5,373.75,373.75,341], null, null],
    [[255,255,259.25,395.5,328.75,395.5], [245,245,259.25,328.75,328.75,309.25], null, null],
    [[262.5,262.5,263.5,352.75,339,352.75], [249.75,252.5,249.75,339,339,290.75], null, null]
  ]},
  "656": {n: "Геодезия АЕ", d: [
    [[298.5,299.5,298.5,359.5,350.25,359.5], [294,294,318,318,311,318], [308,0,308,308,0,308], null],
    [[346.75,346.75,347.5,444.25,414.75,444.25], [342.5,342.75,342.5,363.25,357.5,363.25], null, null],
    [[325.25,325.25,327.5,444.75,422,444.75], [320.25,320.25,324.5,360.25,328.25,360.25], [336,0,336,336,0,336], null],
    [[325.5,327,325.5,426.25,426.25,357.25], [325.5,362.25,325.5,362.25,362.25,337.75], null, null]
  ]},
  "678": {n: "Недвижими имоти АЕ", d: [
    [[285.5,285.5,289.75,392,325,392], [276.75,277,276.75,325,325,324.25], [293.25,293.25,0,293.25,293.25,0], null],
    [[303,303,306.25,382.5,351,382.5], [296.75,296.75,297.25,382.5,351,382.5], [310,0,310,365,0,365], null],
    [[284.25,286.75,284.25,368,352.5,368], [281,281,285.5,368,352.5,368], [349.75,0,349.75,349.75,0,349.75], null],
    [null, null, null, null]
  ]},
  "662": {n: "Парково строителство и озеленяване АЕ", d: [
    [[256,258.75,256,350,295.5,350], [253.5,255.25,253.5,308.25,270.75,308.25], [260.5,260.5,263.75,283,262,283], [281.5,0,281.5,281.5,0,281.5]],
    [[269.5,269.5,271.5,349.75,349.75,348.75], [259.25,259.25,273.25,348.75,338.5,348.75], [333,333,0,342.5,342.5,0], null],
    [[248.25,248.25,256,353.75,353.75,346], [236.5,236.5,246,353.75,353.75,307], null, null],
    [null, null, null, null]
  ]},
  "637": {n: "Строителство и архитектура АЕ", d: [
    [[350.25,350.25,354.75,457,454.5,457], [333.5,334,333.5,334,334,333.5], null, null],
    [[381,381,381.5,477.25,455.25,477.25], [377.25,377.25,400.75,400.75,377.25,400.75], null, null],
    [[395.5,395.5,405.25,483,442.5,483], [383.25,383.25,395.5,395.5,383.25,395.5], null, null],
    [[381,381,381.5,455.5,438.5,455.5], [417.25,0,417.25,417.25,0,417.25], null, null]
  ]},
  "645": {n: "Строителство и архитектура НЕ", d: [
    [[313,313.5,313,459.5,432,459.5], [304.5,304.5,305,331.5,318,331.5], [350.5,350.5,0,350.5,350.5,0], [306,0,306,306,0,306]],
    [[357.75,357.75,359,444.25,434.25,444.25], null, null, null],
    [[351.75,353.5,351.75,447,447,395], [342.75,343,342.75,380,343,380], [377.25,0,377.25,377.25,0,377.25], [346.75,0,346.75,346.75,0,346.75]],
    [[353.25,353.25,355.5,448.75,448.75,409], [342,342,347.5,377.5,377.5,371.5], null, null]
  ]},
  "658": {n: "Транспортно строителство АЕ", d: [
    [[238.75,238.75,240.75,296.75,286.75,296.75], [237,237,257.75,281.25,258.75,281.25], [237,0,237,237,0,237], [312.5,0,312.5,312.5,0,312.5]],
    [[263.25,263.25,330.5,379.75,339.5,379.75], [256.5,259,256.5,339.5,339.5,330.5], null, null],
    [[242,242,266.75,377.25,325.5,377.25], [232.5,232.5,266.75,377.25,310.25,377.25], [299,299,0,327.75,327.75,0], null],
    [[249.75,252.5,249.75,348.25,318,348.25], [240.25,240.25,281,318,318,281], null, null]
  ]},
  "28780": {n: "Експлоатация и сделки с недвижими имоти АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[274.75,274.75,275,371,327.5,371], [264.5,266.75,264.5,329,327.5,329], null, null]
  ]},
  "28776": {n: "Парково строителство АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[264,264,264.5,350,320,350], [239.75,243.25,239.75,324.5,311.5,324.5], null, null]
  ]},
  "28778": {n: "Реставрация на недвижимо културно наследство АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[294.75,295.25,294.75,366.75,345,366.75], [291,291,307.25,328.5,328.5,320.75], null, null]
  ]},
}};
ruoSchools["1690179"] = {n: "ПГ по битова техника", f: "ПГ по битова техника", c: false, p: {
  "428": {n: "Електрически инсталации АЕ", d: [
    [[222.5,222.5,0,326,326,0], [186.5,186.5,0,284,284,0], [281.5,281.5,0,281.5,281.5,0], null],
    [[215.5,215.5,0,329,329,0], [211,211,0,329,329,0], [253,253,0,253,253,0], [252,252,0,252,252,0]],
    [[210,210,0,334.5,334.5,0], [176,176,0,249,249,0], null, null],
    [null, null, null, null]
  ]},
  "429": {n: "Електрообзавеждане на подемна и асансьорна техника АЕ", d: [
    [[183.5,183.5,0,261,261,0], [168.5,168.5,0,261,261,0], [259,259,0,273,273,0], [258,258,0,258,258,0]],
    [[154.5,154.5,0,264,264,0], [151,151,0,258,258,0], [236,236,0,242.5,242.5,0], [245.5,245.5,0,250,250,0]],
    [[76,76,0,356.5,356.5,0], [167,167,0,213,213,0], [169,169,0,308.5,308.5,0], null],
    [null, null, null, null]
  ]},
  "426": {n: "Компютърна техника и технологии АЕ", d: [
    [[240.5,240.5,276.5,333.5,317.5,333.5], [228,228,0,287,287,0], [280,280,0,296,296,0], [285.5,285.5,0,285.5,285.5,0]],
    [[259.5,259.5,0,338.5,338.5,0], [246.5,246.5,0,311,311,0], [272.5,272.5,0,272.5,272.5,0], null],
    [[262.5,262.5,0,336,336,0], [244,249,244,329,329,244], [317,317,0,317,317,0], null],
    [null, null, null, null]
  ]},
  "425": {n: "Компютърни мрежи АЕ", d: [
    [[249.5,249.5,270.5,316.5,316.5,270.5], [230,230,270.5,316.5,316.5,270.5], [291.5,291.5,0,291.5,291.5,0], null],
    [[250,250,282.5,338.5,338.5,296.5], [244.5,244.5,282.5,338.5,338.5,288.5], [291.5,291.5,0,291.5,291.5,0], null],
    [[234,234,0,323,323,0], [210,210,0,316,316,0], [311,311,0,314.5,314.5,0], null],
    [null, null, null, null]
  ]},
  "427": {n: "Оптически комуникационни системи АЕ", d: [
    [[217,217,0,240,240,0], [192,192,0,227,227,0], null, null],
    [[193,193,205,272.5,272.5,205], [176,176,205,241.5,241.5,205], [240.5,250,240.5,252.5,252.5,240.5], [294,294,0,294,294,0]],
    [[102,102,0,252.5,252.5,0], [128,128,0,252.5,252.5,0], [126,126,0,302,302,0], [132,132,0,273,273,0]],
    [null, null, null, null]
  ]},
  "28174": {n: "Асансьорна техника и съоръжения", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[151,151,0,280.5,280.5,0], [91,91,0,196,196,0], null, null]
  ]},
  "28159": {n: "Електрически инсталации, АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[207,207,0,307.5,307.5,0], [206,206,0,299,299,0], null, null]
  ]},
  "28121": {n: "Киберсигурност, АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[240,240,0,366.5,366.5,0], [237,237,0,317,317,0], null, null]
  ]},
  "28161": {n: "Компютърни системи и технологии, АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[249,249,279,342,342,279], [230,230,237,297,297,237], null, null]
  ]},
  "28166": {n: "Комуникационни и компютърни мрежи, АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[204,204,237,340.5,340.5,237], [171,171,0,340.5,340.5,0], null, null]
  ]},
}};
ruoSchools["1690177"] = {n: "ПГ по вътр. арх. и дърв.", f: "ПГ по вътрешна архитектура и дървообработване", c: false, p: {
  "294": {n: "Интериорен дизайн - разширено изучаване на АЕ", d: [
    [[279.5,279.5,283.5,376,309.5,376], [273,273,275,324,308.5,324], [288,301.5,288,301.5,301.5,288], null],
    [[277,277,282,437,419,437], [266.5,266.5,272,358.5,285.5,358.5], [339.5,0,339.5,339.5,0,339.5], null],
    [[286,286,292,399.5,330,399.5], [274.5,274.5,277,338.5,311.5,338.5], [329,0,329,350.5,0,350.5], null],
    [null, null, null, null]
  ]},
  "310": {n: "Мебелно производство, дуална форма на обучение", d: [
    [[238,238,255.5,401,401,255.5], [169,169,190,265.5,265.5,255.5], [278,278,0,278,278,0], null],
    [[219,219,223,307.5,307.5,262], [216.5,216.5,223,297,297,262], null, null],
    [[213,213,0,356,356,0], [208,208,0,254,254,0], null, null],
    [null, null, null, null]
  ]},
  "4225": {n: "Мебелно производство", d: [
    [[183,183,0,275.5,275.5,0], [171,171,0,275.5,275.5,0], null, null],
    [null, null, null, null],
    [[201,201,0,292,292,0], [193,193,0,292,292,0], null, null],
    [null, null, null, null]
  ]},
  "313": {n: "Полиграфия - разширено изучаване на АЕ", d: [
    [[183,183,189,279,248,279], [107,107,237,268,248,268], [246,248.5,246,248.5,248.5,247], [250,250,0,257,257,0]],
    [[208,219,208,291,291,258], [193,193,199.5,259,259,257.5], [250.5,250.5,0,250.5,250.5,0], null],
    [[218,224,218,270,267,270], [215,234.5,215,267,267,227.5], null, null],
    [null, null, null, null]
  ]},
  "318": {n: "Реставрация на стилни мебели и дограма", d: [
    [[183,183,236.5,283.5,273.5,283.5], [155,155,258,258,257,258], null, null],
    [null, null, null, null],
    [[169,169,210,338.5,338.5,286], [126,126,210,286,219,286], [168,168,185.5,238,238,185.5], [340,340,0,340,340,0]],
    [null, null, null, null]
  ]},
  "4227": {n: "Производство на тапицирани изделия, дуална форма на обучение", d: [
    [[157.5,157.5,170.5,267,259,267], [156,156,267,267,259,267], [257.5,257.5,0,257.5,257.5,0], null],
    [[151,151,194.5,252.5,252.5,229], [146,146,194.5,206.5,206.5,194.5], [272,272,0,272,272,0], null],
    [[92,92,0,325.5,325.5,0], [151,151,0,325.5,325.5,0], [188,188,0,188,188,0], null],
    [null, null, null, null]
  ]},
  "4626": {n: "Дърворезбарство", d: [
    [null, null, null, null],
    [[156,156,0,219.5,219.5,0], [149,149,0,216,216,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4628": {n: "Полиграфия, дуална форма на обучение - разширено изучаване на АЕ", d: [
    [null, null, null, null],
    [[176.5,176.5,233,325,239.5,325], [235,235,250,325,235,325], [264,264,0,264,264,0], null],
    [[0,193.5,200,285,285,271], [184,184,0,265.5,265.5,0], null, null],
    [null, null, null, null]
  ]},
  "29452": {n: "Дигитално проектиране на мебели и интериор, дневна форма на обучение, разширено изучаване на АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[207,207,214,275,275,252], [162,181.5,162,275,275,162], null, null]
  ]},
  "29446": {n: "Интериорен и екстериорен дизайн, дневна форма на обучение, разширено изучаване на АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[235,235,242,398,398,391], [232.5,232.5,233,321,321,244], null, null]
  ]},
  "29454": {n: "Мебелно производство и реставрация, дневна форма на обучение, разширено изучаване на АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[139,139,0,214,214,0], [118,118,0,214,214,0], null, null]
  ]},
  "29457": {n: "Мебелно производство и реставрация, дуална форма на обучение", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[186,189,186,272.5,272.5,186], [176,176,0,272.5,272.5,0], null, null]
  ]},
  "29461": {n: "Полиграфия, дневна форма на обучение, разширено изучаване на АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[85,85,162,297,297,265.5], [153,153,0,297,297,0], null, null]
  ]},
  "29464": {n: "Полиграфия, дуална форма на обучение", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[61,61,193,296.5,296.5,220], [296.5,296.5,0,296.5,296.5,0], null, null]
  ]},
  "29458": {n: "Проектиране и производство на тапицирани мебели, дуална форма на обучение", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[107,107,0,205.5,205.5,0], [156,156,0,156,156,0], null, null]
  ]},
}};
ruoSchools["1690174"] = {n: "ПГ по електрот. и електрон.", f: "ПГ по електротехника и електроника", c: false, p: {
  "1941": {n: "Автоматизация на непрекъснати производства - дуална, с английски език", d: [
    [[277.5,277.5,0,315.5,315.5,0], [274,274,0,293,293,0], [295,295,0,295,295,0], null],
    [[279,279,0,463.5,463.5,0], [274,274,0,295,295,0], null, null],
    [[292,292,295,408.5,408.5,309.5], [280.5,280.5,0,288.5,288.5,0], null, null],
    [null, null, null, null]
  ]},
  "1948": {n: "Електрообзавеждане на производството с английски език", d: [
    [[279.5,279.5,0,357,357,0], [277,277,0,317,317,0], null, null],
    [[291,291,0,428,428,0], [283.5,283.5,0,360,360,0], null, null],
    [[296.5,296.5,0,417.5,417.5,0], [288,288,0,385.5,385.5,0], null, null],
    [null, null, null, null]
  ]},
  "1897": {n: "Компютърна техника и технологии с английски език", d: [
    [[337,337,338,419.5,419.5,338], [332.5,332.5,338,361.5,361.5,338], null, null],
    [[331.5,331.5,346.5,438.5,438.5,366.5], [329,329,0,374,374,0], null, null],
    [[340.5,340.5,342.5,434.5,434.5,342.5], [326,326,0,397.5,397.5,0], null, null],
    [null, null, null, null]
  ]},
  "1898": {n: "Компютърни мрежи с английски език", d: [
    [[315.5,315.5,334,343,343,334], [315,315,0,338.5,338.5,0], null, null],
    [[310,310,315.5,354,354,331.5], [305.5,305.5,315.5,317.5,317.5,315.5], [463.5,463.5,0,463.5,463.5,0], [314.5,314.5,0,314.5,314.5,0]],
    [[318.5,318.5,343.5,420,420,343.5], [311.5,311.5,0,349.5,349.5,0], null, null],
    [null, null, null, null]
  ]},
  "2051": {n: "Микропроцесорна техника - дуална, с английски език", d: [
    [[306.5,306.5,317.5,472,472,317.5], [306,312,306,316.5,316.5,306], null, null],
    [[296.5,297,296.5,472,472,366.5], [293,293,296.5,366.5,348,366.5], null, null],
    [[313,313,335.5,483,483,335.5], [309,309,335.5,335.5,321.5,335.5], null, null],
    [null, null, null, null]
  ]},
  "1905": {n: "Микропроцесорна техника с английски език", d: [
    [[305,305,306,429.5,429.5,306], [301,301,0,323,323,0], null, null],
    [[294.5,294.5,294.5,426,426,294.5], [286.5,286.5,294.5,346.5,346.5,294.5], null, null],
    [[300,300,315,438,438,315], [288.5,288.5,295,320.5,320.5,295], [352,352,0,352,352,0], null],
    [null, null, null, null]
  ]},
  "1877": {n: "Приложно програмиране с английски език", d: [
    [[349.5,349.5,387.5,458.5,458.5,426.5], [340.5,340.5,387.5,409.5,409.5,387.5], [333.5,0,333.5,333.5,0,333.5], null],
    [[353.5,353.5,389,456.5,456.5,448], [363,363,0,431,431,0], null, null],
    [[345.5,345.5,383.5,444,444,413], [337,337,342.5,425,425,396], [376,376,0,376,376,0], null],
    [null, null, null, null]
  ]},
  "29601": {n: "Автоматизация и управляваща техника с английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[294,294,0,416.5,416.5,0], [288,288,0,416.5,416.5,0], null, null]
  ]},
  "29604": {n: "Електроснабдяване и електрообзавеждане с английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[318,318,0,410,410,0], [344,344,0,344,344,0], null, null]
  ]},
  "29578": {n: "Компютърни системи и технологии с английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[339.5,339.5,357,448.5,448.5,414.5], [334.5,334.5,0,397,397,0], null, null]
  ]},
  "29585": {n: "Комуникационни и компютърни мрежи с английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[309,309,0,385,385,0], [292,292,0,316,316,0], null, null]
  ]},
  "29596": {n: "Микропроцесорни системи - дуална, с английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[333,333,0,425,425,0], [325,325,0,387,387,0], null, null]
  ]},
  "29592": {n: "Микропроцесорни системи с английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[305,305,373.5,447.5,447.5,373.5], [294,294,0,407,407,0], null, null]
  ]},
  "29573": {n: "Разработка на софтуер с английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[340,340,353,451,451,376.5], [316.5,316.5,366.5,412,412,376.5], null, null]
  ]},
}};
ruoSchools["1690473"] = {n: "ПГ по кожени изедлия", f: "ПГ по кожени изделия и текстил Д-р Иван Богоров", c: false, p: {
  "1280": {n: "Конструиране, моделиране и технология на кожено- галантерийни изделия", d: [
    [[30,30,30,145.5,94,145.5], null, [54,60,54,158.5,158.5,73], null],
    [[54,60.5,54,180,90,180], null, [83,0,83,173,0,173], [207.25,0,207.25,275.5,0,275.5]],
    [[41,41,60,189,51,189], null, [145,145,204,204,145,204], null],
    [null, null, null, null]
  ]},
  "1264": {n: "Конструиране, моделиране и технология на обувни изделия", d: [
    [[68,71,68,111,111,82], null, [260,0,260,260,0,260], [187,187,0,187,187,0]],
    [null, null, null, null],
    [[30,30,0,223.5,223.5,0], null, null, null],
    [null, null, null, null]
  ]},
  "1270": {n: "Производство на облекло от текстил", d: [
    [[30,30,30,204,110,204], null, [107,0,107,107,0,107], [30,0,30,222,0,222]],
    [[30,68,30,139.25,139.25,126], [30,139.25,30,139.25,139.25,30], [109,109,0,120,120,0], [30,45,30,100,45,100]],
    [[30,30,52,293,115,293], [52,0,52,52,0,52], [120,212,120,212,212,120], [52,52,92,111,52,111]],
    [null, null, null, null]
  ]},
  "1261": {n: "Фризьорство", d: [
    [[69.5,69.5,70,282,169.25,282], [60,0,60,282,0,282], [183,0,183,252.75,0,252.75], null],
    [[61,61,62,274.5,274.5,188], [229.25,229.25,0,229.25,229.25,0], [155,155,0,155,155,0], null],
    [[59,59,59,262,101,262], [56,56,0,56,56,0], null, null],
    [[81,81,84,278.5,123.5,278.5], null, null, null]
  ]},
  "4511": {n: "Художествена тъкан", d: [
    [null, null, null, null],
    [[41,41,78,156,88,156], null, [257,0,257,273.75,0,273.75], null],
    [[42,42,100,223,164,223], [100,0,100,100,0,100], null, [86,86,0,86,86,0]],
    [null, null, null, null]
  ]},
  "29033": {n: "Производство на модни аксесоари", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,41,73,171,163,171], [171,0,171,171,0,171], null, null]
  ]},
  "29021": {n: "Устойчива мода", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,60,41,113,99,113], null, null, null]
  ]},
}};
ruoSchools["1690573"] = {n: "ПГ по машиностроене", f: "ПГ по машиностроене", c: false, p: {
  "3272": {n: "Електрически превозни средства", d: [
    [[41,41,0,251.5,251.5,0], [41,41,0,235.5,235.5,0], [74,74,0,150,150,0], null],
    [[58,58,0,246.5,246.5,0], [82,82,0,246.5,246.5,0], [115,115,124,168,168,124], null],
    [[79,79,0,287.5,287.5,0], null, [71,96,71,196,196,71], [71,0,71,71,0,71]],
    [null, null, null, null]
  ]},
  "2809": {n: "Подемно - транспортна техника монтирана на ПТС", d: [
    [[38,38,0,99,99,0], null, [82,82,0,102,102,0], null],
    [[73,73,0,390,390,0], [180,180,0,180,180,0], null, null],
    [[106,106,0,171,171,0], null, null, null],
    [null, null, null, null]
  ]},
  "2808": {n: "Пътностроителна техника", d: [
    [[30,30,82,226,226,82], [110.5,110.5,0,110.5,110.5,0], null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[46,46,0,122,122,0], [50,50,0,50,50,0], null, null]
  ]},
  "4352": {n: "Технология на машиностроенето", d: [
    [[50,50,0,157,157,0], [119,119,0,157,157,0], null, [119,119,0,119,119,0]],
    [[78,78,0,218.5,218.5,0], null, null, null],
    [[54,54,0,197,197,0], null, null, null],
    [null, null, null, null]
  ]},
  "5010": {n: "Пътно - строителна техника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[54,54,138,195,195,138], null, [88,88,0,91,91,0], null],
    [null, null, null, null]
  ]},
  "30066": {n: "Подемно-транспортна техника, монтирана на ПТС", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[147,147,0,170,170,0], null, null, null]
  ]},
  "30067": {n: "Технологии на метални продукти и изделия", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[40,40,0,40,40,0], null, null, null]
  ]},
  "30065": {n: "Хибридни и електрически пътни превозни средства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[38,38,0,78,78,0], null, null, null]
  ]},
}};
ruoSchools["1690572"] = {n: "ПГ по механотехника", f: "ПГ по механотехника", c: false, p: {
  "2705": {n: "Автомобилна мехатроника", d: [
    [[203,203,0,393.5,393.5,0], [195.5,195.5,0,274,274,0], [233,233,0,233,233,0], null],
    [[185.5,185.5,0,278.5,278.5,0], [170,170,0,250.5,250.5,0], [164,164,0,276.5,276.5,0], null],
    [[181.5,181.5,0,346.5,346.5,0], [179,179,0,179,179,0], null, null],
    [null, null, null, null]
  ]},
  "2704": {n: "Автотранспортна техника", d: [
    [[140,140,0,244,244,0], [92,92,0,185,185,0], null, null],
    [[108,108,0,265.5,265.5,0], [56,56,0,265.5,265.5,0], [132,132,0,161,161,0], [198.5,198.5,0,198.5,198.5,0]],
    [[30,30,0,248,248,0], [103,103,0,158,158,0], [30,30,0,214,214,0], null],
    [null, null, null, null]
  ]},
  "2701": {n: "Машини и системи с ЦПУ", d: [
    [[102,102,116.5,204,204,116.5], [82,82,0,193,193,0], [166,166,0,166,166,0], null],
    [[84,84,0,256,256,0], [132,132,0,132,132,0], [141.5,141.5,0,233,233,0], [97,97,0,190.5,190.5,0]],
    [[119,119,0,315,315,0], null, null, null],
    [null, null, null, null]
  ]},
  "2702": {n: "Мехатроника", d: [
    [[166,166,0,324.5,324.5,0], [126,126,0,271,271,0], [262.5,262.5,0,262.5,262.5,0], null],
    [[111,111,0,261,261,0], [93,93,0,260.5,260.5,0], [175,175,0,175,175,0], [102.5,102.5,0,144,144,0]],
    [[119,119,0,269,269,0], [138,138,0,269,269,0], [124,124,0,182,182,0], null],
    [null, null, null, null]
  ]},
  "2700": {n: "Приложно програмиране", d: [
    [[235,235,323,323,293.5,323], [217.5,217.5,0,287,287,0], [252,252,0,319.5,319.5,0], [265.5,265.5,0,265.5,265.5,0]],
    [[198,198,0,337.5,337.5,0], [178,178,0,337.5,337.5,0], [198.5,198.5,0,246.5,246.5,0], [266,266,0,266,266,0]],
    [[160,160,0,354.5,354.5,0], [160,160,0,354.5,354.5,0], [138,138,0,254,254,0], [254,254,0,254,254,0]],
    [null, null, null, null]
  ]},
  "2697": {n: "Програмно осигуряване", d: [
    [[176,176,209,303.5,277.5,303.5], [162,162,209,299,261,299], [215,215,230.5,242.5,242.5,230.5], [240,240,0,240,240,0]],
    [[76,76,0,237,237,0], [105,105,0,216,216,0], [164,164,0,190.5,190.5,0], null],
    [[84,84,151.5,254,254,176], [151.5,195.5,151.5,254,254,151.5], null, [134,134,0,134,134,0]],
    [null, null, null, null]
  ]},
  "4380": {n: "Ремонт на летателни апарати", d: [
    [[100,100,264,288,288,264], [87,87,264,264,264,264], [169,169,0,258.5,258.5,0], null],
    [[30,30,0,317.5,317.5,0], [221.5,221.5,0,279,279,0], [137.5,137.5,0,166,166,0], [177,177,0,236.5,236.5,0]],
    [[78,78,358,358,258,358], [131,131,0,131,131,0], [100,100,0,170,170,0], null],
    [null, null, null, null]
  ]},
  "29746": {n: "Автоматизирани системи и технологии в машиностроенето", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[130,130,0,268,268,0], [130,130,0,268,268,0], null, null]
  ]},
  "29749": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[191,196,191,331,331,191], [168,168,191,258,258,191], null, null]
  ]},
  "29752": {n: "Експлоатация и техническо обслужване на въздухоплавателни средства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[175,175,0,310.5,310.5,0], [263,263,0,310.5,310.5,0], null, null]
  ]},
  "29747": {n: "Индустриална мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[133,133,0,234.5,234.5,0], null, null, null]
  ]},
  "29731": {n: "Интелигентни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[120,120,0,295,295,0], [200,200,0,252,252,0], null, null]
  ]},
  "29750": {n: "Хибридни и електрически пътни превозни средства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[108,108,0,351,351,0], [111,111,0,288.5,288.5,0], null, null]
  ]},
}};
ruoSchools["1690176"] = {n: "ПГ по облекло", f: "ПГ по облекло Ана Май", c: false, p: {
  "2858": {n: "Моден дизайн", d: [
    [[132,133,132,366.75,162,366.75], [95,95,128.5,254,128,254], [243,0,243,263.75,0,263.75], null],
    [[198,0,198,337.25,0,337.25], [114.5,114.5,163.5,323.25,114.5,323.25], [204.5,0,204.5,265,0,265], null],
    [[182,258.25,182,308.25,258.25,308.25], [182,0,182,308.25,0,308.25], null, null],
    [null, null, null, null]
  ]},
  "3488": {n: "Фотография", d: [
    [[207.75,0,207.75,380.25,0,380.25], [92,92,123,380.25,92,380.25], [130.5,130.5,143,293.5,194.5,293.5], [297,0,297,297,0,297]],
    [[219,240.75,219,334.5,259.75,334.5], [240.75,240.75,287.5,308.5,259.75,308.5], null, null],
    [[107,107,139,340.5,283.5,340.5], [201,201,340.5,340.5,253,340.5], [223.5,223.5,0,223.5,223.5,0], null],
    [[52,52,76,345,52,345], null, null, null]
  ]},
  "2861": {n: "Козметика", d: [
    [[130,256.5,130,312,256.5,312], [75,0,75,312,0,312], [278,0,278,362.5,0,362.5], null],
    [[88,0,88,365.25,0,365.25], null, [139,0,139,260.5,0,260.5], [208,0,208,265,0,265]],
    [[182,0,182,352.25,0,352.25], [151.5,0,151.5,352.25,0,352.25], null, null],
    [null, null, null, null]
  ]},
  "3847": {n: "Маникюр, педикюр и ноктопластика", d: [
    [[154,0,154,339,0,339], [54,0,54,251.5,0,251.5], [116,0,116,116,0,116], null],
    [[54,0,54,297.5,0,297.5], [159.5,0,159.5,278.25,0,278.25], null, [188,188,0,188,188,0]],
    [[174,0,174,324.5,0,324.5], null, [54,0,54,54,0,54], null],
    [[111,0,111,301.5,0,301.5], [236.5,0,236.5,236.5,0,236.5], null, null]
  ]},
  "2867": {n: "Фризьорство", d: [
    [[199,199,199.5,367,229,367], [166,166,188,367,199,367], [167,0,167,222,0,222], [295.5,0,295.5,295.5,0,295.5]],
    [[170.5,170.5,173,398.75,285.75,398.75], [166,166,168,168,166,168], null, null],
    [[101,125,101,299.5,286.5,299.5], null, [65,65,0,65,65,0], null],
    [[124,127,124,275,174,275], [95,95,0,95,95,0], null, null]
  ]},
  "4614": {n: "Моден дизайн - дуална", d: [
    [null, null, null, null],
    [[145,145,157.75,296,217.5,296], null, [128,128,0,143,143,0], [213.5,0,213.5,257,0,257]],
    [[30,0,30,329.5,0,329.5], [319.5,0,319.5,319.5,0,319.5], [319.5,0,319.5,319.5,0,319.5], null],
    [[76,0,76,195,0,195], null, null, null]
  ]},
  "30059": {n: "Козметични услуги", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[140.5,0,140.5,295.5,0,295.5], [176,0,176,236.5,0,236.5], null, null]
  ]},
  "30055": {n: "Моден дизайн - дневна", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[92,122,92,306,122,306], null, null, null]
  ]},
  "30051": {n: "Устойчива мода", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[144,0,144,264,0,264], null, null, null]
  ]},
}};
ruoSchools["1690273"] = {n: "ПГ по трансп. и стр. техн.", f: "ПГ по транспорт и строителни технологии", c: false, p: {
  "1707": {n: "Монтьор на транспортна техника Автотранспортна техника", d: [
    [[63,63,0,276,276,0], [97,97,0,266.5,266.5,0], [118,118,0,182,182,0], [187,187,0,187,187,0]],
    [[30,30,0,258,258,0], [107.5,107.5,0,221.5,221.5,0], [82,82,0,168,168,0], null],
    [[50,50,0,276,276,0], null, [215,215,0,215,215,0], null],
    [null, null, null, null]
  ]},
  "1709": {n: "Спедитор - логистик Спедиция транспортна и складова логистика АЕ", d: [
    [[88,88,91,266,256,266], [154,154,166,249.5,249.5,199], [152,152,0,170,170,0], [152,152,0,156,156,0]],
    [[128,135,128,248,248,153], [162.5,162.5,0,162.5,162.5,0], [128,141.5,128,162.5,162.5,153], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3943": {n: "Техник по транспортна техника/ Автомобилна мехатроника", d: [
    [[59,59,0,284,284,0], [284,284,0,284,284,0], [93,93,0,210.5,210.5,0], [191.5,191.5,0,191.5,191.5,0]],
    [[80,80,0,390,390,0], [195.5,195.5,0,218.5,218.5,0], [133,133,0,236,236,0], null],
    [[140,140,171,284,284,171], null, [196.5,196.5,0,196.5,196.5,0], null],
    [null, null, null, null]
  ]},
  "1697": {n: "Техник по транспортна техника Автотранспортна техника", d: [
    [[30,30,139,263,263,164.5], [30,30,164.5,263,263,164.5], [127,127,0,199.5,199.5,0], [134,134,0,164,164,0]],
    [[86,86,0,255,255,0], [187,187,0,219.5,219.5,0], [191,191,0,223,223,0], [167.5,167.5,0,167.5,167.5,0]],
    [[68,68,0,154,154,0], [64,64,0,64,64,0], null, null],
    [null, null, null, null]
  ]},
  "3548": {n: "Техник по транспортна техника / Електрически превозни средства", d: [
    [[30,30,0,239.5,239.5,0], [154,154,0,207,207,0], [124,124,0,242,242,0], [150,150,0,237,237,0]],
    [[67,67,0,279,279,0], [120,120,0,141,141,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4838": {n: "Електромонтьор, Електрообзавеждане на транспортна техника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[54,54,0,272,272,0], null, [56,56,0,122,122,0], null],
    [null, null, null, null]
  ]},
  "4837": {n: "Електротехник, Електрообзавеждане на транспортна техника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[66,66,0,211,211,0], null, null, null],
    [null, null, null, null]
  ]},
  "4839": {n: "Строител - монтажник, Метални конструкции", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[56,56,0,58,58,0], null, null, null],
    [null, null, null, null]
  ]},
  "29168": {n: "Автомобилна техника и мехатроника, трета СПК", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[116,116,0,267.5,267.5,0], [105,105,0,253,253,0], null, null]
  ]},
  "29177": {n: "Спедиторски услуги, трета СПК", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,65,30,148.5,148.5,132], [39,0,39,39,0,39], null, null]
  ]},
  "30003": {n: "Строителство, Строителство и архитектура, трета СПК", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,0,281,281,0], [192,192,0,234,234,0], null, null]
  ]},
  "29173": {n: "Хибридни и електрически пътни превозни средства, трета СПК", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,0,260.5,260.5,0], null, null, null]
  ]},
}};
ruoSchools["1690178"] = {n: "ПГ по туризъм", f: "ПГ по туризъм Проф д-р Асен Златаров", c: false, p: {
  "124": {n: "Кетъринг АЕ", d: [
    [[257,258,257,391,391,312.5], [253.5,257,253.5,266.5,266.5,264.5], [295.5,0,295.5,295.5,0,295.5], null],
    [[255.5,259,255.5,311,311,293.5], [239,239,245.5,266,261,266], null, null],
    [[234,234,234,343.5,309,343.5], [225,225,225,343.5,233.5,343.5], [330,0,330,330,0,330], [252,0,252,252,0,252]],
    [null, null, null, null]
  ]},
  "122": {n: "Кетъринг НЕ", d: [
    [[225.5,226.5,225.5,313,313,306], [220.5,221.5,220.5,253,253,252], [276.5,276.5,0,276.5,276.5,0], [256,0,256,256,0,256]],
    [[223.5,227,223.5,363.5,363.5,283], [219,219,221,363.5,363.5,238.5], [276,0,276,276,0,276], null],
    [[215,218,215,388.5,346.5,388.5], [198,198,208.5,388.5,346.5,388.5], [313.5,0,313.5,313.5,0,313.5], null],
    [null, null, null, null]
  ]},
  "125": {n: "Организация на туризма и свободното време АЕ", d: [
    [[275.5,277,275.5,390.5,359.5,390.5], [273.5,289,273.5,354.5,336,354.5], [296,336,296,336,336,296], null],
    [[272.5,274,272.5,343,343,332.5], [262.5,262.5,265.5,325.5,294.5,325.5], [286,286,0,309,309,0], null],
    [[258,258,263.5,382,310,382], [234,284.5,234,372.5,284.5,372.5], null, null],
    [null, null, null, null]
  ]},
  "120": {n: "Организация на хотелиерството АЕ", d: [
    [[282,286.5,282,361.5,315,361.5], [269,269,271,323,298.5,323], [328.5,328.5,0,328.5,328.5,0], [295.5,295.5,0,295.5,295.5,0]],
    [[273.5,273.5,280,400.5,400.5,352], [265.5,269.5,265.5,339,339,319.5], null, [277.5,0,277.5,277.5,0,277.5]],
    [[256,257,256,371,371,330.5], [234,234,266.5,312,312,273.5], null, null],
    [null, null, null, null]
  ]},
  "128": {n: "Производство на кулинарни изделия и напитки АЕ", d: [
    [[252,252,252,345,345,333.5], [246,246,247,299.5,299.5,279], null, null],
    [[255,259,255,338.5,338.5,301], [253,253,281,281,262.5,281], null, null],
    [[259.5,271,259.5,355.5,355.5,346], [253,253,271.5,306,259,306], null, [215.5,215.5,0,215.5,215.5,0]],
    [null, null, null, null]
  ]},
  "130": {n: "Производство на хляб и хлебни изделия АЕ", d: [
    [[231,235,231,307,268.5,307], [227.5,230,227.5,268.5,268.5,245], [257,0,257,257,0,257], [256,0,256,256,0,256]],
    [[233,249.5,233,364.5,362.5,364.5], [232,249.5,232,345.5,249.5,345.5], [245.5,0,245.5,245.5,0,245.5], null],
    [[239,247,239,419,288,419], [231,232,231,276.5,276.5,241.5], null, null],
    [null, null, null, null]
  ]},
  "29349": {n: "Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[247,247,247.5,368.5,349,368.5], [247,247,0,323.5,323.5,0], null, null]
  ]},
  "29345": {n: "Организиране на туристически пътувания", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[241,241,244,413.5,310,413.5], [217,236,217,332.5,279.5,332.5], null, null]
  ]},
  "29351": {n: "Производство на хляб, хлебни и сладкарски изделия", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[235,238,235,417.5,312,417.5], [227.5,238,227.5,238,238,227.5], null, null]
  ]},
  "29343": {n: "Ресторантьорство и кетъринг АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[242,242,242,335,335,309], [228,231,228,278.5,278.5,234.5], null, null]
  ]},
  "29341": {n: "Ресторантьорство и кетъринг НЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[199,199,205,317,296,317], [182,182,189,317,206,317], null, null]
  ]},
  "29339": {n: "Хотелиерство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[233.5,233.5,241,347,346.5,347], [211,220,211,340.5,280,340.5], null, null]
  ]},
}};
ruoSchools["1690472"] = {n: "ПГ по хр. техн. и техника", f: "ПГ по хранителни технологии и техника", c: false, p: {
  "1940": {n: "Експлоатация и поддържане на хладилна и климатична техника - техник АЕ", d: [
    [[201.5,201.5,0,322,322,0], [184,184,0,322,322,0], [240.5,240.5,0,240.5,240.5,0], null],
    [[214.25,214.25,235,347.75,347.75,235], [183.5,183.5,235,281,281,235], [221.75,221.75,0,221.75,221.75,0], null],
    [[162.5,162.5,0,355.25,355.25,0], [72,72,0,265.5,265.5,0], [174.5,174.5,0,212,212,0], null],
    [null, null, null, null]
  ]},
  "1949": {n: "Контрол на качеството и безопасност на храни и напитки - техник-технолог АЕ", d: [
    [[239.75,240,239.75,392.5,354.25,392.5], [232.5,232.5,232.75,321,308.75,321], null, null],
    [[237,237,245,376.75,345.75,376.75], [197,237,197,331.25,311,331.25], [302.5,308.75,302.5,327.25,327.25,302.5], [300.75,300.75,0,300.75,300.75,0]],
    [[193.5,202.75,193.5,393,348,393], [107,152.5,107,320.75,320.75,303.25], [218,0,218,374.75,0,374.75], [225.75,225.75,0,225.75,225.75,0]],
    [null, null, null, null]
  ]},
  "1965": {n: "Технологичен и микробиологичен контрол в ХВП - Лаборант АЕ", d: [
    [[197,223.5,197,343.75,320.25,343.75], [171,187.5,171,315.75,315.75,312.25], [271,0,271,342.25,0,342.25], null],
    [[178,181,178,445.75,313,445.75], [162,170,162,313,313,298.5], [313,313,355.5,360.5,313,360.5], [281.5,0,281.5,281.5,0,281.5]],
    [[95,146,95,422.25,422.25,402], [146,146,234.25,422.25,422.25,393], [219,0,219,219,0,219], null],
    [null, null, null, null]
  ]},
  "1992": {n: "Технология в биопроизводствата - Биотехнолог АЕ", d: [
    [[254,255,254,357.25,299.5,357.25], [213.5,222.5,213.5,299.5,299.5,274], [257,257,291.5,291.5,267.5,291.5], null],
    [[208,213.5,208,423.5,311.25,423.5], [174.5,174.5,191.5,191.5,174.5,191.5], null, null],
    [[139.5,139.5,207,412,360.5,412], [139.5,139.5,207,412,146.75,412], [238.25,238.25,0,238.25,238.25,0], [208.25,0,208.25,208.25,0,208.25]],
    [null, null, null, null]
  ]},
  "1979": {n: "Топлотехника - топлинна климатична вентилационна и хладилна - техник АЕ", d: [
    [[179,179,0,361,361,0], [169,169,0,345.5,345.5,0], null, null],
    [[176.5,176.5,0,360,360,0], [179.5,179.5,0,263.5,263.5,0], [214,214,0,237,237,0], [257.25,257.25,0,257.25,257.25,0]],
    [[133.75,133.75,0,342.75,342.75,0], [257.25,257.25,0,257.25,257.25,0], [291,291,0,291,291,0], null],
    [null, null, null, null]
  ]},
  "28197": {n: "Контрол на качеството и безопасност на храните - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[126.5,134.5,126.5,443.75,335.5,443.75], [87,87,103,314.5,290.25,314.5], null, null]
  ]},
  "28200": {n: "Лабораторен контрол в химични, хранителни и биотехнологични производства - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[198,201,198,423.5,263.25,423.5], [222,232.75,222,361.25,263.25,361.25], null, null]
  ]},
  "28194": {n: "Отопление, вентилация, климатизация и газова техника - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[149,149,226,318.25,318.25,226], [124.5,124.5,0,294.25,294.25,0], null, null]
  ]},
  "28201": {n: "Технологии в биопроизводствата - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,191.5,412.25,241.75,412.25], [191.5,241.75,191.5,294,241.75,294], null, null]
  ]},
}};
ruoSchools["1690549"] = {n: "СУ Конст. Величков", f: "СУ Константин Величков", c: false, p: {
  "2726": {n: "Природни науки АЕ", d: [
    [[118,124,118,375,242.5,375], [112,112,117,289.5,242.5,289.5], [280.5,0,280.5,312,0,312], [256,256,0,256,256,0]],
    [[128,128,128,343.5,260,343.5], [58,58,156,340,244.5,340], [319,0,319,321.5,0,321.5], null],
    [[34,82,34,334.5,229,334.5], [30,229,30,229,229,30], [210,0,210,210,0,210], null],
    [[41,41,126,393,242,393], [30,30,202,226,116,226], null, null]
  ]},
}};
ruoSchools["1690154"] = {n: "СУ П. Хилендарски", f: "СУ Паисий Хилендарски", c: false, p: {
  "839": {n: "Графичен дизайн, АЕ", d: [
    [[290,291.5,290,370,325.25,370], [273,273,277.5,306.5,293.75,306.5], [313.25,0,313.25,316.25,0,316.25], [280.75,0,280.75,280.75,0,280.75]],
    [[294.25,305.5,294.25,364.5,341.25,364.5], [284.25,291,284.25,364.5,311,364.5], [350.25,0,350.25,350.25,0,350.25], null],
    [[304,305,304,422.75,378.5,422.75], [287,287,289.5,378.5,378.5,375.25], [343,351.75,343,351.75,351.75,343], null],
    [null, null, null, null]
  ]},
  "687": {n: "Природни науки , АЕ", d: [
    [[311.5,312,311.5,352,336.5,352], [297.5,297.5,300.5,335,335,327.5], [328,0,328,344.5,0,344.5], [326,0,326,326,0,326]],
    [[296,296,296.5,435,342.5,435], [287,292.5,287,387,342.5,387], [330,0,330,330,0,330], null],
    [[302,313.5,302,368,356.5,368], [301.5,301.5,306,362.5,356.5,362.5], [416.5,416.5,0,416.5,416.5,0], null],
    [[299,299,299.5,385.5,325,385.5], [282.5,286,282.5,363.5,325,363.5], null, null]
  ]},
  "691": {n: "Програмиране на изкуствен интелект, АЕ", d: [
    [[274.75,274.75,278.25,393.25,393.25,312.25], [268,270,268,301,301,295.5], null, null],
    [[273.5,273.5,277.75,405.25,405.25,403.5], [268.5,268.5,283.25,402.75,402.75,309], null, null],
    [[266,266,268,440.75,440.75,393.75], [232,232,236.25,393.75,317.25,393.75], [340.75,0,340.75,340.75,0,340.75], null],
    [null, null, null, null]
  ]},
  "30090": {n: "Графичен дизайн", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[268.25,269,268.25,442,286.25,442], [265.25,275.75,265.25,354.25,275.75,354.25], null, null]
  ]},
  "30091": {n: "Интелигентни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[240.75,240.75,243.25,371.25,371.25,339.75], [224.75,236,224.75,339.75,334.5,339.75], null, null]
  ]},
}};
ruoSchools["1690542"] = {n: "СУ Братя Миладинови", f: "СУ Братя Миладинови", c: false, p: {
  "287": {n: "Предприемачески", d: [
    [[30,74,30,320.5,320.5,218], [89,103,89,197,117,197], [30,30,89,238.5,183,238.5], [168,168,192,209,168,209]],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4730": {n: "Продавач-консултант", d: [
    [null, null, null, null],
    [[63,64,63,245,158,245], [97,97,0,97,97,0], [151,0,151,198,0,198], [78,78,0,252,252,0]],
    [[30,30,41,365,182,365], [198,0,198,198,0,198], [59,0,59,161,0,161], [30,0,30,30,0,30]],
    [null, null, null, null]
  ]},
  "28149": {n: "Търговия и продажби", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,41,105,223,215.5,223], [145,145,0,145,145,0], null, null]
  ]},
}};
ruoSchools["1690642"] = {n: "СУ Димитър Матевски", f: "СУ Димитър Матевски", c: false, p: {
  "2184": {n: "Икономист,Търговия, разширено изучаване на чужд език АЕ", d: [
    [[154,160,154,304,298.5,304], [102,111.5,102,298.5,298.5,233.5], [198.5,0,198.5,244,0,244], [239,239,0,239,239,0]],
    [[168.5,170.5,168.5,362.75,288.75,362.75], [134,134,158,266.75,266.75,246.5], [245.75,245.75,0,266.75,266.75,0], [197.25,197.25,0,197.25,197.25,0]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3686": {n: "Организатор интернет приложения, Електронна търговия, разширено изучаване на чужд език АЕ", d: [
    [[211,211,227.5,383,383,346.5], [171,171,195.5,346.5,258.5,346.5], [255.5,0,255.5,270.5,0,270.5], null],
    [[178.75,182.5,178.75,406.5,394.75,406.5], [162.75,162.75,178.75,406.5,394.75,406.5], [228,252.25,228,252.25,252.25,228], null],
    [[147,147,154,371.5,285,371.5], [142,142,282,371.5,228,371.5], [294,0,294,294,0,294], [275,275,0,275,275,0]],
    [null, null, null, null]
  ]},
  "5102": {n: "Икономист, Търговия, разширено изучаване на чужд език АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[98,98,122,306,236,306], [236,236,279.5,279.5,236,279.5], [203,0,203,203,0,203], null],
    [null, null, null, null]
  ]},
  "29215": {n: "Електронна търговия, маркетинг и реклама", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[213,213.5,213,382,351,382], [197,197,207,304.5,304.5,207], null, null]
  ]},
  "29212": {n: "Мениджмънт и икономика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[127.5,127.5,166.5,336,336,334.5], [107,125,107,334.5,198,334.5], null, null]
  ]},
}};
ruoSchools["1690150"] = {n: "СУ Л. Каравелов", f: "СУ Любен Каравелов", c: false, p: {
  "2742": {n: "Музика АЕ", d: [
    [[162.5,162.5,169.5,425,368.25,425], null, null, null],
    [[162,214.5,162,414,339.75,414], null, null, null],
    [[144.75,144.75,170.5,415.5,386.5,415.5], [323.5,323.5,0,323.5,323.5,0], null, null],
    [[210.75,212,210.75,428,393.25,428], [137,137,0,138,138,0], null, null]
  ]},
  "2746": {n: "Музика ИТ", d: [
    [[153,153,236,384,384,367.75], null, [216.5,216.5,0,216.5,216.5,0], null],
    [[231.5,247,231.5,413.5,413.5,406.5], null, null, null],
    [[182,182,225,419.75,354,419.75], [287.25,317.5,287.25,317.5,317.5,287.25], null, null],
    [[193,193,275,438,438,399], [198.5,198.5,0,198.5,198.5,0], null, null]
  ]},
}};
ruoSchools["1690247"] = {n: "СУ Найден Геров", f: "СУ Найден Геров", c: false, p: {
  "4359": {n: "Предприемачески АЕ", d: [
    [[36,42,36,224.5,224.5,170], [30,30,170,224.5,224.5,170], [71,71,0,71,71,0], [131.5,131.5,179,179,131.5,179]],
    [[52,52,56,132,118,132], null, [93,93,0,149,149,0], [166,166,0,166,166,0]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "739": {n: "Работник в дървообработването", d: [
    [[65,65,135,191,191,135], [135,191,135,191,191,135], null, null],
    [[60,60,0,122,122,0], null, [98,98,0,107,107,0], null],
    [[36,36,0,98,98,0], null, null, null],
    [null, null, null, null]
  ]},
  "734": {n: "Шивач", d: [
    [[30,0,30,84,0,84], null, [61,0,61,61,0,61], [65,0,65,65,0,65]],
    [[64,102,64,111,102,111], null, [186.5,0,186.5,186.5,0,186.5], null],
    [[68,89,68,159,89,159], null, null, null],
    [null, null, null, null]
  ]},
  "4758": {n: "Озеленител", d: [
    [null, null, null, null],
    [[35,35,62,126,126,119], null, null, null],
    [[30,71,30,106,106,101], [34,0,34,34,0,34], null, null],
    [null, null, null, null]
  ]},
  "4834": {n: "Монтажник на водоснабдителни и канализационни мрежи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,135,246,246,135], null, [64,64,0,69,69,0], null],
    [null, null, null, null]
  ]},
  "29489": {n: "Вътрешни ВиК мрежи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[54,56,54,86,86,81], [50,0,50,50,0,50], null, null]
  ]},
  "29515": {n: "Мебелно производство и реставрация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,0,62,62,0], null, null, null]
  ]},
  "29519": {n: "Парково строителство и озеленяване", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,50,98,98,86], null, null, null]
  ]},
  "29516": {n: "Устойчива мода", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[38,0,38,94,0,94], null, null, null]
  ]},
}};
ruoSchools["1690446"] = {n: "СУ Никола Вапцаров", f: "СУ Никола Вапцаров", c: false, p: {
  "767": {n: "Бижутерия", d: [
    [[118,118,148,332,227,332], [41,41,151,227,227,218], [180,180,186,221,180,221], null],
    [[65,65,116,273.5,226,273.5], [41,41,243,243,104,243], [180,180,210,215,215,214.5], [278,0,278,278,0,278]],
    [[89,127,89,272,127,272], [259,0,259,259,0,259], [147.5,0,147.5,147.5,0,147.5], [172,0,172,172,0,172]],
    [[52,52,65,311,311,216], [311,311,0,311,311,0], null, null]
  ]},
  "3690": {n: "Графичен дизайн", d: [
    [[215.5,215.5,217,304,292,304], [199.5,206,199.5,292,292,291.5], [265.5,265.5,275.5,300,265.5,300], [288,0,288,288,0,288]],
    [[178,178,202,293,249.5,293], [120,120,216,253.5,244.5,253.5], [263,0,263,268,0,268], null],
    [[65,65,205,326,300,326], [173,173,249,258,173,258], [246,246,0,246,246,0], [185,185,0,185,185,0]],
    [[120,170,120,332.5,256,332.5], [201,256,201,256,256,244], null, null]
  ]},
}};
ruoSchools["1690447"] = {n: "СУ Пейо Яворов", f: "СУ Пейо Яворов", c: false, p: {
  "2770": {n: "Природни науки", d: [
    [[245,258,245,329,329,322], [226,226,230.5,329,329,278.5], [275.5,275.5,286,307,297,307], null],
    [[242,242,244,388.5,354.5,388.5], [210.5,219.5,210.5,345,240,345], [317.5,0,317.5,319,0,319], null],
    [[233,233,239.5,339.5,339.5,324], [232,233,232,295,266.5,295], [281,0,281,281,0,281], null],
    [[210,212,210,346.5,313,346.5], [130,137,130,321.5,313,321.5], null, null]
  ]},
  "2450": {n: "Софтуерни и хардуерни науки", d: [
    [[262,263.5,262,317.5,316,317.5], [257,259,257,316,316,307.5], [309.5,309.5,0,316,316,0], [250,250,0,310,310,0]],
    [[253.5,253.5,257,325,325,320.5], [245.5,249,245.5,300,299.5,300], null, null],
    [[223,226,223,332,332,278], [165,165,208.5,317,317,208.5], [269,269,0,269,269,0], null],
    [[221,221,233,348.5,348.5,329], [210,211,210,348.5,348.5,210], null, null]
  ]},
}};
ruoSchools["1690155"] = {n: "СУ Кл. Охридски", f: "СУ Климент Охридски", c: false, p: {
  "562": {n: "Обществени науки", d: [
    [[234,234,234,360,360,341], [224.5,227,224.5,333.5,285.5,333.5], [289,315,289,315,315,289], [279.5,279.5,280.5,280.5,279.5,280.5]],
    [[245,245,245,368,368,316], [224.5,224.5,229,347.5,347.5,311.5], [318.5,0,318.5,362.5,0,362.5], [275,275,284,284,275,284]],
    [[243,244,243,357.5,357.5,325.5], [218,218,224,340.5,340.5,262], [273,0,273,273,0,273], null],
    [[306,306,311.5,430.75,379.75,430.75], [273,317.5,273,352.5,352.5,346.75], null, null]
  ]},
  "558": {n: "Природни науки", d: [
    [[270,270.5,270,376.5,355.5,376.5], [265,270.5,265,314.5,270.5,314.5], [311.5,314,311.5,327.5,327.5,311.5], [309.5,370.5,309.5,370.5,370.5,309.5]],
    [[259.5,261,259.5,423.5,423.5,418], [241,241,242,418,313,418], null, null],
    [[227.5,227.5,230,429,302.5,429], [208,208,218,360,254.5,360], null, null],
    [[239,242,239,391,386,391], [224,224,224,281.5,242,281.5], null, null]
  ]},
  "28687": {n: "Съдебна администрация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[278.75,405.75,278.75,412.75,412.75,394.25], [272.5,0,272.5,366,0,366], null, null]
  ]},
}};
ruoSchools["1690550"] = {n: "СУ К. Кирил Философ", f: "СУ Св. К. Кирил Философ", c: false, p: {
  "688": {n: "Икономическа информатика", d: [
    [[177.5,184.5,177.5,300.5,227,300.5], [189,196.5,189,211.5,211.5,207.5], null, [264.5,0,264.5,264.5,0,264.5]],
    [[194,194,194,313,313,267.5], [171.5,171.5,177,313,313,180], [250.5,0,250.5,250.5,0,250.5], null],
    [[118,167,118,441,343,441], [80,188,80,188,188,80], [134,134,197.5,197.5,162,197.5], null],
    [[67,76,67,305,174,305], null, null, null]
  ]},
  "640": {n: "Софтуерни и хардуерни науки", d: [
    [[215.5,215.5,218.5,320,293,320], [210.5,210.5,225.5,293,293,253.5], [253.5,0,253.5,315,0,315], null],
    [[225,225,230,467.5,467.5,323.5], [219.5,219.5,223,342.5,342.5,223], [245,0,245,245,0,245], null],
    [[206.5,207,206.5,442.5,324.5,442.5], [190,190,297.5,324.5,324.5,297.5], [263,263,0,283.5,283.5,0], null],
    [[136,136,155,406.5,367,406.5], [186.5,200.5,186.5,325,235.5,325], null, null]
  ]},
  "29877": {n: "Киберсигурност", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[148,148,163.5,429,429,387.5], [116,116,200,212,212,200], null, null]
  ]},
}};
ruoSchools["1690156"] = {n: "СУ Патр. Евтимий", f: "СУ Патриарх Евтимий", c: false, p: {
  "2836": {n: "Икономическо развитие с английски език", d: [
    [[368.5,368.5,368.5,405.5,379.5,405.5], [366.25,367,366.25,405.5,373.75,405.5], [402,402,0,402,402,0], [350.25,0,350.25,350.25,0,350.25]],
    [[372,372,373,437.5,396,437.5], [371.75,371.75,373,408.5,372.5,408.5], null, null],
    [[382,382,382.5,430,397,430], [380,381.75,380,400.25,397,400.25], null, null],
    [[378,390.75,378,423.75,390.75,423.75], [374,390.75,374,408.5,390.75,408.5], null, null]
  ]},
  "2834": {n: "Обществени науки с испански език", d: [
    [[379.5,385,379.5,411.5,385,411.5], [372.75,0,372.75,399.5,0,399.5], null, null],
    [[369.25,387.25,369.25,433.5,387.25,433.5], [367.25,0,367.25,392.25,0,392.25], [381.75,0,381.75,381.75,0,381.75], null],
    [[386,0,386,460.25,0,460.25], [386,0,386,410.5,0,410.5], null, null],
    [[378,0,378,435.75,0,435.75], [368.75,0,368.75,426.5,0,426.5], null, null]
  ]},
  "2838": {n: "Природни науки с английски език", d: [
    [[342.5,342.5,342.5,397,374,397], [335,340,335,357,351.5,357], null, null],
    [[367,407.5,367,477.5,431.5,477.5], [364,409.5,364,425,409.5,425], null, null],
    [[382.5,385,382.5,456.5,411,456.5], [376.5,376.5,377,420,411,420], null, null],
    [[372.5,372.5,374,431.5,419,431.5], [367,369,367,408.5,408.5,380.5], null, null]
  ]},
  "2839": {n: "Природни науки с немски език", d: [
    [[329,329,330,404.5,340.5,404.5], [325.5,325.5,326,337,330.5,337], [345,0,345,345,0,345], null],
    [[336,338,336,403,403,376.5], [332.5,332.5,333.5,376.5,335,376.5], null, null],
    [[353.5,353.5,353.5,445,376.5,445], [350.5,352.5,350.5,415,357.5,415], null, null],
    [[347.5,354,347.5,408,408,372], [340.5,368,340.5,368,368,360.5], null, null]
  ]},
  "4443": {n: "Икономическо развитие с интензивно изучаване на испански език", d: [
    [[389.25,389.25,389.25,430.25,405.75,430.25], [383.75,385,383.75,397.5,389.25,397.5], null, null],
    [[389.25,402,389.25,461.25,402,461.25], [376.5,0,376.5,438.75,0,438.75], null, null],
    [[384.75,384.75,387,442.5,389.75,442.5], [380,0,380,426.5,0,426.5], null, null],
    [[372,373.5,372,442.5,373.5,442.5], [367,0,367,437,0,437], null, null]
  ]},
}};
ruoSchools["1690345"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "953": {n: "Български танци - Танцьор. АЕ", d: [
    [[188,193.5,188,402,222,402], [140,193.5,140,339.5,193.5,339.5], [187.5,0,187.5,239,0,239], null],
    [[93,93,153,386.5,173,386.5], [93,93,214,350,93,350], [183.5,0,183.5,307,0,307], [232,0,232,259.5,0,259.5]],
    [[120,120,151,414,323,414], [120,120,151,332.5,148,332.5], [148,148,0,148,148,0], null],
    [null, null, null, null]
  ]},
  "945": {n: "Рекламна графика - Дизайнер. АЕ", d: [
    [[229,239.5,229,389.5,329.5,389.5], [203,203,213,352,329.5,352], [258,258,260.5,287,287,269.5], [252.5,252.5,0,282.5,282.5,0]],
    [[208,208,209,454.5,376,454.5], [135,135,150,355,355,307], [205,205,205,294.5,294.5,290], null],
    [[196,196,208,459,333,459], [158,158,179,459,333,459], [237.5,0,237.5,301,0,301], null],
    [null, null, null, null]
  ]},
  "28156": {n: "Рекламна графика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,41,79,357.5,350.5,357.5], [131,131,155,309,272.5,309], null, null]
  ]},
  "28157": {n: "Танцово изкуство - български народни танци", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[115,115,123,393.5,374,393.5], [136,374,136,374,374,136], null, null]
  ]},
}};
ruoSchools["1690643"] = {n: "СУ Св. Седмочисленици", f: "СУ Свети Седмочисленици", c: false, p: {
  "4210": {n: "Икономическа информатика, английски език", d: [
    [[110,110,118,215,208.5,215], [143.5,143.5,215,215,201,215], [113,113,182.5,276,276,250], [211.5,211.5,244,252,252,244]],
    [[85,100,85,419,419,222], [143,0,143,222,0,222], [66,66,197,241,241,200.5], [159,159,193,201.5,181.5,201.5]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3859": {n: "Софтуерни и хардуерни науки, английски език", d: [
    [[183,183,195,327.5,327.5,277], [169,169,198,327.5,327.5,198], [245,308.5,245,308.5,308.5,245], null],
    [[180.5,180.5,225.5,457.5,457.5,292], [167,167,225.5,245,245,225.5], [244.5,257,244.5,286.5,279,286.5], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "5064": {n: "Икономическа информатика, Английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[119,197,119,286.5,261.5,286.5], [170.5,261.5,170.5,261.5,261.5,170.5], [242,0,242,242,0,242], null],
    [null, null, null, null]
  ]},
  "5063": {n: "Софтуерни и хардуерни науки, Английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[121,121,170,353,323.5,353], [177,177,209.5,296.5,296.5,259], [192.5,192.5,0,198,198,0], [198,198,0,225,225,0]],
    [[83,83,215,371.5,371.5,359], [128,128,0,216.5,216.5,0], null, null]
  ]},
  "28145": {n: "Икономическа информатика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[96,124,96,431.5,431.5,374.5], [90,90,209,293,265.5,293], null, null]
  ]},
}};
ruoSchools["1690644"] = {n: "СУ Софроний Врачански", f: "СУ Софроний Врачански", c: false, p: {
  "3518": {n: "Електронна търговия - АЕ", d: [
    [[161,162,161,332.5,273.5,332.5], [141,148.5,141,273.5,263,273.5], [138,249,138,249,249,248], null],
    [[168,171,168,370.5,321,370.5], [75,75,234,304.5,304.5,272.5], [181,191,181,296.5,241,296.5], [217.5,217.5,224,224,217.5,224]],
    [[189,189,191,387.5,387.5,321], [166,166,191,321,317,321], [143,197,143,197,197,143], [197,197,0,197,197,0]],
    [null, null, null, null]
  ]},
  "683": {n: "Икономическо информационно осигуряване - АЕ", d: [
    [[77,77,107,318,212.5,318], [77,77,224,318,134,318], [126,161,126,234,218.5,234], [226,226,231.5,246,246,233]],
    [[75,75,141,402,402,325.5], [284,0,284,284,0,284], [141.5,141.5,221,302,171,302], [218,227,218,227,227,218]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4813": {n: "Програмиране на изкуствен интелект - АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[122,122,130,377.5,309,377.5], [169,245,169,245,245,207.5], [313.5,0,313.5,313.5,0,313.5], [284.5,284.5,0,284.5,284.5,0]],
    [null, null, null, null]
  ]},
  "28587": {n: "Електронна търговия, маркетинг и реклама - трета степен, Търговия на едро и дребно(41602)", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[135.5,135.5,166,385,305,385], [104,104,226,284.5,267,284.5], null, null]
  ]},
  "28583": {n: "Малък и среден бизнес - трета степен, Управление и администрация(41302)", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[58,76,58,319.5,319.5,294.5], [70,224,70,319.5,319.5,74], null, null]
  ]},
}};
ruoSchools["1690248"] = {n: "СУ Симон Боливар", f: "СУ Симон Боливар", c: false, p: {
  "634": {n: "Техник - озеленител", d: [
    [[65,73,65,262.5,166,262.5], null, [126.25,126.25,221,221,126.25,221], [218,0,218,218,0,218]],
    [[86,86,104,244.75,154,244.75], null, null, [276,0,276,276,0,276]],
    [[78,78,98,314,314,220], null, null, null],
    [null, null, null, null]
  ]},
  "28467": {n: "Флористика и озеленяване", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[106,107.5,106,270,222.5,270], [103,0,103,103,0,103], null, null]
  ]},
}};
ruoSchools["1690448"] = {n: "СУ Христо Данов", f: "СУ Христо Груев Данов", c: false, p: {
  "720": {n: "Професионална паралелка с разширено изучаване на английски език Програмно осигуряване", d: [
    [[209,209,223,352,352,303], [179,179,202.5,319.5,319.5,286.5], [258.5,0,258.5,299,0,299], null],
    [[154.5,159,154.5,330,316.5,330], [127,128,127,284.5,284.5,127], [216,216,0,251.5,251.5,0], null],
    [[126,126,132,306,306,246.5], [192,251,192,306,306,192], [135,178,135,306,306,135], null],
    [null, null, null, null]
  ]},
  "28423": {n: "Професионална паралелка с разширено изучаване на английски език Интелигентни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[87,123,87,332.5,332.5,304], null, null, null]
  ]},
  "28205": {n: "Професионална паралелка с разширено изучаване на английски език Разработка на софтуер", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[52,52,77,345.5,345.5,273], [164,164,0,320,320,0], null, null]
  ]},
}};
ruoSchools["1690157"] = {n: "СУ Цар Симеон", f: "СУ Цар Симеон Велики", c: false, p: {
  "4442": {n: "Асистент на лекар по дентална медицина с интензивно изучаване на английски език", d: [
    [[257,258.5,257,356,307,356], [240,0,240,356,0,356], null, [289.5,289.5,0,289.5,289.5,0]],
    [[259,259,260,466,373,466], [226.5,226.5,240.5,328,252.5,328], null, null],
    [[186,186,195,324,314.5,324], [157,165,157,324,165,324], [319.5,0,319.5,319.5,0,319.5], [236,0,236,236,0,236]],
    [null, null, null, null]
  ]},
  "2493": {n: "Предприемачески", d: [
    [[143,143,177,337,337,262], [136,149,136,240,240,225.5], [236,279.5,236,279.5,279.5,271], [275,0,275,275,0,275]],
    [[197.5,200,197.5,443,273,443], [165,165,197.5,295,273,295], [272.5,272.5,325,325,272.5,325], [319,0,319,319,0,319]],
    [[93,93,96,262,262,236], null, [122,267,122,355.5,267,355.5], [355.5,0,355.5,355.5,0,355.5]],
    [null, null, null, null]
  ]},
  "2482": {n: "Софтуерни и хардуерни науки", d: [
    [[244,244,244.5,321,321,298], [242,242,244.5,298.5,298.5,293], [270.5,270.5,290.5,292,279,292], [251,255.5,251,279,279,251]],
    [[232.5,232.5,237.5,369.5,369.5,347], [182,182,185,347,317.5,347], [301.5,317.5,301.5,317.5,317.5,301.5], [270.5,294.5,270.5,294.5,294.5,270.5]],
    [[140,140,174,328,328,247], [228.5,228.5,0,274,274,0], [129,129,236,277.5,277.5,236], [262,262,0,262,262,0]],
    [[184.5,184.5,223,375,308,375], [98,98,223,285.5,285.5,260], null, null]
  ]},
  "28331": {n: "Административни и офис дейности", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[119,154.5,119,382.25,253.5,382.25], [170,213.5,170,361.5,213.5,361.5], null, null]
  ]},
  "28332": {n: "Асистиране в денталната медицина", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[242.5,266.25,242.5,427.25,427.25,389.75], [226,229.75,226,301.75,229.75,301.75], null, null]
  ]},
}};
ruoSchools["1690645"] = {n: "СУ Ч. Храбър", f: "СУ Черноризец Храбър", c: false, p: {
  "3571": {n: "Графичен дизайн", d: [
    [[334.5,344.5,334.5,496,401,496], [326,326,326.5,358.5,357,358.5], null, null],
    [[357,357,357,461.5,445.5,461.5], [314.5,318,314.5,376,376,369.5], null, null],
    [[326.5,327,326.5,464,442,464], [312,312,317,363.5,323,363.5], [346.5,0,346.5,346.5,0,346.5], null],
    [[333,333,333.5,452.5,452.5,411.5], [320,333,320,408.5,333,408.5], null, null]
  ]},
  "3691": {n: "Икономика и мениджмънт", d: [
    [[307.5,307.5,307.5,454,413,454], [304,307,304,309.5,309.5,308], null, null],
    [[323,339.5,323,463,463,452], [293.5,346.5,293.5,386,386,363.5], null, null],
    [[306,306,307.5,363.5,351,363.5], [297.5,301,297.5,361.5,348.5,361.5], [275.5,275.5,282.5,317.5,317.5,282.5], [320,0,320,320,0,320]],
    [null, null, null, null]
  ]},
  "29718": {n: "Мениджмънт и икономика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[295.5,296.5,295.5,419,386.5,419], [294,294,294,375,294,375], null, null]
  ]},
}};
ruoSchools["1690451"] = {n: "Френска ЕГ", f: "Френска ЕГ Антоан дьо Сент - Екзюпери", c: false, p: {
  "2039": {n: "Чужди езици АЕ", d: [
    [[366.5,367.25,366.5,448.5,403.75,448.5], [353,353,353,430.75,367.25,430.75], [355.75,355.75,368.75,380.25,361.75,380.25], [345.5,345.5,0,345.5,345.5,0]],
    [[349.75,351,349.75,446.75,402.25,446.75], [339.75,339.75,342.25,427.5,388.5,427.5], [368.5,0,368.5,400.25,0,400.25], [318.25,334.25,318.25,384,334.25,384]],
    [[338.5,338.5,338.5,435,384.25,435], [327,327.25,327,421.5,384.25,421.5], [380.5,0,380.5,393.25,0,393.25], [357.75,0,357.75,357.75,0,357.75]],
    [[327.75,328.5,327.75,414.5,401,414.5], [320,320,321.25,400,371,400], null, null]
  ]},
  "2031": {n: "Чужди езици ФЕ", d: [
    [[327.25,328,327.25,430.5,383.75,430.5], [311.75,313.5,311.75,430.5,361.25,430.5], [344.5,346.5,344.5,355.75,347,355.75], [329.25,334.25,329.25,334.25,334.25,329.25]],
    [[313.25,315.75,313.25,454,364.5,454], [305,305.5,305,407.75,351,407.75], [360.5,392.75,360.5,392.75,392.75,365], [309,0,309,309,0,309]],
    [[300.25,303.25,300.25,434.75,374,434.75], [254.5,254.5,257,427.75,318,427.75], [369.25,0,369.25,402,0,402], [363.75,0,363.75,363.75,0,363.75]],
    [[281.5,282.25,281.5,482.25,373.5,482.25], [255.25,257.25,255.25,384,332,384], null, null]
  ]},
}};
ruoSchools["1690153"] = {n: "Хуманитарна гимназия", f: "Хуманитарна гимназия Св. Св. Кирил и Методий", c: false, p: {
  "2853": {n: "Природни науки АЕ", d: [
    [[414.75,428.25,414.75,473.75,459.75,473.75], [411.5,0,411.5,414.75,0,414.75], null, null],
    [[433.75,441,433.75,487.25,478.75,487.25], [433.25,0,433.25,436.5,0,436.5], null, null],
    [[443.5,447.75,443.5,469,464.5,469], null, null, null],
    [[435.5,450.25,435.5,495.5,450.25,495.5], [433,0,433,455,0,455], null, null]
  ]},
  "2816": {n: "Хуманитарни науки АЕ", d: [
    [[383.25,383.25,407.75,474,444.5,474], [379.5,379.5,402.75,430.75,401.75,430.75], [383.5,0,383.5,402.75,0,402.75], [383.25,0,383.25,383.25,0,383.25]],
    [[388.75,388.75,409.5,485.25,445,485.25], [379.5,379.5,408.25,439.5,422.75,439.5], null, null],
    [[386.75,386.75,414.75,465.75,451.75,465.75], [385,385,416,451.75,451.75,444], null, null],
    [[386,386,409,473.5,473,473.5], [383,383,406.5,431,426.75,431], null, null]
  ]},
  "2851": {n: "Хуманитарни науки НЕ", d: [
    [[374.75,374.75,403.25,464.75,417.75,464.75], [373.5,373.5,401.25,426.5,378.75,426.5], null, null],
    [[368.5,368.5,397.25,445.25,423.25,445.25], [366.5,366.5,389.25,432,386.75,432], [360.75,360.75,0,360.75,360.75,0], [362,362,0,362,362,0]],
    [[382,382,407,453.5,439.75,453.5], [375.75,375.75,405.75,435,391.5,435], [411.25,0,411.25,411.25,0,411.25], null],
    [[395.5,395.5,403.5,453.75,453.75,445.25], [400.75,0,400.75,442.25,0,442.25], null, null]
  ]},
  "2856": {n: "Хуманитарни науки РЕ", d: [
    [[395,0,395,452.25,0,452.25], [389.25,0,389.25,401,0,401], [380.75,0,380.75,380.75,0,380.75], null],
    [[388,430.5,388,430.5,430.5,414.75], [385.75,0,385.75,407.25,0,407.25], null, null],
    [[397.5,430.5,397.5,444.75,430.5,444.75], [394.5,0,394.5,411.75,0,411.75], null, null],
    [[392.5,396.5,392.5,483.5,396.5,483.5], [390.25,0,390.25,405.75,0,405.75], null, null]
  ]},
  "28158": {n: "Природни науки НЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[398.5,400.25,398.5,463.5,413.25,463.5], [390.25,0,390.25,398.5,0,398.5], null, null]
  ]},
}};
