// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Dulgopol
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["400136"] = {n: "СУ Кл. Охридски", f: "СУ Климент Охридски", c: false, p: {
  "0883": {n: "Производство на кулинарни изделия и напитки - БИБРИЧЕ_АЕ", d: [
    [[48,0,0,148,0,0], null, [30,0,0,105,0,0], null],
    [[48,72,48,225,140,225], null, null, null],
    [[50,0,0,241,0,0], null, null, null]
  ]},
  "0860": {n: "Софтуерни и хардуерни науки - БИБРИЧЕ_АЕ профил. предм. - ИНФ_ИТ", d: [
    [[99,0,0,294.75,0,0], null, null, null],
    [[99,99,122,359.5,171,359.5], null, [151,151,0,183.5,183.5,0], null],
    [[78.5,0,0,405.5,0,0], null, null, null]
  ]},
  "0875": {n: "Електронна търговия - БИБРИЧЕ_АЕ", d: [
    [[60,0,0,316.25,0,0], [132,0,0,132,0,0], null, null],
    [[74,74,141.5,386,386,281.75], null, null, null],
    [null, null, null, null]
  ]},
}};
