// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Slivnitsa
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["2300455"] = {n: "ПГ по транспорт", f: "ПГ по транспорт Н. Вапцаров", c: false, p: {
  "3976": {n: "Монтьор на транспортна техника", d: [
    [[84,84,94,207,207,123], null, [94,0,94,152,0,152], [147,0,147,147,0,147]],
    [[78,78,193,193,189,193], null, [159,210,159,210,210,159], null],
    [null, null, null, null]
  ]},
  "2086": {n: "Техник по транспортна техника", d: [
    [[103,103,150,265.5,265.5,247], [103,103,178,195.5,180.5,195.5], [177,177,0,265.5,265.5,0], null],
    [[30,93.5,30,275.5,245.5,275.5], [129,129,189.5,189.5,129,189.5], [90,90,171,195,182,195], null],
    [[68,89,68,306,244.5,306], null, [96,96,0,197,197,0], [62,0,62,62,0,62]]
  ]},
}};
ruoSchools["2306517"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "1443": {n: "Софтуерни и хардуерни науки", d: [
    [[240,248,240,407.5,349,407.5], [237,0,237,237,0,237], null, null],
    [[264,277.5,264,416.5,416.5,344.5], [245,247,245,262,262,245], null, null],
    [[201,201,201,368.5,351,368.5], null, null, null]
  ]},
}};
