// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Iakoruda
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["102011"] = {n: "ПГ Петко Славейков", f: "ПГ Петко Рачов Славейков", c: false, p: {
  "3546": {n: "Администратор в хотелиерството", d: [
    [[30,30,161,305,260,305], null, null, null],
    [[41,41,135,440.5,414.5,440.5], null, null, null],
    [[123,123,178,350,292,350], null, null, null],
    [null, null, null, null]
  ]},
  "4155": {n: "Организатор интернет приложения", d: [
    [[54,54,151,337.5,243.5,337.5], null, null, null],
    [[52,52,220,433.5,275,433.5], null, [325,0,325,361,0,361], null],
    [[128,128,226,405.5,267,405.5], null, null, [201,201,0,201,201,0]],
    [null, null, null, null]
  ]},
  "28846": {n: "Икономическа информатика-без интензивно и без разширено АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[69,69,158,428,287,428], null, null, null]
  ]},
  "28847": {n: "Хотелиерство-РИЧЕ-АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[74,74,139,323.5,323.5,316], null, null, null]
  ]},
}};
ruoSchools["107090"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "2425": {n: "Природни науки БЗО - ХООС-ИИЧЕ-АЕ", d: [
    [[84,84,95,401.5,257,401.5], null, null, null],
    [[30,30,30,444.5,364.5,444.5], null, null, null],
    [[194,194,248,421,340,421], null, null, null],
    [[30,136,30,452.5,322.5,452.5], null, null, null]
  ]},
  "3886": {n: "Софтуерни и хардуерни науки ИНФ-ИТ - ИИЧЕ - АЕ", d: [
    [[30,30,30,312.75,222,312.75], null, null, null],
    [[37,37,49.5,373.5,346.5,373.5], [287.5,0,287.5,287.5,0,287.5], null, null],
    [[30,30,30,338.5,338.5,252], null, null, null],
    [[30,30,0,340,340,0], null, null, null]
  ]},
}};
