// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Perushtitsa
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1602402"] = {n: "ПГ по лозарство и винарство", f: "Професионална гимназия по лозарство и винарство Христо Ботев", c: false, p: {
  "1542": {n: "Лозаровинар", d: [
    [[54,74,54,197,180,197], null, [95,0,95,95,0,95], null],
    [[99,125.5,99,206.5,203,206.5], null, null, null],
    [[110,111,110,218,149,218], null, null, null]
  ]},
  "1565": {n: "Монтьор на селскостопанска техника", d: [
    [[42.5,42.5,0,206,206,0], null, [52,52,0,220.5,220.5,0], null],
    [[68,68,0,235,235,0], null, null, null],
    [[80.5,80.5,0,309,309,0], null, null, null]
  ]},
}};
