// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Asenovgrad
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["1600128"] = {n: "ПГ Св. П. Евтимий", f: "ПГ Св. Патриарх Евтимий", c: false, p: {
  "3243": {n: "Графичен дизайн, Графичен дизайнер", d: [
    [[78,78,101,193,193,129.5], null, [232,0,232,232,0,232], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2813": {n: "Производство на облекло от текстил, Оператор в производтсвото на облекло", d: [
    [[65,91,65,188,138.5,188], null, [178.25,0,178.25,195,0,195], null],
    [[74,88,74,293,106,293], null, [68,68,0,161.5,161.5,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2811": {n: "Фризьорство", d: [
    [[41,41,82,219,155,219], null, [65,117,65,117,117,65], null],
    [[48,48,62,265,139,265], null, [172.25,0,172.25,172.25,0,172.25], null],
    [[94.5,113,94.5,250,241.75,250], [40,40,0,88,88,0], [144.5,0,144.5,200.25,0,200.25], [111,111,0,111,111,0]],
    [[89,95,89,250,242.5,250], [62,62,158.5,158.5,80,158.5], null, null]
  ]},
  "5039": {n: "Оператор в шевното производство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[68.5,68.5,75,248.5,156.5,248.5], [54,54,54,54,54,54], null, null],
    [null, null, null, null]
  ]},
  "28913": {n: "Устойчива мода", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[66,66,73,205.5,97,205.5], [58,58,65,65,58,65], null, null]
  ]},
}};
ruoSchools["1600618"] = {n: "ПГ Иван Асен II", f: "ПГ Цар Иван Асен II", c: false, p: {
  "2218": {n: "Електрически инсталации АЕ", d: [
    [[174,174,0,206,206,0], [161,161,0,196,196,0], [228,228,0,228,228,0], null],
    [[174.5,174.5,203,249.5,249.5,203], [160,160,0,239.5,239.5,0], null, null],
    [[176.5,176.5,182,229,229,182], [145,145,0,228.5,228.5,0], null, null],
    [null, null, null, null]
  ]},
  "2226": {n: "Електронна търговия АЕ", d: [
    [[172,172,173,352,352,228], [162.5,162.5,0,186,186,0], null, null],
    [[188,188,229,337,275,337], [196.5,196.5,0,196.5,196.5,0], null, null],
    [[194,194,201,336,258,336], [147,147,201,240,240,201], null, null],
    [null, null, null, null]
  ]},
  "2214": {n: "Електрообзавеждане на производството АЕ", d: [
    [[215,215,0,343,343,0], null, null, null],
    [[160,160,189,312,312,189], [159,159,189,189,159,189], null, null],
    [[236,236,0,329.5,329.5,0], null, null, null],
    [null, null, null, null]
  ]},
  "2190": {n: "Компютърна техника и технологии АЕ", d: [
    [[206.5,207,206.5,363,363,329.5], [196,206,196,277.5,277.5,196], null, null],
    [[201.5,206,201.5,358.5,358.5,265.5], [231.5,231.5,0,231.5,231.5,0], null, null],
    [[184,184,186,394.5,394.5,186], [157,157,182,207,207,182], null, null],
    [null, null, null, null]
  ]},
  "2224": {n: "Металургия на цветните метали АЕ", d: [
    [[79,79,90,144,144,123], [120,120,0,144,144,0], [161,161,172.5,172.5,172.5,172.5], null],
    [[122,122,136,347,281,347], [77,77,136,159,136,159], null, null],
    [[72,72,112,194.5,170,194.5], [57,57,0,150.5,150.5,0], [177,177,0,177,177,0], null],
    [null, null, null, null]
  ]},
  "2220": {n: "Мехатроника АЕ", d: [
    [[152,152,162,244.5,244.5,162], [147,152,147,152,152,147], [195,0,195,195,0,195], null],
    [[151,151,164,260,260,252], [136.5,0,136.5,136.5,0,136.5], null, null],
    [[163,163,164,304,304,164], null, null, null],
    [null, null, null, null]
  ]},
  "29894": {n: "Електрически инсталации", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[176.5,176.5,0,342,342,0], [168,168,0,181,181,0], null, null]
  ]},
  "29896": {n: "Електронна търговия, маркетинг и реклама", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[201,209.5,201,321.5,321.5,282], null, null, null]
  ]},
  "29888": {n: "Електроснабдяване и електрообзавеждане", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[214,214,0,427,427,0], [187.5,187.5,0,187.5,187.5,0], null, null]
  ]},
  "29891": {n: "Индустриална мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[171,171,176,240,240,176], null, null, null]
  ]},
  "29887": {n: "Компютърни системи и технологии", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[197,210,197,411.5,411.5,330], [197,218,197,275,275,202], null, null]
  ]},
  "29892": {n: "Металургия на цветните и благородните метали", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[116,116,120,197,166,197], [109,109,190,190,164,190], null, null]
  ]},
}};
ruoSchools["1600617"] = {n: "ПГ по хран.-вк. техн.", f: "ПГ по хранително-вкусови технологии", c: false, p: {
  "2605": {n: "Кетъринг, АЕ", d: [
    [[106.5,165.5,106.5,364,270.5,364], [238.5,0,238.5,238.5,0,238.5], [54,54,203.5,203.5,184,203.5], [161,0,161,256,0,256]],
    [[89,89,197,214,140,214], null, [56,69,56,319,319,294], null],
    [[130,130,203.5,354.5,314.5,354.5], [271.25,0,271.25,271.25,0,271.25], [75,75,118,212.5,170,212.5], [160.5,160.5,0,160.5,160.5,0]],
    [null, null, null, null]
  ]},
  "2601": {n: "Производство на кулинарни изделия и напитки, АЕ", d: [
    [[65,65,100,290.75,251.5,290.75], [90.5,90.5,223.25,223.25,171.5,223.25], [161,0,161,217.5,0,217.5], [157.75,157.75,0,206.5,206.5,0]],
    [[56,56,199,319,319,294], null, [229.5,229.5,0,229.5,229.5,0], null],
    [[93,93,148.5,294.5,294.5,200], [164,164,0,164,164,0], [123,171,123,173,173,123], [109,109,142.5,222.5,222.5,142.5]],
    [null, null, null, null]
  ]},
  "28185": {n: "Готварство - Английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[91,91,103.5,364.5,206.25,364.5], [208.5,0,208.5,227,0,227], null, null]
  ]},
  "28186": {n: "Ресторантьорство и кетъринг - Английски език", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[72,72,122,278,196,278], [153.5,0,153.5,153.5,0,153.5], null, null]
  ]},
}};
ruoSchools["1600116"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "1154": {n: "Предприемачески AE", d: [
    [[229.5,238.5,229.5,380,339.5,380], [226,227.5,226,339.5,339.5,239], [218,238.5,218,238.5,238.5,218], null],
    [[229,229,230.5,367.5,317,367.5], [192.5,192.5,217,221.5,192.5,221.5], null, null],
    [[248,248,251.5,376,328.5,376], [246.5,293.5,246.5,293.5,293.5,246.5], null, null],
    [[260.5,277,260.5,402,355.5,402], [318,0,318,318,0,318], null, null]
  ]},
  "1157": {n: "Природни науки AE", d: [
    [[225,227,225,436,284,436], [219,0,219,296.5,0,296.5], null, null],
    [[234,234,242,401.5,381.5,401.5], [203,203,230.5,230.5,221,230.5], null, null],
    [[240.5,240.5,246.5,455,406,455], [235,319,235,319,319,308], null, null],
    [[233,233,240,386,362,386], [233,233,247,375.5,257.5,375.5], null, null]
  ]},
  "1161": {n: "Софтуерни и хардуерни науки AE", d: [
    [[249.5,249.5,249.5,379,376.5,379], [246.5,246.5,0,253,253,0], null, null],
    [[241.5,241.5,256,416,397.5,416], [231.5,231.5,289,289,240,289], null, null],
    [[253,253,267.5,388,388,385], [298.5,298.5,0,381.5,381.5,0], null, null],
    [[256,260,256,414.5,384.5,414.5], [260.5,294,260.5,294,294,260.5], null, null]
  ]},
  "3848": {n: "Чужди езици, АЕ", d: [
    [[266,277.5,266,428.5,406.5,428.5], [283.5,0,283.5,372.5,0,372.5], [307,0,307,307,0,307], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4574": {n: "Екскурзовод АЕ", d: [
    [null, null, null, null],
    [[222.5,222.5,228,415.5,301,415.5], [189.5,189.5,0,208.75,208.75,0], null, null],
    [[221.5,225.75,221.5,417,382.25,417], [209.5,225.75,209.5,333.25,225.75,333.25], null, null],
    [[261,261,284,412.5,375,412.5], [266.5,266.5,300.5,362.75,266.5,362.75], null, null]
  ]},
}};
ruoSchools["1600114"] = {n: "СУ Княз Борис I", f: "СУ Княз Борис I", c: false, p: {
  "3513": {n: "Предприемачески", d: [
    [[244.25,256.25,244.25,380.25,380.25,313], [238,238,242.75,283.5,265,283.5], null, null],
    [[166.5,172,166.5,383.75,383.75,347.75], [119,119,152,288.25,288.25,284], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3512": {n: "Природни науки", d: [
    [[232,236.25,232,451,342.5,451], [218.25,229.5,218.25,250,229.5,250], null, null],
    [[216.75,251.5,216.75,476,476,394], [136,136,373.25,373.25,146,373.25], null, null],
    [[185,185,186,413,384.25,413], [163,173.5,163,373,246.5,373], [328,0,328,328,0,328], null],
    [[197,197,197,407,326.5,407], [180,197,180,234.25,232,234.25], null, null]
  ]},
  "3511": {n: "Икономическо развитие", d: [
    [[324.25,335,324.25,474.25,446.5,474.25], [313.5,313.5,353.75,353.75,313.5,353.75], [363,0,363,363,0,363], [232.75,232.75,0,232.75,232.75,0]],
    [[309.5,320.5,309.5,456.25,394.75,456.25], [398,0,398,398,0,398], null, null],
    [[328.25,336.5,328.25,453,439.25,453], [313.75,0,313.75,407.5,0,407.5], null, null],
    [[172.5,178.5,172.5,385.75,351.25,385.75], [178.5,178.5,191,351.25,351.25,234], null, null]
  ]},
  "29772": {n: "Мениджмънт и икономика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[267,267,276,489.5,413,489.5], [348.75,0,348.75,402.75,0,402.75], null, null]
  ]},
}};
