// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Devin
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["2100402"] = {n: "ПГ по електротехника", f: "ПГ по електротехника А.С. Попов", c: false, p: {
  "4289": {n: "Автоматизирани системи /обучение чрез работа/", d: [
    [[30,0,0,118,0,0], null, [173,0,0,220,0,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2520": {n: "Електротехник", d: [
    [[128,0,0,395,0,0], [64,0,0,64,0,0], [215,0,0,215,0,0], null],
    [[30,0,0,223.5,0,0], null, null, null],
    [[30,0,0,247,0,0], null, [30,0,0,247,0,0], null],
    [null, null, null, null]
  ]},
  "2722": {n: "Изпълнител на термални процедури / обучение чрез работа/", d: [
    [[72.5,0,0,371.25,0,0], null, [223.5,0,0,223.5,0,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3915": {n: "Ресторантьор /обучение чрез работа/", d: [
    [[30,0,0,30,0,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4476": {n: "Помощник - възпитател", d: [
    [null, null, null, null],
    [[30,0,0,300,0,0], null, [30,0,0,30,0,0], null],
    [null, null, null, null],
    [[153,0,153,226,0,226], null, null, null]
  ]},
  "28271": {n: "Електроснабдяване и електрообзавеждане", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[42,42,0,326,326,0], null, null, null]
  ]},
}};
ruoSchools["2100401"] = {n: "СУ Христо Ботев", f: "СУ Христо Ботев", c: false, p: {
  "2481": {n: "Математически", d: [
    [[249,0,0,417.5,0,0], null, null, null],
    [[203,0,0,454.5,0,0], null, null, null],
    [[140,0,0,440,0,0], [140,0,0,216,0,0], null, null],
    [[30,135,30,444.5,360,444.5], null, null, null]
  ]},
  "2485": {n: "Природни науки", d: [
    [[239,0,0,402.5,0,0], [253.5,0,0,253.5,0,0], null, null],
    [[62,0,0,413,0,0], null, [133,0,0,133,0,0], null],
    [[232,0,0,462,0,0], [229,0,0,231,0,0], null, null],
    [[172,253.5,172,424,361,424], null, null, null]
  ]},
}};
