// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Elena
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["300305"] = {n: "СУ Иван Момчилов", f: "СУ Иван Николов Момчилов", c: false, p: {
  "595": {n: "Горско стопанство", d: [
    [[109,0,0,232,0,0], null, null, null],
    [[92,0,0,304.5,0,0], null, null, null],
    [[90,0,0,236.5,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "606": {n: "Ресторантьор", d: [
    [[94,0,0,284.5,0,0], null, null, null],
    [null, null, null, null],
    [[30,0,0,225,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "592": {n: "Софтуерни и хардуерни науки", d: [
    [[132,0,0,429,0,0], null, null, null],
    [[116,0,0,449.5,0,0], null, [138,0,0,183,0,0], null],
    [[128,0,0,401,0,0], null, null, null],
    [[89,0,0,377,0,0], null, null, null]
  ]},
  "29228": {n: "Хотелиерство, ресторантьорство и кетъринг, Ресторантьорство и кетъринг", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[52,0,0,267.5,0,0], null, null, null]
  ]},
  "29231": {n: "Горско стопанство, Механизация на горското стопанство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[93,0,0,268,0,0], null, null, null]
  ]},
}};
