// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Peshtera
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1304357"] = {n: "ОбУ Л. Каравелов", f: "ОбУ Любен Каравелов", c: false, p: {
  "3234": {n: "Стругар", d: [
    [[50,50,0,204,204,0], null, null, null],
    [[136,136,0,197,197,0], null, [30,30,0,92,92,0], null],
    [[118,118,0,251,251,0], null, null, null]
  ]},
  "3186": {n: "Обущар", d: [
    [[46,46,131,215,46,215], null, [156,0,156,156,0,156], null],
    [[133,145,133,202,184,202], null, [30,30,134,146,146,134], null],
    [[155,0,155,259,0,259], null, [41,41,120,132,132,121], null]
  ]},
  "4006": {n: "Шивач", d: [
    [[41,0,41,197,0,197], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
}};
ruoSchools["1302819"] = {n: "ПГ по хран.-вк. техн.", f: "ПГ по хран.-вк. технологии", c: false, p: {
  "3369": {n: "Биотехнолог- ДУАЛНА", d: [
    [[64,84,64,422.5,186,422.5], null, null, null],
    [[41,0,41,406.5,0,406.5], null, [30,30,108,108,30,108], null],
    [[82,82,270,397.5,292,397.5], null, [30,30,0,30,30,0], [132,132,0,132,132,0]]
  ]},
  "3375": {n: "Готвач", d: [
    [[83,83,113,227.5,202,227.5], [67,67,0,67,67,0], null, null],
    [[41,41,119,294,248,294], null, [197,197,0,197,197,0], null],
    [[143,143,151,279,225,279], null, null, null]
  ]},
  "3377": {n: "Организатор Интернет приложения", d: [
    [[78,78,138.5,258,258,138.5], [85,85,0,85,85,0], null, null],
    [[136,136,261,327,271,327], [247,247,0,247,247,0], [247,247,0,261,261,0], null],
    [[109,231,109,312,280,312], null, [180,180,0,180,180,0], [287,287,0,287,287,0]]
  ]},
}};
ruoSchools["1302630"] = {n: "СУ Кл. Охридски", f: "СУ Климент Охридски", c: false, p: {
  "3262": {n: "Софтуерни и хардуерни науки", d: [
    [[166,201.5,166,373,373,354.5], [127,132,127,166,143,166], [138.5,0,138.5,138.5,0,138.5], null],
    [[139,139,168,425.5,285,425.5], null, null, [119,0,119,119,0,119]],
    [[177,177,202,388.5,388.5,375], null, null, null]
  ]},
}};
