// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Topolovgrad
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["2611018"] = {n: "СУ Петър Берон", f: "СУ Д-р Петър Берон", c: false, p: {
  "3086": {n: "Природни науки", d: [
    [[94,0,0,412.5,0,0], null, null, null],
    [[85,274,85,411,391.5,411], null, null, null],
    [[30,0,0,421,0,0], null, null, null],
    [[132,0,0,356,0,0], null, null, null]
  ]},
  "2643": {n: "Машинен оператор", d: [
    [[30,0,0,401,0,0], null, null, null],
    [[82,82,182,252,252,248], null, null, null],
    [[46,0,0,343,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "2653": {n: "Монтьор на транспортна техника", d: [
    [[30,0,0,238,0,0], null, null, null],
    [[30,30,78,254,254,142], null, null, [158,158,0,158,158,0]],
    [[30,0,0,259,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "29257": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[84,0,0,250,0,0], null, null, null]
  ]},
  "29258": {n: "Машини, съоръжения и системи в ундустрията", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[82,0,0,334,0,0], null, null, null]
  ]},
}};
