// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Pernik
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1403214"] = {n: "6 СУ", f: "6 СУ Св. Св. Кирил и Методий", c: false, p: {
  "4382": {n: "Предприемачески профил - предприемачество", d: [
    [[30,0,0,366.5,0,0], [200,0,0,256.5,0,0], null, null],
    [[30,0,0,290,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "2488": {n: "Съдебен служител - съдебна администрация", d: [
    [[41,0,0,290,0,0], [158.5,0,0,235,0,0], null, null],
    [[164,0,0,430,0,0], null, null, null],
    [[223,0,0,424.5,0,0], [257,0,0,257,0,0], null, null]
  ]},
  "x0edf3": {n: "Банкова охрана и инкасова дейност", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[198,0,0,319,0,0], null, null, null]
  ]},
}};
ruoSchools["1403220"] = {n: "ГПЧЕ", f: "ГПЧЕ Симеон Радев", c: false, p: {
  "1887": {n: "Софтуерни и хардуерни науки-информатика и информационни технологии(АЕ)", d: [
    [[257,0,0,401,0,0], [255.5,0,0,297.5,0,0], null, null],
    [[232.5,0,0,376.5,0,0], null, null, null],
    [[235,0,0,392,0,0], [190,0,0,298,0,0], null, null]
  ]},
  "1893": {n: "Софтуерни и хардуерни науки-информатика и информационни технологии(ФЕ)", d: [
    [[203.5,0,0,293,0,0], [199.5,0,0,251,0,0], null, null],
    [[211,0,0,364.5,0,0], null, null, null],
    [[140,0,0,356.5,0,0], [92,0,0,166,0,0], null, null]
  ]},
  "1855": {n: "Чужди езици-английски език и испански език", d: [
    [[282,0,0,455,0,0], [272.5,0,0,273,0,0], null, null],
    [[308.5,0,0,462,0,0], null, null, null],
    [[287.5,0,0,440,0,0], [272,0,0,315,0,0], null, null]
  ]},
  "1878": {n: "Чужди езици-немски език и английски език", d: [
    [[290,0,0,471.5,0,0], [269,0,0,314.5,0,0], null, null],
    [[286.5,0,0,444,0,0], null, null, null],
    [[216,0,0,479,0,0], [119,0,0,393,0,0], null, null]
  ]},
  "3021": {n: "Чужди езици-френски език и английски език", d: [
    [[239,0,0,416,0,0], [231.5,0,0,260,0,0], null, null],
    [[249,0,0,364,0,0], null, null, null],
    [[216,0,0,453.5,0,0], [191,0,0,297.5,0,0], null, null]
  ]},
}};
ruoSchools["1403213"] = {n: "5 СУ", f: "5 СУ Петко Рачов Славейков", c: false, p: {
  "3071": {n: "Спедитор логистик-спедиция, транспортна и складова логистика", d: [
    [[68,0,0,403,0,0], [129,0,0,210,0,0], null, null],
    [[104,0,0,321,0,0], null, null, null],
    [[78,0,0,324,0,0], [48,0,0,194.5,0,0], null, null]
  ]},
}};
ruoSchools["1403219"] = {n: "ПМГ", f: "ПМГ Христо Смирненски", c: false, p: {
  "1574": {n: "Математически профил - математика и информатика", d: [
    [[389,0,0,489,0,0], [359.5,0,0,384.5,0,0], null, null],
    [[423,0,0,486.5,0,0], null, null, null],
    [[441,0,0,481.5,0,0], [426,0,0,433,0,0], null, null]
  ]},
  "1583": {n: "Приложен програмист - приложно програмиране", d: [
    [[357.5,0,0,411.5,0,0], [323,0,0,329.5,0,0], null, null],
    [[373.5,0,0,459,0,0], null, null, null],
    [[332,0,0,433,0,0], [319.5,0,0,423,0,0], null, null]
  ]},
  "4206": {n: "Природни науки - биология и здравно образование и химия и oпазване на околната среда(АЕ)", d: [
    [[333,0,0,439.5,0,0], [333,0,0,333,0,0], null, null],
    [[348,0,0,469,0,0], null, null, null],
    [[335.5,0,0,444,0,0], [316,0,0,364,0,0], null, null]
  ]},
  "4203": {n: "Софтуерни и хардуерни науки - информатика и информационни технологии", d: [
    [[315.5,0,0,405.5,0,0], [302,0,0,323.5,0,0], null, null],
    [[334.5,0,0,422,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "5078": {n: "Природни науки - биология и здравно образование и химия и опазване на околната среда(НЕ)", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[342,0,0,459.5,0,0], [331.5,0,0,332,0,0], null, null]
  ]},
}};
ruoSchools["1403236"] = {n: "ПГ по икономика", f: "ПГ по икономика", c: false, p: {
  "1935": {n: "Икономист - икономика и мениджмънт", d: [
    [[268.5,0,0,382,0,0], [247,0,0,343.5,0,0], null, null],
    [[260,0,0,383,0,0], null, null, null],
    [[312,0,0,383.5,0,0], [300.5,0,0,305.5,0,0], null, null]
  ]},
  "1920": {n: "Икономист информатик - икономическа информатика(AE)", d: [
    [[252,0,0,429,0,0], [227.5,0,0,295,0,0], null, null],
    [[236,0,0,421.5,0,0], null, null, null],
    [[252.5,0,0,388.5,0,0], [241,0,0,302,0,0], null, null]
  ]},
  "1875": {n: "Организатор интернет приложения - електронна търговия", d: [
    [[232,0,0,332,0,0], [227.5,0,0,282.5,0,0], null, null],
    [[241.5,0,0,348,0,0], null, null, null],
    [[255,0,0,371.5,0,0], [243,0,0,290,0,0], null, null]
  ]},
  "1930": {n: "Техник на компютърни системи - компютърни мрежи", d: [
    [[244.5,0,0,340.5,0,0], [233,0,0,284.5,0,0], null, null],
    [[232,0,0,345.5,0,0], null, null, null],
    [[240,0,0,405.5,0,0], [222,0,0,243,0,0], null, null]
  ]},
  "5137": {n: "Икономист информатик - икономическа информатика(ИЕ)", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[241.5,0,0,382,0,0], [228.5,0,0,268.5,0,0], null, null]
  ]},
}};
ruoSchools["1403237"] = {n: "ПГ по облекло", f: "Професионална гимназия по облекло и туризъм", c: false, p: {
  "1754": {n: "Готвач - производство на кулинарни иделия и напитки", d: [
    [[30,0,0,262.5,0,0], [30,0,0,262.5,0,0], null, null],
    [[66,0,0,293,0,0], null, null, null],
    [[30,0,0,221,0,0], [119,0,0,221,0,0], null, null]
  ]},
  "3740": {n: "Дизайнер - рекламна графика", d: [
    [[30,0,0,340.5,0,0], [175,0,0,246,0,0], null, null],
    [[54,0,0,295,0,0], null, null, null],
    [null, null, null, null]
  ]},
}};
ruoSchools["1403233"] = {n: "ПГ по техн. и енерг.", f: "ПГ по техника и енергетика", c: false, p: {
  "1599": {n: "Техник на компютърни системи - Компютърна техника и технологии", d: [
    [[95,0,0,274.5,0,0], [198.5,0,0,251,0,0], null, null],
    [[167,0,0,293,0,0], null, null, null],
    [[120,0,0,311,0,0], [199.5,0,0,199.5,0,0], null, null]
  ]},
  "1607": {n: "Техник по комуникационни системи - Телекомуникационни системи", d: [
    [[128,0,0,254.5,0,0], [200,0,0,254.5,0,0], null, null],
    [[123,0,0,201,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "3088": {n: "Техник по транспортна техника - Автомобилна мехатроника", d: [
    [[30,0,0,322,0,0], [110,0,0,247,0,0], null, null],
    [[203,0,0,291,0,0], null, null, null],
    [[167,0,0,261,0,0], [198.5,0,0,198.5,0,0], null, null]
  ]},
  "1617": {n: "Техник по транспортна техника - Автотранспортна техника", d: [
    [[41,0,0,265,0,0], [169,0,0,238,0,0], null, null],
    [[167,0,0,285,0,0], null, null, null],
    [[123,0,0,337,0,0], [139,0,0,139,0,0], null, null]
  ]},
  "1621": {n: "Техник на енергийни съоръжения и инсталации - Възобновяеми енергийни източници", d: [
    [null, null, null, null],
    [[30,0,0,304.5,0,0], null, null, null],
    [[121,0,0,258,0,0], null, null, null]
  ]},
}};
ruoSchools["1403234"] = {n: "ПГ по техн. и строит.", f: "ПГ по техника и строителство", c: false, p: {
  "0710": {n: "Дизайнер - интериорен дизайн", d: [
    [[285,0,0,446,0,0], [368.5,0,0,368.5,0,0], null, null],
    [[249.25,0,0,432,0,0], null, null, null],
    [[217.5,0,0,450.25,0,0], [209.5,0,0,209.5,0,0], null, null]
  ]},
  "0760": {n: "Електротехник - електрически инсталации", d: [
    [[219,0,0,293.5,0,0], [218,0,0,231,0,0], null, null],
    [[203,0,0,406.5,0,0], null, null, null],
    [[220,0,0,320,0,0], [209,0,0,209,0,0], null, null]
  ]},
  "0737": {n: "Компютърен график - компютърна графика", d: [
    [[291.5,0,0,401.25,0,0], [286,0,0,286,0,0], null, null],
    [[225.5,0,0,415.75,0,0], null, null, null],
    [[205,0,0,417,0,0], null, null, null]
  ]},
  "xa67ca": {n: "Строителен техник - водно строителство", d: [
    [[173,0,0,209,0,0], [161,0,0,209,0,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "0724": {n: "Строителен техник - строителство и архитектура", d: [
    [[202,0,0,321,0,0], [199,0,0,235,0,0], null, null],
    [[202,0,0,301,0,0], null, null, null],
    [[200,0,0,319.5,0,0], null, null, null]
  ]},
  "4644": {n: "Техник-реставратор-архитектурна реставрация", d: [
    [null, null, null, null],
    [[203,0,0,282,0,0], null, null, null],
    [[205.5,0,0,309,0,0], [196,0,0,210.5,0,0], null, null]
  ]},
}};
ruoSchools["1403204"] = {n: "ОбУ Темелко Ненков", f: "ОбУ Темелко Ненков", c: false, p: {
  "2734": {n: "Машинен монтьор - Металообработващи машини", d: [
    [[49,0,0,175,0,0], null, null, null],
    [[84,0,0,144,0,0], null, null, null],
    [[58,0,0,158,0,0], null, null, null]
  ]},
  "2741": {n: "Оператор в производството на облекло - Производство на облекло от текстил", d: [
    [[71,0,0,179,0,0], null, null, null],
    [[30,0,0,174,0,0], null, null, null],
    [[103,0,0,222,0,0], null, null, null]
  ]},
}};
ruoSchools["1403216"] = {n: "СУРИЧЕ П. Берон", f: "СУРИЧЕ Д-р Петър Берон", c: false, p: {
  "0862": {n: "Организатор на туристическа агентска дейност- Oрганизация на туризма и свободното време (АЕ)", d: [
    [[210.5,0,0,351.5,0,0], [202,0,0,269.5,0,0], null, null],
    [[238,0,0,403,0,0], null, null, null],
    [[264.5,0,0,419,0,0], [264.5,0,0,264.5,0,0], null, null]
  ]},
  "3815": {n: "Чужди езици - английски език и немски език", d: [
    [[257,0,0,431,0,0], [239,0,0,331,0,0], null, null],
    [[251,0,0,394,0,0], null, null, null],
    [null, null, null, null]
  ]},
}};
ruoSchools["1403235"] = {n: "ПГ Мария Кюри", f: "Технологична ПГ Мария Кюри", c: false, p: {
  "x3a5a2": {n: "Маникюрист-педикюрист- Организация и технология на маникюрната и педикюрната дейност", d: [
    [[54,0,0,273.5,0,0], [141,0,0,273.5,0,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "xc0835": {n: "Машинен оператор - машини за гореща обработка на металите (дуална форма на обучение)", d: [
    [[68,0,0,200,0,0], [144,0,0,153,0,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "x7540a": {n: "Химик - технолог - технология на фармацевтични и парфюмерийно - козметични продукти (дуална форма на обучение)", d: [
    [[158,0,0,251,0,0], [153,0,0,211,0,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4617": {n: "Еколог - екология и опазване на околната среда", d: [
    [null, null, null, null],
    [[103,0,0,262.5,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "4609": {n: "Електромонттьор - електрообзавеждане на производството", d: [
    [null, null, null, null],
    [[67,0,0,206,0,0], null, null, null],
    [[41,0,0,261,0,0], [117,0,0,261,0,0], null, null]
  ]},
  "1078": {n: "Химик - технолог - технология на фармацевтични и парфюмерийно - козметични продукти", d: [
    [null, null, null, null],
    [[104,0,0,308.5,0,0], null, null, null],
    [[99,0,0,331,0,0], [175,0,0,175,0,0], null, null]
  ]},
}};
