// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Pazardzhik
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["1304290"] = {n: "ЕГ", f: "ЕГ Бертолт Брехт", c: false, p: {
  "3103": {n: "Профил \"Чужди езици\" - английски език с немски език", d: [
    [[338,338.5,338,487.5,429.5,487.5], [337,337,337,337,337,337], [271,271,0,271,271,0], [271,271,0,271,271,0]],
    [[348,348,348.5,485,431,485], [335.5,345,335.5,346,345,346], null, null],
    [[360.5,362.5,360.5,465.5,459,465.5], [358.5,358.5,358.5,360,358.5,360], [333.5,333.5,0,333.5,333.5,0], null],
    [[359,359,360.5,486.5,443,486.5], null, null, null]
  ]},
  "3102": {n: "Профил \"Чужди езици\" - немски език с английски език", d: [
    [[254.5,254.5,272,484.5,484.5,432.5], [218,224,218,333.5,324,333.5], [173.5,173.5,181,181,178,181], null],
    [[290,290.5,290,484.5,484.5,471.5], [260,260,261,332,332,331.5], [341,0,341,366.5,0,366.5], [250.5,0,250.5,266,0,266]],
    [[317,333.5,317,492,487,492], [300,300.5,300,357.5,353,357.5], [192.5,275,192.5,275,275,192.5], null],
    [[286,287,286,480,436.5,480], null, null, null]
  ]},
  "3104": {n: "Профил \"Чужди езици\" - френски език с английски език", d: [
    [[246,250,246,332.5,325,332.5], [191,215.5,191,332.5,305.5,332.5], [191,0,191,191,0,191], null],
    [[262,263,262,381,371.5,381], [237,237,240,291.5,291.5,257.5], [325,360,325,360,360,325], [241.5,241.5,0,241.5,241.5,0]],
    [[252,257.5,252,342.5,302.5,342.5], [239.5,239.5,241,300,300,294], [198,251,198,251,251,234.5], [187,187,0,187,187,0]],
    [[248.5,248.5,251.5,413,282.5,413], null, null, null]
  ]},
}};
ruoSchools["1301139"] = {n: "ПГ по икономика", f: "ПГ по икономика и мениджмънт", c: false, p: {
  "3290": {n: "Икономика и мениджмънт", d: [
    [[253.5,255,253.5,442,352.5,442], [228,0,228,335.5,0,335.5], null, null],
    [[267,275,267,412,412,400], [266,0,266,279,0,279], [238,249.5,238,249.5,249.5,238], null],
    [[286,286,287.5,442.5,404.5,442.5], [259.5,0,259.5,351,0,351], null, null],
    [null, null, null, null]
  ]},
  "3292": {n: "Икономическа информатика", d: [
    [[225.5,227.5,225.5,445.5,445.5,390.5], [213,216,213,312.5,239,312.5], null, null],
    [[244.5,244.5,247,412.5,375.5,412.5], [231,231.5,231,328,249,328], [405.5,0,405.5,405.5,0,405.5], null],
    [[258,258,259,450.5,434.5,450.5], [256,257,256,298,298,259], null, null],
    [null, null, null, null]
  ]},
  "3287": {n: "Митническа и данъчна администрация", d: [
    [[213,218.5,213,344,344,298.5], [203,204,203,227,219,227], [311.5,311.5,0,311.5,311.5,0], null],
    [[211,211.5,211,413.5,245.5,413.5], [194,206,194,242,227.5,242], [323,0,323,323,0,323], [299,299,0,299,299,0]],
    [[248,250,248,354.5,354.5,331], [242,247.5,242,296.5,296.5,294], [382.5,0,382.5,382.5,0,382.5], [207,0,207,207,0,207]],
    [null, null, null, null]
  ]},
  "3288": {n: "Оперативно счетоводство", d: [
    [[187,187,202,365.5,216,365.5], [177,179.5,177,263.5,197,263.5], [188.5,198,188.5,211,198,211], [177,0,177,177,0,177]],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3291": {n: "Съдебна администрация", d: [
    [[241,248,241,393,393,362.5], [229,0,229,230,0,230], null, null],
    [[243,280.5,243,383.5,298,383.5], [238.5,0,238.5,239.5,0,239.5], null, null],
    [[284,291,284,456.5,451,456.5], [277.5,277.5,329.5,329.5,306.5,329.5], null, null],
    [null, null, null, null]
  ]},
  "4169": {n: "Бизнес администрация", d: [
    [null, null, null, null],
    [[239.5,240,239.5,316,270,316], [229,229.5,229,255,238,255], [261.5,261.5,0,261.5,261.5,0], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "28715": {n: "професия \"Икономическа информатика\" с интензивно изучаване на чужд език - английски, придобиване на III степен на професионална квалификация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[251,251,251.5,430.5,430.5,419], null, null, null]
  ]},
  "28722": {n: "професия \"Мениджмънт и икономика\" с интензивно изучаване на чужд език - английски, придобиване на III степен на професионална квалификация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[252,252,257,470.5,435.5,470.5], null, null, null]
  ]},
  "28741": {n: "професия \"Митническо обслужване\" с интензивно изучаване на чужд език - немски, придобиване на III степен на професионална квалификация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[212,212,215,459.5,272.5,459.5], null, null, null]
  ]},
  "28718": {n: "професия \"Съдебна администрация\" с интензивно изучаване на чужд език - английски, придобиване на III степен на професионална квалификация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[271,279,271,412.5,334,412.5], null, null, null]
  ]},
}};
ruoSchools["1302769"] = {n: "ПГ по механоел.", f: "ПГ по механоелектротехника", c: false, p: {
  "607": {n: "Професия Графичен дизайнер Специалност Графичен дизайн", d: [
    [[94,94,182.5,262.25,253.25,262.25], [94,94,183,191.5,191.5,183], [104.5,104.5,183,218,218,216.5], [148.75,148.75,157.5,159.5,159.5,157.5]],
    [[93.5,93.5,189,320,299.25,320], null, [80,80,230,230,193,230], [174.5,0,174.5,174.5,0,174.5]],
    [[204,204,243,382.25,382.25,360.25], [195,195,243,287.25,247.25,287.25], [202.25,202.25,0,202.25,202.25,0], [240,0,240,240,0,240]],
    [null, null, null, null]
  ]},
  "619": {n: "Професия Електротехник Специалност Електрообзавеждане на производството", d: [
    [[125,125,0,344.25,344.25,0], [109,109,0,109,109,0], null, null],
    [[154.5,154.5,0,378.5,378.5,0], [235.75,235.75,0,235.75,235.75,0], [158,158,0,158,158,0], null],
    [[104,104,0,275,275,0], null, null, null],
    [null, null, null, null]
  ]},
  "597": {n: "Професия Електротехник Специалност Електрообзавеждане на транспортна техника", d: [
    [[142.5,142.5,0,336.25,336.25,0], [136,136,0,199.5,199.5,0], null, null],
    [[193,193,0,404.5,404.5,0], [179.5,179.5,0,187.5,187.5,0], null, null],
    [[62,62,0,405,405,0], [129,129,0,146.5,146.5,0], [166.75,166.75,0,313.25,313.25,0], null],
    [null, null, null, null]
  ]},
  "602": {n: "Професия Програмист на изкуствен интелект, Специалност Програмиране на изкуствен интелект", d: [
    [[101.5,101.5,157.5,305.25,305.25,157.5], [157.5,161.75,157.5,244.5,244.5,157.5], [114,114,0,306.25,306.25,0], [136.5,136.5,0,136.5,136.5,0]],
    [[145,145,0,281,281,0], [240,240,0,247.25,247.25,0], [176,176,0,258.75,258.75,0], null],
    [[200,200,0,382.75,382.75,0], [221.75,221.75,0,356,356,0], [250.5,250.5,0,269,269,0], null],
    [null, null, null, null]
  ]},
  "587": {n: "Професия Системен програмист Специалност Системно програмиране", d: [
    [[243.5,243.5,342.75,395.75,395.75,366.75], [236,236,0,253.5,253.5,0], null, null],
    [[77,77,182.75,359.5,359.5,182.75], [212,212,0,268.25,268.25,0], [170,170,0,258.75,258.75,0], [244.75,244.75,0,244.75,244.75,0]],
    [[41,41,0,322.5,322.5,0], [186,186,0,186,186,0], [170,170,178.5,259.75,186,259.75], [167.25,186,167.25,186,186,167.25]],
    [null, null, null, null]
  ]},
  "4152": {n: "Професия Техник на електронна техника, Специалност Микропроцесорна техника", d: [
    [[78,78,0,306.25,306.25,0], [78,78,0,148.75,148.75,0], null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "613": {n: "Професия Техник по транспортна техника Специалност Автотранспортна техника", d: [
    [[196,196,0,274.5,274.5,0], null, null, null],
    [[221,221,0,388.25,388.25,0], [150.5,150.5,0,184,184,0], null, null],
    [[200.5,200.5,0,379.75,379.75,0], [205.25,205.25,0,205.25,205.25,0], [82.5,82.5,0,82.5,82.5,0], null],
    [null, null, null, null]
  ]},
  "4463": {n: "Професия Техник по транспортна техника, Специалност Електрически превозни средства", d: [
    [[86,86,0,213,213,0], [86,86,0,86,86,0], [163,163,0,163,163,0], [78,78,0,78,78,0]],
    [[169.5,169.5,0,329,329,0], [105.5,105.5,0,105.5,105.5,0], null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "28228": {n: "Автомобилна техника и мехатроника - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[103,103,0,300.25,300.25,0], null, null, null]
  ]},
  "28257": {n: "Графичен дизайн - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[155.5,155.5,186.5,381.5,381.5,327], null, null, null]
  ]},
  "28236": {n: "Електроснабдяване и електрообзавеждане - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[91.5,91.5,164.5,417.25,417.25,164.5], null, null, null]
  ]},
  "28248": {n: "Интелитентни системи - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[199,199,0,218.75,218.75,0], null, null, null]
  ]},
  "28244": {n: "Разработка на софтуер - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[138.5,138.5,356.5,363.25,363.25,356.5], null, null, null]
  ]},
  "28233": {n: "Хибридни и електически превозни средства - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[167.5,167.5,0,353.5,353.5,0], null, null, null]
  ]},
}};
ruoSchools["1303006"] = {n: "ПГ по пром. техн.", f: "ПГ по промишлени технологии", c: false, p: {
  "4111": {n: "Възобновяеми енергийни източници- Монтьор на енергийни съоръжения и инсталации", d: [
    [[114,114,0,149,149,0], null, null, [198,198,254,254,198,254]],
    [[94,94,168,209,209,168], null, [83,0,83,135,0,135], [168,0,168,168,0,168]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3089": {n: "Топлотехника- топлинна, климатична, вентилационна и хладилна, Техник на енергийни съоръжения и инсталации", d: [
    [[198,198,0,198,198,0], null, null, null],
    [null, null, null, null],
    [[126,126,189,255,255,189], null, null, null],
    [null, null, null, null]
  ]},
  "28751": {n: "Технологии и системи за заваряване - без интензивно и без разширено изучаване на чужд език - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "28753": {n: "Устойчива мода - без интензивно и без разширено изучаване на чужд език - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
}};
ruoSchools["1301911"] = {n: "ПГ по селско стоп.", f: "ПГ по селско стопанство", c: false, p: {
  "4419": {n: "проф. Животновъд - спец. Говедовъдство- без инт. и без разш. изучаване на ЧЕ", d: [
    [[157,376,157,376,376,157], null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3360": {n: "проф. Техник в лозаровинарството - спец. Лозаровинарство - без инт. и без разш. изучаване на ЧЕ", d: [
    [[30,30,65,103,36,103], null, [60,0,60,185,0,185], null],
    [[30,30,30,99,99,40], null, null, null],
    [[30,30,0,207,207,0], null, null, null],
    [null, null, null, null]
  ]},
  "3358": {n: "проф. Техник на селскостопанска техника - спец. Механизация на селското стопанство - без инт. и без разш. изучаване на ЧЕ", d: [
    [[30,30,41,183,183,146], null, [40,40,0,52,52,0], [120,0,120,120,0,120]],
    [[30,30,100,215,215,100], null, null, null],
    [[70,70,0,251,251,0], null, [64,64,0,102,102,0], [60,60,0,60,60,0]],
    [null, null, null, null]
  ]},
  "3361": {n: "проф. Фризьор - спец. Оргнизация и технология на фризьорските услуги - без инт. и без разш. изучаване на ЧЕ", d: [
    [[82,90,82,260,113,260], null, null, null],
    [[58,76,58,167,76,167], null, null, [98,98,0,98,98,0]],
    [[55,55,76,267,140,267], null, [91,91,142,142,91,142], null],
    [null, null, null, null]
  ]},
  "5094": {n: "проф. Ветеринарен техник - спец. Ветеринарен техник - без инт. и без разш. изучаване на ЧЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[30,0,30,197,0,197], null, [159,0,159,159,0,159], [48,0,48,48,0,48]],
    [null, null, null, null]
  ]},
  "28910": {n: "проф. Ветеринарен техник - без инт. и без разш. изучаване на ЧЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[80,81,80,147,132,147], null, null, null]
  ]},
  "28906": {n: "проф. Лозаро-винарство - без инт. и без разш. изучаване на ЧЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,79.5,30,132,132,79], null, null, null]
  ]},
  "28899": {n: "проф. Механизация и цифровизация в аграрния сектор\" - - без инт. и без разш. изучаване на ЧЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,0,145,145,0], null, null, null]
  ]},
  "28915": {n: "проф. Фризьорство - без инт. и без разш. изучаване на ЧЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[70,78,70,139,139,109], null, null, null]
  ]},
}};
ruoSchools["1304332"] = {n: "ПГ по строителство", f: "ПГ по строителство и архитектура", c: false, p: {
  "4015": {n: "Електронна търговия", d: [
    [[121,121,156,320,176,320], null, [142.5,142.5,0,162,162,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [[80,80,163,204,204,163], null, null, null]
  ]},
  "4188": {n: "Мебелно производство- ДУАЛНА", d: [
    [[162,162,0,162,162,0], null, null, null],
    [[76,76,93,281,281,144], null, [211,0,211,211,0,211], null],
    [[74,198.5,74,218,218,172], null, [259,259,0,259,259,0], [212,0,212,212,0,212]],
    [null, null, null, null]
  ]},
  "4189": {n: "Производство на тапицирани изделия- ДУАЛНА", d: [
    [[142.5,142.5,0,142.5,142.5,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3111": {n: "Строителство и архитектура", d: [
    [[130,130,140,281,281,140], [186.5,186.5,0,238,238,0], [201,201,242.5,317.5,249,317.5], null],
    [[131,131,283,387.5,387.5,283], [131,131,0,131,131,0], [202,202,0,204,204,0], [93,0,93,149,0,149]],
    [[93,93,182,301,301,189], [230,230,0,230,230,0], null, null],
    [[103,103,206.5,260,236.5,260], null, null, null]
  ]},
}};
ruoSchools["1303344"] = {n: "ПГ по фризьорство", f: "ПГ по фризьорство и ресторантьорство", c: false, p: {
  "3094": {n: "Професия Готвач , специалност Производство на кулинарни изделия и напитки", d: [
    [[78,78,103,265,265,234], null, null, null],
    [[105.5,107,105.5,192,153,192], null, null, null],
    [[52,76,52,225,225,155.5], null, [114,114,0,114,114,0], null],
    [null, null, null, null]
  ]},
  "3096": {n: "Професия Фризьор, специалност Фризьорство", d: [
    [[78,78,82,216,168,216], null, [174,0,174,174,0,174], null],
    [[30,30,79,248,248,176], null, [168,0,168,197,0,197], null],
    [[48,48,92,304,179,304], null, [114,127,114,148,127,148], [148,0,148,148,0,148]],
    [null, null, null, null]
  ]},
  "28990": {n: "101201 Фризьорство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[57,57,98,284,170,284], null, null, null]
  ]},
  "28993": {n: "101301 Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[62,79,62,220,137,220], null, null, null]
  ]},
}};
ruoSchools["1302961"] = {n: "ПГ по хим. и хр. техн.", f: "ПГ по химични и хранителни технологии", c: false, p: {
  "3169": {n: "Техник - технолог по качеството на храни и напитки - Контрол на качеството и безопасност на храни и напитки", d: [
    [[54,54,54,240.25,212.5,240.25], null, [52,52,0,52,52,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3165": {n: "Химик - технолог - Технология на фармацевтични и парфюмерийно - козметични продукти", d: [
    [[30,30,30,329.25,216.5,329.25], null, [237,237,0,237,237,0], [137.5,0,137.5,137.5,0,137.5]],
    [[121.5,153.5,121.5,299,299,286], null, [212.5,233.5,212.5,233.5,233.5,212.5], null],
    [[114,114,117.5,331,290.25,331], [117.5,0,117.5,227,0,227], [153.5,153.5,227,227,153.5,227], [227,0,227,227,0,227]],
    [null, null, null, null]
  ]},
  "4198": {n: "Химик - технолог - Технология на фармацевтични и парфюмерийно - козметични продукти-дуална система на обучение- ДУАЛНА", d: [
    [[63,123,63,237.5,155,237.5], [167,0,167,167,0,167], null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3168": {n: "Химик - технолог - Технология на целулозата, хартията и опаковките", d: [
    [[84,84,109,188,188,187.5], null, [161.5,161.5,229.5,229.5,188.25,229.5], null],
    [[33,55,33,243.5,243.5,154], null, [88,0,88,88,0,88], null],
    [[30,30,80,229,192,229], [80,81,80,110,99,110], null, null],
    [null, null, null, null]
  ]},
  "3748": {n: "Хлебар - сладкар - Производство на хляб и хлебни изделия", d: [
    [[48,48,71,268,268,211], null, [88.5,0,88.5,88.5,0,88.5], null],
    [[58,123,58,286.5,255,286.5], null, null, null],
    [[59,59,116,278.5,278.5,166.5], [86,86,0,86,86,0], null, null],
    [null, null, null, null]
  ]},
  "4544": {n: "Техник - технолог в хранително - вкусовата промишленост - Производство на алкохолни и безалкохолни напитки", d: [
    [null, null, null, null],
    [[56,56,0,232,232,0], null, null, null],
    [[47,47,56,251.5,251.5,212], [47,47,0,47,47,0], [47,47,0,47,47,0], null],
    [null, null, null, null]
  ]},
  "5130": {n: "Хлебар - сладкар - Производство на хляб и хлебни изделия- ДУАЛНА", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[118,118,132,227.5,181,227.5], null, null, null],
    [null, null, null, null]
  ]},
  "28590": {n: "Електроснабдяване и електрообзавеждане - трета степен - ДУАЛНА", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[72,72,0,283,283,0], null, null, null]
  ]},
  "28567": {n: "Лабораторен контрол в химични, хранителни и биотехнологични производства - трета степен - с разширено изучаване на АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,79,30,295,139.5,295], null, null, null]
  ]},
  "28573": {n: "Производство на хляб, хлебни и сладкарски изделия - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,92,158,158,150], null, null, null]
  ]},
  "28553": {n: "Технологии на фармацевтични и парфюмерийно-козметични продукти - трета степен - с разширено изучаване на АЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[103,105,103,377,310.5,377], null, null, null]
  ]},
}};
ruoSchools["1302580"] = {n: "ПГ Иван Аксаков", f: "Профилирана гимназия Иван С. Аксаков", c: false, p: {
  "4353": {n: "Еколог- Екология и опазване на околната среда", d: [
    [[147.5,213,147.5,394.25,394.25,379], null, [201,201,0,201,201,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3188": {n: "Паралелка профил \"Природни науки \" без интензивно и без разширено изучаване на чужд език", d: [
    [[88,88,168.5,353.5,353.5,311.5], [254,254,270,270,254,270], [119.25,126.5,119.25,237,194,237], null],
    [[101,101,126.5,426,407.5,426], [126.5,0,126.5,303.25,0,303.25], [137,137,169,230.75,137,230.75], [199.5,0,199.5,199.5,0,199.5]],
    [[213,213,232,472.25,363.75,472.25], [113,133,113,324.5,316.5,324.5], [260.75,260.75,279.25,316.5,316.5,312], null],
    [[117,117,162.25,432.5,349.75,432.5], null, null, null]
  ]},
}};
ruoSchools["1309018"] = {n: "ПМГ", f: "ПМГ Константин Величков", c: false, p: {
  "3332": {n: "Приложен програмист", d: [
    [[273.75,273.75,298.5,448.75,448.75,431.75], [229.75,229.75,0,272,272,0], null, null],
    [[341.75,341.75,401.25,468.25,466.25,468.25], [306,306,0,309.5,309.5,0], null, null],
    [[236.5,248.25,236.5,436,425,436], null, null, null],
    [null, null, null, null]
  ]},
  "3331": {n: "Програмист", d: [
    [[195.25,195.25,205.75,279,279,264.5], [173,173,186,220.25,220.25,191.25], null, null],
    [[237.75,237.75,242.75,387.5,387.5,386.25], [207.25,207.25,219,288,271.5,288], null, null],
    [[124.5,124.5,132,299.25,299.25,280.5], [120,120,142,249,120,249], [175,226.5,175,226.5,226.5,210.25], null],
    [null, null, null, null]
  ]},
  "3328": {n: "Профил- Математически с интензивно изучаване на АЕ", d: [
    [[260.25,260.25,312,498,467.25,498], [189,189,0,189,189,0], [135,248.75,135,366.5,248.75,366.5], [118,212,118,212,212,118]],
    [[438.5,438.5,440.5,489.75,489.75,487], null, null, null],
    [[365.5,365.5,369.5,464.75,457.5,464.75], [359.5,0,359.5,359.5,0,359.5], [252,0,252,252,0,252], null],
    [[220.5,225.75,220.5,490.5,479.5,490.5], null, null, null]
  ]},
  "3330": {n: "Профил- Природни науки с интензивно изучаване ан АЕ", d: [
    [[308.5,311.5,308.5,490,438,490], [282.5,282.5,286,304.5,304.5,286], null, null],
    [[311,344.5,311,429,421.5,429], null, null, null],
    [[330,362,330,460,426,460], [322,362,322,362,362,330], null, null],
    [[314,332,314,442,425,442], null, null, null]
  ]},
  "3329": {n: "Профил- Софтуерни и хардуерни науки с интензивно изучаване на АЕ", d: [
    [[299,299,300.25,487,487,402.75], [250.25,250.25,0,301,301,0], null, null],
    [[354.75,402.5,354.75,483.75,483.75,437.5], [321,323,321,431.25,431.25,428.25], null, null],
    [[317.25,317.25,327.25,458.75,449.5,458.75], [250,0,250,271.75,0,271.75], null, null],
    [[270.25,270.25,359,422.75,422.75,414], null, null, null]
  ]},
  "28886": {n: "Дизайн на дигитални и печатни медии - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[132,149.5,132,405.25,405.25,401.5], null, null, null]
  ]},
  "28883": {n: "Разработка на софтуер - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[163,163,235,431.5,431.5,400], null, null, null]
  ]},
}};
ruoSchools["1304948"] = {n: "СУ Георги Бенковски", f: "СУ Георги Бенковски", c: false, p: {
  "1238": {n: "Профил- Предприемачески- с интензивно изучаване на английски език", d: [
    [[155.5,155.5,157,376,321.5,376], [132,136.5,132,157,151.5,157], [136,150,136,154,150,154], [245,245,0,245,245,0]],
    [[181.5,185,181.5,402,402,332.5], [170,170,217.5,299,299,237], [155,155,233,233,213,233], [213,213,0,227.5,227.5,0]],
    [[119,119,153,371.5,369.5,371.5], [100,100,153.5,236.5,219.5,236.5], [205,0,205,256.5,0,256.5], null],
    [[193,203,193,379.5,379.5,362.5], null, null, null]
  ]},
}};
ruoSchools["1305338"] = {n: "СУ Георги Брегов", f: "СУ Георги Брегов", c: false, p: {
  "3122": {n: "Музика", d: [
    [[185,185,252,426.5,426.5,411.25], null, null, null],
    [[227,227,271.5,428,393,428], [271.5,310.75,271.5,381,381,300.25], [271.5,0,271.5,352.5,0,352.5], [271.5,0,271.5,271.5,0,271.5]],
    [[194,194,274,453.75,263.5,453.75], [250.5,250.5,274,274,250.5,274], [211,211,0,211,211,0], [250.5,250.5,0,250.5,250.5,0]],
    [[197.5,197.5,228.5,468.5,427,468.5], null, null, null]
  ]},
  "4211": {n: "Рекламна графика", d: [
    [[235,235,250,405.5,391.25,405.5], [206.5,225,206.5,232,226.5,232], null, [186.5,0,186.5,186.5,0,186.5]],
    [[199.5,199.5,201,332.25,287.5,332.25], [195,195,263.75,295.5,195,295.5], [250,270.75,250,270.75,270.75,269.5], null],
    [[65,247.5,65,434.75,247.5,434.75], [243.5,0,243.5,323,0,323], [163.5,188.5,163.5,232.75,232.75,224.25], [163.5,0,163.5,240.5,0,240.5]],
    [[91.5,91.5,187,325,239.75,325], null, null, null]
  ]},
}};
ruoSchools["1305831"] = {n: "СУ П. Берон", f: "СУ Д-р Петър Берон", c: false, p: {
  "596": {n: "Профил- Предприемачески- без интензивно и без разширено изучаване на английски език", d: [
    [[183,183,201,393.25,336,393.25], [158.5,158.5,311,311,166.25,311], null, null],
    [[200.75,201,200.75,378.25,331.25,378.25], [185,185,188.5,243.75,214.75,243.75], null, null],
    [[208.5,218.5,208.5,479.5,292.25,479.5], [208.5,220,208.5,275.75,220,275.75], [246.5,246.5,0,246.5,246.5,0], [208.5,0,208.5,208.5,0,208.5]],
    [[137,148.5,137,377.5,304,377.5], null, null, null]
  ]},
}};
ruoSchools["1301234"] = {n: "СУ Димитър Гачев", f: "СУ Димитър Гачев", c: false, p: {
  "3631": {n: "Профил- Музика", d: [
    [[97,102,97,307,290,307], null, null, null],
    [[114,114,142,286.5,224,286.5], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4926": {n: "Сътрудник в малък и среден бизнес", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[84,84,85,232,232,105], null, [200,0,200,200,0,200], null],
    [null, null, null, null]
  ]},
  "28231": {n: "Малък и среден бизнес - трета степен", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,30,209,161,209], null, null, null]
  ]},
}};
