// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Stara-zagora
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["2403264"] = {n: "ГПЧЕ Ромен Ролан", f: "ГПЧЕ Ромен Ролан", c: false, p: {
  "1547": {n: "Английски език с Немски език", d: [
    [[401,401,427.5,482,481,482], [422,0,422,427.5,0,427.5], null, null],
    [[415,415,440.5,490.5,467.5,490.5], [407,407,427,427,408,427], null, null],
    [[405,405,438.5,490.5,490.5,475.5], [374,374,0,376.5,376.5,0], null, null],
    [[407.5,407.5,436,488,472,488], [386.5,386.5,432.5,432.5,397,432.5], null, null]
  ]},
  "1552": {n: "Английски език с Френски език", d: [
    [[334,334,412.5,478,403.5,478], [333,333,409,421,381.5,421], null, null],
    [[324,324,403,488,424,488], [298.5,298.5,387,396.5,377,396.5], [261,261,289,289,261,289], null],
    [[343,343,402,494,494,463], [325.5,325.5,400,409,409,400], null, null],
    [[286,286,400.5,488,412,488], [253,253,399,426,412,426], null, null]
  ]},
  "1570": {n: "Немски език с Английски език", d: [
    [[374,374,442,495,485,495], [370.5,370.5,0,370.5,370.5,0], null, null],
    [[423.5,423.5,429.5,492,482,492], [416,416,428.5,440.5,440.5,428.5], null, null],
    [[381.5,381.5,422.5,480.5,474,480.5], null, null, null],
    [[322,322,444,500,468,500], null, null, null]
  ]},
  "3552": {n: "Софтуерни и хардуерни науки с немски език", d: [
    [[358,358.5,358,436.5,396,436.5], [357,0,357,436.5,0,436.5], null, null],
    [[310.25,317.25,310.25,427,427,412], [313.25,353,313.25,407.5,407.5,379.75], null, null],
    [[263.25,263.25,268,359.5,354.75,359.5], [245.5,245.5,248.25,348,258,348], null, null],
    [[241,242.5,241,388.25,359,388.25], [237.5,239,237.5,388.25,239,388.25], null, null]
  ]},
  "1560": {n: "Френски език с Английски език", d: [
    [[294,294,397,470,422.5,470], [288,288,393.5,413.5,333,413.5], null, null],
    [[276,276,396.5,476,476,475.5], [255.5,255.5,373.5,420.5,374.5,420.5], null, null],
    [[212,212,370,470,429.5,470], [131,131,360,404.5,372,404.5], null, null],
    [[165,165,398,488,488,474.5], [156,156,394.5,409,247,409], [121,121,0,235.5,235.5,0], null]
  ]},
}};
ruoSchools["2400116"] = {n: "ПГ по вет. медицина", f: "Национална ПГ по ветеринарна медицина", c: false, p: {
  "161": {n: "Ветеринарен лаборант с АЕ", d: [
    [[194.25,197.5,194.25,354,338,354], [168.5,174.75,168.5,235.5,189.5,235.5], null, null],
    [[206,206,210,433.25,277,433.25], [153.5,153.5,201.25,279,204.5,279], [237.5,237.5,0,237.5,237.5,0], null],
    [[117.25,117.25,133,346,238.75,346], [169.5,169.5,292,292,169.5,292], null, null],
    [null, null, null, null]
  ]},
  "160": {n: "Ветеринарен техник с АЕ", d: [
    [[258.5,264.25,258.5,422.5,382.75,422.5], [224,224,242,258.5,254.25,258.5], null, null],
    [[240.25,252,240.25,418.5,345,418.5], [156,195.5,156,246.5,224.25,246.5], [243,243,0,243,243,0], null],
    [[93.5,93.5,147,368,368,335], null, null, null],
    [null, null, null, null]
  ]},
  "153": {n: "Ветеринарен техник с РИЧЕ АЕ", d: [
    [[284.25,290.5,284.25,444.5,395.75,444.5], [184.5,191,184.5,348.5,334.5,348.5], null, null],
    [[237.5,237.5,237.5,423.5,423.5,409.5], [92.75,92.75,226.75,300.75,189,300.75], null, null],
    [[179.75,233,179.75,414.5,302,414.5], [117.25,117.25,414.5,414.5,238,414.5], null, null],
    [null, null, null, null]
  ]},
  "166": {n: "Контрол на качеството и безопасност на храни и напитки с АЕ", d: [
    [[191.5,191.5,193,310.75,222,310.75], [178,187.25,178,299,187.25,299], null, null],
    [[238,243.5,238,341,305.75,341], [230.25,230.25,256.25,307.25,252.5,307.25], null, null],
    [[243,255.25,243,430.75,430.75,380.5], [172,255.25,172,289.5,259,289.5], null, null],
    [null, null, null, null]
  ]},
  "29722": {n: "Ветеринарен лаборант", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[145,171.5,145,390.75,389.5,390.75], [180,211.25,180,291,211.25,291], [157.5,157.5,340.75,340.75,157.5,340.75], null]
  ]},
  "29721": {n: "Ветеринарен техник", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[178,178,204.5,424.5,405.5,424.5], [135.5,135.5,214.5,294.5,187,294.5], null, null]
  ]},
  "29719": {n: "Ветеринарен техник с РИЧЕ", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[278.75,278.75,288.5,436.75,383.25,436.75], [98,98,135.5,333,333,275.5], [219,0,219,219,0,219], null]
  ]},
  "29724": {n: "Контрол на качеството и безопасност на храните", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[202,202,227,342,304.5,342], [158,176,158,296.5,262.5,296.5], null, null]
  ]},
}};
ruoSchools["2400117"] = {n: "ПГ по електроника", f: "ПГ по електроника", c: false, p: {
  "500": {n: "Компютърна техника и технологии", d: [
    [[190,192,190,283,283,228], [170,170,172.5,271.5,271.5,228], null, null],
    [[199,206.5,199,320,320,255.5], [160.5,160.5,255.5,320,320,255.5], null, null],
    [[97,133,97,301,301,267], [209.5,209.5,255.5,301,301,255.5], null, null],
    [null, null, null, null]
  ]},
  "503": {n: "Компютърни мрежи", d: [
    [[143,143,159.5,210,210,184], [76,76,0,157,157,0], null, null],
    [[167,167,169,280.5,262,280.5], [140,140,162,262,262,162], null, null],
    [[141,155,141,285.5,285.5,243], [285.5,285.5,0,285.5,285.5,0], null, null],
    [null, null, null, null]
  ]},
  "480": {n: "Приложно програмиране", d: [
    [[210,210,253,401,401,276], [189,206,189,333,333,189], null, null],
    [[238,238,252.5,339,339,323], [216.5,216.5,265,323,271,323], null, null],
    [[104,120,104,321,321,259], [222.5,222.5,0,263,263,0], null, [222.5,222.5,0,222.5,222.5,0]],
    [null, null, null, null]
  ]},
  "475": {n: "Системно програмиране", d: [
    [[212,212,213,317.5,300.5,317.5], [188,188,0,291,291,0], null, null],
    [[226,226,228,315.5,315.5,257], [212.5,212.5,217,315.5,315.5,230], [288,288,0,288,288,0], null],
    [[177.5,186,177.5,309.5,309.5,242], [196,196,241.5,242,239,242], null, null],
    [null, null, null, null]
  ]},
  "28650": {n: "Компютърни системи и технологии", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[145,145,217,291,291,279.5], [106,106,279.5,279.5,272,279.5], [256,256,0,256,256,0], null]
  ]},
  "28652": {n: "Комуникационни и компютърни мрежи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[83,94,83,283,283,268.5], [168,168,268.5,278.5,278.5,268.5], [204,204,0,244.5,244.5,0], null]
  ]},
  "28646": {n: "Разработка на софтуер", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[217,220,217,291,291,267], [210.5,210.5,0,287.5,287.5,0], null, null]
  ]},
  "28647": {n: "Роботика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[186,186,203,280,280,234], [182.5,182.5,203,280,280,228.5], null, null]
  ]},
}};
ruoSchools["2400112"] = {n: "ПГ по електрот.", f: "ПГ по електротехника и технологии", c: false, p: {
  "75": {n: "Възобновяеми енергийни източници", d: [
    [[147.5,147.5,150.5,329.75,329.75,256.5], [82,82,0,329.25,329.25,0], null, null],
    [[96,97,96,345.25,345.25,233], [175,175,0,345.25,345.25,0], [193.5,193.5,0,272.75,272.75,0], [250,250,0,250,250,0]],
    [[62,62,98,293.75,293.75,150], [104,104,0,269,269,0], null, null],
    [[82,82,136,211,211,183.5], [111,111,0,211,211,0], [82,82,0,83,83,0], null]
  ]},
  "3648": {n: "Електрообзавеждане на производството", d: [
    [[156.5,156.5,159,300.5,300.5,188], [128.25,128.25,159,281,281,159], null, null],
    [[140,142.75,140,314.75,314.75,195.5], [97,97,0,314.75,314.75,0], [257,257,0,257,257,0], [211,0,211,211,0,211]],
    [[59,59,71.5,300.75,300.75,190], [300.75,300.75,0,300.75,300.75,0], null, null],
    [null, null, null, null]
  ]},
  "79": {n: "Мехатроника", d: [
    [[85,85,92,333.75,333.75,281], [71,71,72,333.75,333.75,72], null, null],
    [[112,112,122,331,331,238.5], [61,83,61,231,231,61], [245.5,0,245.5,245.5,0,245.5], null],
    [[163.25,163.25,211.5,342.25,342.25,342], [104.5,0,104.5,342,0,342], null, null],
    [null, null, null, null]
  ]},
  "4872": {n: "Технология на полимерите - дуална система на обучение", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[77,77,0,77,77,0], null, null, null],
    [null, null, null, null]
  ]},
  "29279": {n: "Автоматизация и управляваща техника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[50,97,50,308,308,93], [152,152,0,152,152,0], [142,142,189,189,142,189], null]
  ]},
  "29766": {n: "Електроснабдяване и електрообзавеждане", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[68,68,172,305.5,305.5,172], [175,175,0,261,261,0], [158,158,0,158,158,0], null]
  ]},
}};
ruoSchools["2400020"] = {n: "ПГ по комп. науки", f: "ПГ по комп. науки и мат. анализ Проф. Минко Балкански", c: false, p: {
  "3818": {n: "Компютърна графика", d: [
    [[275.75,277,275.75,390.25,317.5,390.25], [275,275,304.75,304.75,296.25,304.75], null, null],
    [[295.25,384.5,295.25,474.75,384.5,474.75], null, null, null],
    [[269.5,274.75,269.5,409.25,400.5,409.25], [256.5,0,256.5,293.25,0,293.25], null, null],
    [[290.5,303.5,290.5,414.25,318,414.25], [287,0,287,363.25,0,363.25], null, null]
  ]},
  "3039": {n: "Приложно програмиране", d: [
    [[317,317,331.5,467.25,461.5,467.25], [300,300,0,394,394,0], null, null],
    [[319,319,330,481.5,481.5,398.75], [288.5,288.5,0,438,438,0], null, null],
    [[277,277,414.25,425.25,425.25,416.75], [254,256.75,254,425.25,425.25,254], null, null],
    [null, null, null, null]
  ]},
  "3817": {n: "Програмиране на изкуствен интелект", d: [
    [[286,286,288,470,400.25,470], [270,270,323,360.75,291,360.75], null, null],
    [[289,289,298.25,417.75,359.25,417.75], [281.5,281.5,0,302.25,302.25,0], null, null],
    [[260.25,260.25,268,441.75,441.75,347], [266.25,266.25,0,285.75,285.75,0], null, null],
    [null, null, null, null]
  ]},
  "28818": {n: "Интелигентни системи", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[255.75,255.75,261.75,440,440,332], [255.25,255.25,281,301.25,256.25,301.25], null, null]
  ]},
  "28822": {n: "Киберсигурност", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[289.75,289.75,351,475,416.75,475], null, null, null]
  ]},
  "28815": {n: "Разработка на софтуер", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[258.5,258.5,268.25,441.5,441.5,376.75], [257.5,271.25,257.5,330.5,271.25,330.5], null, null]
  ]},
}};
ruoSchools["2400111"] = {n: "ПГ по механот.", f: "ПГ по механотехника и транспорт", c: false, p: {
  "2911": {n: "Автотранспортна техника", d: [
    [[56,56,0,253.75,253.75,0], [135.5,135.5,0,208.5,208.5,0], null, null],
    [[89,89,127,253,253,127], [86,86,0,146,146,0], [148.5,148.5,0,226,226,0], null],
    [[30,30,0,294.25,294.25,0], null, null, null],
    [null, null, null, null]
  ]},
  "2912": {n: "Електрически превозни средства", d: [
    [[82,82,120,350.25,350.25,120], null, null, null],
    [[71,71,160.5,274.5,274.5,160.5], [160.5,0,160.5,160.5,0,160.5], [122,122,0,122,122,0], [104,143,104,219,212.5,219]],
    [[85,85,96,248.5,248.5,166.5], null, null, null],
    [null, null, null, null]
  ]},
  "29260": {n: "Автомобилна техника и мехатроника", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[63,63,0,280,280,0], null, null, null]
  ]},
  "29262": {n: "Хибридни и електрически пътни превозни средства", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[116.5,116.5,244,325,325,244], [200,200,0,271,271,0], [52,52,0,156,156,0], null]
  ]},
}};
ruoSchools["2400165"] = {n: "ПГ по облекло", f: "ПГ по облекло и хранене", c: false, p: {
  "98": {n: "Готвач", d: [
    [[230,240,230,306.5,297.5,306.5], [228,228,262,296.5,290.75,296.5], null, null],
    [[232.5,234.5,232.5,393.5,360.5,393.5], [236.25,236.25,0,320.75,320.75,0], [230,230,236.5,236.5,230,236.5], null],
    [[118,118,153.75,288,246.25,288], [178.5,0,178.5,178.5,0,178.5], null, null],
    [null, null, null, null]
  ]},
  "95": {n: "Кетъринг", d: [
    [[217,252.75,217,302.5,299,302.5], [199,199,199,277,214.5,277], null, null],
    [[206.5,206.5,211.5,306.75,242.25,306.75], [201.5,213.5,201.5,290,215,290], [246,0,246,246,0,246], null],
    [[82,82,115.5,315,291.5,315], null, null, [128,128,0,128,128,0]],
    [null, null, null, null]
  ]},
  "97": {n: "Организация на туризма и свободното време", d: [
    [[247.25,249.5,247.25,400,325.75,400], [207.75,207.75,220,356,325.75,356], null, null],
    [[239,239,246.5,348.25,336.75,348.25], [183.5,186,183.5,338.5,274,338.5], [267.25,320.75,267.25,332.5,320.75,332.5], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "89": {n: "Организатор на туристическа агентска дейност", d: [
    [[246.75,261,246.75,350.25,305.25,350.25], [240.5,282.5,240.5,301.5,291.25,301.5], null, null],
    [[232.25,232.25,237.5,324.5,295.5,324.5], [206.5,206.5,219.5,324,295.5,324], [286.25,286.25,0,302,302,0], null],
    [[224,225,224,325,289,325], [216.5,216.5,270.5,309.5,250.5,309.5], null, null],
    [null, null, null, null]
  ]},
  "5131": {n: "Хотелиер", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[153,154,153,306,246,306], [136.5,192.5,136.5,246,246,151.5], null, null],
    [null, null, null, null]
  ]},
  "29602": {n: "Готварство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[161.5,162.5,161.5,329.75,329.75,328.5], [111,126.5,111,329.75,329.75,290.5], null, null]
  ]},
  "29597": {n: "Организиране на туристически пътувания", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[206.5,206.5,216.5,337.25,272.75,337.25], [176,203.75,176,337.25,203.75,337.25], [169,0,169,169,0,169], null]
  ]},
  "29599": {n: "Ресторантьорство и кетъринг", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[127,170.5,127,344,197,344], [97.5,0,97.5,344,0,344], [157,0,157,305,0,305], null]
  ]},
  "29591": {n: "Хотелиерство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[103,103,133,311.5,311.5,276], [133,0,133,276,0,276], [197,0,197,280,0,280], null]
  ]},
}};
ruoSchools["2400119"] = {n: "ПГ по строит и дърв.", f: "ПГ по строителство и дървообработване", c: false, p: {
  "2538": {n: "Вътрешни облицовки и настилки", d: [
    [[30,30,0,104,104,0], null, null, null],
    [[75,75,90,206,206,193], [206,206,0,206,206,0], [120,120,0,120,120,0], null],
    [[30,30,30,219,132,219], null, null, null],
    [null, null, null, null]
  ]},
  "2551": {n: "Външни облицовки и настилки", d: [
    [[30,30,0,161,161,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "2548": {n: "Мебелно производство - дуална система на обучение", d: [
    [[30,30,30,257.5,257.5,182], [257.5,257.5,0,257.5,257.5,0], null, null],
    [[50,50,71,174,174,147], [30,30,137,137,32,137], null, [105,105,0,105,105,0]],
    [[52,81,52,215.5,183,215.5], null, null, null],
    [null, null, null, null]
  ]},
  "29294": {n: "Мебелно производство и реставрация", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,60,30,144,126,144], null, [90,90,0,90,90,0], null]
  ]},
  "29264": {n: "Реставрация на недвижимо културно наследство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,30,66,197,197,86], null, null, null]
  ]},
}};
ruoSchools["2402131"] = {n: "ПГ по строит., арх. и геод.", f: "ПГ по строителство, архитектура и геодезия", c: false, p: {
  "1919": {n: "Водно строителство с АЕ", d: [
    [[295,295,296,355.5,336,355.5], [290.5,290.5,292,327.5,327.5,310], null, null],
    [[298.5,298.5,306.5,359.5,355.5,359.5], [312,328.5,312,359.5,355.5,359.5], null, null],
    [[296.5,296.5,298.5,350.5,350.5,343.5], [292.5,292.5,315,343.5,313,343.5], null, null],
    [[295,295,300,394.5,361,394.5], [286,286,292.5,383.5,300,383.5], [292,292,0,292,292,0], null]
  ]},
  "1927": {n: "Геодезия с АЕ", d: [
    [[337.5,337.5,338,373,369,373], [332.5,333.5,332.5,368,356,368], null, null],
    [[356,357,356,437.5,410.5,437.5], [356.5,370,356.5,370,370,368.5], null, null],
    [[353,353,355,438.5,438.5,412.5], [349,350.5,349,412.5,365,412.5], null, null],
    [[346,346,347.5,401,395.5,401], [342,342,344.5,358.5,358.5,344.5], null, null]
  ]},
  "1886": {n: "Строителство и архитектура с АЕ", d: [
    [[371,371,372.5,446.5,446.5,441], [368.5,368.5,369,369,368.5,369], null, null],
    [[411.5,414,411.5,468.5,458.5,468.5], null, null, null],
    [[408,409.5,408,481,472,481], [406,0,406,406,0,406], null, null],
    [[399.5,402.5,399.5,453,438,453], null, null, null]
  ]},
  "1931": {n: "Строителство и архитектура с НЕ", d: [
    [[354,354.5,354,433,392,433], [344.5,368.5,344.5,368.5,368.5,363], null, null],
    [[375,375,376,444.5,440.5,444.5], [371.5,0,371.5,371.5,0,371.5], null, null],
    [[369,369,369,488.5,408,488.5], [366,368,366,398,398,382], null, null],
    [[366,366,374.5,435.5,417.5,435.5], [362,362,384,384,366,384], [338,0,338,338,0,338], null]
  ]},
  "1925": {n: "Транспортно строителство с АЕ", d: [
    [[304,304,307.5,353.5,338,353.5], [298.5,299.5,298.5,330,330,329.5], null, null],
    [[309,309,310.5,415,415,348], [295.5,298,295.5,348,339.5,348], null, null],
    [[308,313,308,371.5,371.5,349], [303.5,307,303.5,347.5,347.5,304.5], null, null],
    [[307,307,309.5,361,361,361], [295,295,334,340,340,334], null, null]
  ]},
}};
ruoSchools["2400102"] = {n: "ППМГ Гео Милев", f: "ППМГ Гео Милев", c: false, p: {
  "25": {n: "Математически", d: [
    [[307.25,307.25,314.25,472.5,399.5,472.5], [294.5,294.5,303.25,396.5,396.5,354.5], null, null],
    [[304.25,304.25,309,468.5,447.25,468.5], [255.5,268.75,255.5,437.5,437.5,373.25], null, null],
    [[355.5,360.25,355.5,492,492,444.75], [335.75,335.75,353.5,422.75,422.75,371], null, null],
    [[371.25,371.25,375.75,497.25,494.5,497.25], [349.75,349.75,366.75,435,355.5,435], [250.75,0,250.75,250.75,0,250.75], null]
  ]},
  "26": {n: "Природни науки", d: [
    [[383.5,385,383.5,486.5,486.5,484.5], [381.5,381.5,382.5,432,381.5,432], null, null],
    [[403,411.5,403,486,456.5,486], [400,400,448.5,448.5,411.5,448.5], null, null],
    [[431,434,431,487,472,487], [414,414,0,426,426,0], null, null],
    [[425.5,431.5,425.5,493.5,493.5,491], [424,0,424,424,0,424], null, null]
  ]},
  "23": {n: "Софтуерни и хардуерни науки", d: [
    [[399.25,399.25,420.25,490.5,490.5,484.5], null, null, null],
    [[445.25,445.25,448,491.5,491.5,490.5], [442.25,442.25,443,444.25,444.25,443], null, null],
    [[444.5,444.75,444.5,499.5,498.5,499.5], [443.25,443.25,0,443.25,443.25,0], null, null],
    [[321.5,329,321.5,483.75,478.5,483.75], [282.5,283,282.5,303.5,283,303.5], [317.75,317.75,0,317.75,317.75,0], null]
  ]},
}};
ruoSchools["2400104"] = {n: "СУ Васил Левски", f: "СУ Васил Левски", c: false, p: {
  "2667": {n: "Софтуерни и хардуерни науки", d: [
    [[210,210,212.5,289,289,255], [207,207,221,289,289,255], null, null],
    [[192,192,195,326.5,326.5,276.5], [176.5,185,176.5,276.5,246.5,276.5], [271,0,271,278,0,278], null],
    [[152,152,188,277,277,267], [66,66,247,277,277,247], null, null],
    [[112,112,120,297.5,190,297.5], [64,137,64,215.5,190,215.5], [230.5,0,230.5,304.5,0,304.5], null]
  ]},
  "4619": {n: "Хуманитарни науки", d: [
    [null, null, null, null],
    [[189.75,193,189.75,313,308.5,313], [188.5,209.25,188.5,302.5,302.5,275], [286.5,0,286.5,286.5,0,286.5], null],
    [[78,78,127,303.5,231.75,303.5], [293.5,0,293.5,293.5,0,293.5], null, [82,82,0,82,82,0]],
    [[206.5,206.5,227,430.75,318.25,430.75], [172.5,172.5,203,330.5,318.25,330.5], null, null]
  ]},
}};
ruoSchools["2400014"] = {n: "СУ Железник", f: "СУ Железник", c: false, p: {
  "2902": {n: "Софтуерни и хардуерни науки", d: [
    [[229,234,229,307.5,295,307.5], [210,210,214,305.5,295,305.5], null, null],
    [[174,174,174,302,261,302], [151,151,200,261,261,254], [279.5,279.5,0,279.5,279.5,0], null],
    [[177,187,177,392.5,360,392.5], [100,100,117,360,360,283.5], null, null],
    [[120,120,148,322.5,293.5,322.5], [148,0,148,148,0,148], null, null]
  ]},
  "4610": {n: "Природни науки", d: [
    [null, null, null, null],
    [[41,41,101,236,236,167], [85,85,101,167,163.5,167], [60,104,60,254,160,254], [180,242.5,180,246,242.5,246]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
}};
ruoSchools["2400107"] = {n: "СУ Иван Вазов", f: "СУ Иван Вазов", c: false, p: {
  "406": {n: "профил \"Софтуерни и хардуерни науки\" с интензивно изучаване на английски език", d: [
    [[271,271,275,387.5,387.5,301.5], [241,250.5,241,387.5,387.5,301.5], null, null],
    [[247.5,254,247.5,332,332,310], [221,221,223,332,332,294], [276.5,279.5,276.5,279.5,279.5,276.5], null],
    [[250,250,252,357,315,357], [248,248,252,312.5,312.5,252], null, null],
    [[196,196,198,299,291.5,299], [190,190,220.5,299,291.5,299], null, null]
  ]},
  "109": {n: "Приложна информатика - STEM професия \"Икономист- информатик\"", d: [
    [[235.5,238,235.5,338,338,309.5], [232.5,232.5,235,338,338,309.5], null, null],
    [[245,249.5,245,423,294,423], [224,224,239,276.5,276.5,259.5], null, null],
    [[254.5,260,254.5,410,410,343.5], [253.5,260,253.5,299,285,299], null, null],
    [null, null, null, null]
  ]},
  "28168": {n: "Професионална паралелка \"Икономическа информатика\"", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[214,217,214,407,343,407], [190.5,205,190.5,301,300.5,301], null, null]
  ]},
}};
ruoSchools["2400106"] = {n: "СУ Максим Горки", f: "СУ Максим Горки", c: false, p: {
  "1467": {n: "предприемачески АЕ-ИИЧЕ РЕ-втори ЧЕ", d: [
    [[255,256.5,255,336,336,332.5], [251.5,251.5,255,321.5,273,321.5], null, null],
    [[267.5,280.5,267.5,351.5,335,351.5], [261.5,280.5,261.5,309.5,307,309.5], null, null],
    [[267,267,268.5,386.5,386.5,349.5], [257.5,259,257.5,304.5,266.5,304.5], null, null],
    [[246.5,281,246.5,422,422,378], [244,0,244,310.5,0,310.5], null, null]
  ]},
  "1471": {n: "чужди езици ИЕ-ИИЧЕ АЕ- втори ЧЕ", d: [
    [[359.75,404.25,359.75,427.75,404.25,427.75], [356,0,356,413.5,0,413.5], null, null],
    [[346,355.75,346,437.25,365.25,437.25], [342.75,0,342.75,411.5,0,411.5], null, null],
    [[359.75,370.5,359.75,446,370.5,446], [336.25,347,336.25,433.5,347,433.5], null, [216.75,216.75,0,216.75,216.75,0]],
    [[292.5,360,292.5,424,360,424], [257.5,0,257.5,398,0,398], null, null]
  ]},
  "1491": {n: "чужди езици КЕ - ИИЧЕ АЕ- втори ЧЕ", d: [
    [[284,284,285,403.75,403.75,384.25], [279.25,279.25,279.5,307.75,307.75,302.5], null, null],
    [[287,295,287,386.5,386,386.5], [271.75,0,271.75,347.25,0,347.25], null, null],
    [[267,279.75,267,447.5,310.5,447.5], [209.25,209.25,228.75,311,310.5,311], null, [209.25,209.25,0,209.25,209.25,0]],
    [[239,243,239,447.5,305.5,447.5], [226.5,230.5,226.5,333,230.5,333], null, null]
  ]},
  "1472": {n: "природни науки РЕ-ИИЧЕ АЕ-втори ЧЕ", d: [
    [[303.75,303.75,304,417.25,343.75,417.25], [292,294.25,292,417.25,339.5,417.25], null, null],
    [[309.5,320.5,309.5,426,426,414.5], [303.5,303.5,303.75,391.5,304,391.5], null, null],
    [[308,321.5,308,434.75,417,434.75], [289,298,289,419.75,298,419.75], null, null],
    [[263,280,263,400.5,371,400.5], [257,0,257,400.5,0,400.5], null, null]
  ]},
}};
ruoSchools["2400174"] = {n: "СУ Христо Ботев", f: "СУ Христо Ботев", c: false, p: {
  "308": {n: "социален асистент подпомагане на децабез ИИЧЕбез РИЧЕАЕ", d: [
    [[30,62,30,185,185,162], [102,0,102,128,0,128], null, null],
    [[46,54,46,254.5,254.5,225], [60,82,60,196.5,82,196.5], [83,83,193,193,100,193], [119,124,119,157,124,157]],
    [[30,100,30,170,167,170], null, null, [66,0,66,82,0,82]],
    [null, null, null, null]
  ]},
  "29946": {n: "Социални дейности", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[30,58,30,172,146.5,172], null, null, null]
  ]},
}};
ruoSchools["2400105"] = {n: "СУ Хр. Смирненски", f: "СУ Христо Смирненски", c: false, p: {
  "628": {n: "Софтуерни и хардуерни науки", d: [
    [[59,59,59,311.5,177.5,311.5], [177.5,177.5,239.5,311.5,177.5,311.5], null, null],
    [[69,69,120,213,192,213], null, null, [144,0,144,144,0,144]],
    [[65,66,65,226,226,163], null, null, null],
    [[30,30,50,127,127,98], null, null, null]
  ]},
}};
ruoSchools["2402016"] = {n: "Търговска гимназия", f: "Търговска гимназия Княз Симеон Търновски", c: false, p: {
  "1033": {n: "Търговия на едро и дребно- РИЧЕ-АЕ", d: [
    [[264.5,269,264.5,340.5,295.75,340.5], [254.5,254.5,261.5,329.25,293.5,329.25], null, null],
    [[309,310,309,452,327.5,452], [293,293,295,352,327.5,352], null, null],
    [[306,307,306,384.5,357,384.5], [292.5,292.5,297,333,333,329.5], null, null],
    [null, null, null, null]
  ]},
  "1027": {n: "Електронна търговия с РИЧЕ-АЕ", d: [
    [[310,315.25,310,419,411.75,419], [314,342.75,314,404.5,342.75,404.5], null, null],
    [[333,333.5,333,453,446.5,453], [333.5,333.5,343,384,384,368], null, null],
    [[351,351,353.5,432,427.5,432], [347,0,347,357,0,357], null, null],
    [null, null, null, null]
  ]},
  "1024": {n: "Икономика и мениджмънт с РИЧЕ-НЕ", d: [
    [[297.5,299.25,297.5,442,354.25,442], [294.5,296.5,294.5,361,296.5,361], null, null],
    [[343,349.5,343,443,442,443], [331.5,331.5,359,395.5,331.5,395.5], null, null],
    [[345.5,383,345.5,458,428,458], [343,0,343,363,0,363], null, null],
    [null, null, null, null]
  ]},
  "1016": {n: "Оперативно счетоводство с РИЧЕ-АЕ", d: [
    [[271.5,277.25,271.5,397.75,294.25,397.75], [262,262,269.75,333,291.5,333], null, null],
    [[305,305.5,305,426,356.5,426], [293.5,304.5,293.5,331,304.5,331], null, null],
    [[323,325.5,323,424,352,424], [319,331.5,319,352.5,344,352.5], null, null],
    [null, null, null, null]
  ]},
  "28382": {n: "Банково, застрахователно и осигурително дело", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[320.5,327.5,320.5,417,397,417], [325,360.5,325,361,361,361], null, null]
  ]},
  "28386": {n: "Електронна търговия, маркетинг и реклама", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[361.5,361.5,362.5,445.5,430.5,445.5], [383,0,383,394,0,394], null, null]
  ]},
  "28383": {n: "Мениджмънт и икономика", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[362,362,363,466.5,445.5,466.5], [371.5,0,371.5,392,0,392], null, null]
  ]},
  "28381": {n: "Оперативно счетоводство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[337,337,338,422,389,422], [340,360.5,340,363.5,360.5,363.5], null, null]
  ]},
}};
