// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Kotel
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["2000201"] = {n: "СУ Георги Раковски", f: "СУ Георги Раковски", c: false, p: {
  "1036": {n: "Готвач", d: [
    [[140,140,140,347,347,250], [132,0,132,132,0,132], null, null],
    [[142,158,142,279,249.5,279], null, [152,0,152,152,0,152], null],
    [[140,0,0,391.5,0,0], [107,0,0,107,0,0], null, null]
  ]},
  "1041": {n: "Екскурзовод", d: [
    [[96,98,96,277,277,238], [73,121,73,162,121,162], null, null],
    [[74,135,74,359.5,359.5,328], null, [183,0,183,183,0,183], null],
    [[84,0,0,418,0,0], null, [174,0,0,390.5,0,0], null]
  ]},
  "4281": {n: "Обществени науки", d: [
    [[86,86,124,311,311,124], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "1025": {n: "Софтуерни и хардуерни науки", d: [
    [[30,30,41,239,239,152], null, null, null],
    [[89,89,103,155,155,119], null, [121,121,145,145,121,145], null],
    [[30,0,0,200,0,0], null, null, null]
  ]},
}};
