// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Omurtag
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2022, 2023, 2024];

let ruoSchools = {};
ruoSchools["2520601"] = {n: "ПГ по транспорт", f: "ПГ по транспорт и лека промишленост", c: false, p: {
  "3069": {n: "Дизайнер", d: [
    [[110,0,110,240,0,240], null, [138,0,138,214,0,214], null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "378": {n: "Електромонтьор", d: [
    [[105,105,0,204,204,0], null, [97,97,0,97,97,0], null],
    [null, null, null, null],
    [[30,30,0,273,273,0], null, null, null]
  ]},
  "4269": {n: "Сътрудник", d: [
    [[30,0,30,259,0,259], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "379": {n: "Техник по транспортна техника", d: [
    [[60,60,0,236,236,0], null, null, null],
    [[86,86,0,251,251,0], null, null, null],
    [[60,60,0,311.5,311.5,0], [58,58,0,58,58,0], [58,58,0,107,107,0], [82.5,0,82.5,108,0,108]]
  ]},
  "4589": {n: "Оператор в производство на облекло", d: [
    [null, null, null, null],
    [[121,0,121,219,0,219], null, [41,41,0,198.5,198.5,0], null],
    [[77,0,77,294,0,294], null, null, null]
  ]},
}};
ruoSchools["2520401"] = {n: "ПГ Симеон Велчев", f: "ПГ Симеон Велчев", c: false, p: {
  "135": {n: "Предприемачески", d: [
    [[203,213,203,340,340,339.5], null, null, null],
    [[30,30,147,338,288.5,338], [142,142,0,142,142,0], [184,184,0,212,212,0], null],
    [[89,89,92,419.5,299.5,419.5], [66,66,0,66,66,0], null, null]
  ]},
  "132": {n: "Природни науки", d: [
    [[214,219,214,384.5,277,384.5], null, null, null],
    [[76,193,76,380.5,297.5,380.5], null, null, null],
    [[128,128,130,396,396,371], null, null, null]
  ]},
}};
