// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Kavarna
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["800086"] = {n: "Земеделска гимн.", f: "Проф. земеделска гимназия", c: false, p: {
  "1102": {n: "Администратор в хотелиерството", d: [
    [[116,0,0,287.5,0,0], null, null, null],
    [[99,0,0,239,0,0], null, null, null],
    [[74,0,0,393,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "1116": {n: "Техник - растениевъд", d: [
    [[67,0,0,183,0,0], null, null, null],
    [[30,0,0,246.5,0,0], null, [68,0,0,68,0,0], null],
    [[30,0,0,155,0,0], null, [101,0,0,164,0,0], null],
    [null, null, null, null]
  ]},
  "1074": {n: "Фермер", d: [
    [[88,0,0,191.5,0,0], null, null, null],
    [[78,0,0,145,0,0], null, [64,0,0,218.5,0,0], null],
    [[104,0,0,330,0,0], null, null, null],
    [null, null, null, null]
  ]},
  "29360": {n: "Фермерство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[79,0,0,234,0,0], null, null, null]
  ]},
  "29359": {n: "Хотелиерство", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[70,0,0,325,0,0], null, null, null]
  ]},
}};
ruoSchools["800082"] = {n: "СУ Стефан Караджа", f: "СУ Стефан Караджа", c: false, p: {
  "671": {n: "Математическа", d: [
    [[215,0,0,398.25,0,0], null, [180.5,0,0,180.5,0,0], null],
    [[65,0,0,364.5,0,0], null, null, null],
    [[103.5,0,0,391,0,0], [78.5,0,0,78.5,0,0], null, null],
    [[141.5,0,0,443,0,0], null, null, null]
  ]},
  "668": {n: "Предприемачество", d: [
    [[153,0,0,364,0,0], null, [348.5,0,0,348.5,0,0], null],
    [[116,0,0,421,0,0], null, null, [372.5,0,0,372.5,0,0]],
    [[259,0,0,391,0,0], [214,0,0,319.5,0,0], null, null],
    [[91,0,0,300.5,0,0], null, null, null]
  ]},
}};
