// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Sredets
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025, 2026];

let ruoSchools = {};
ruoSchools["201106"] = {n: "ПГ по механизация", f: "ПГ по механизация Н. Вапцаров", c: false, p: {
  "1932": {n: "Механизация на селското стопанство", d: [
    [null, null, [88,88,0,88,88,0], null],
    [[63,63,129,161,161,129], null, [40,91,40,193,137,193], null],
    [[30,30,84,208,170,208], null, [81,0,81,173,0,173], null],
    [null, null, null, null]
  ]},
  "1912": {n: "Промишлена електроника", d: [
    [null, [196.5,196.5,0,196.5,196.5,0], [224,0,224,224,0,224], null],
    [[30,127,30,237,136,237], null, [74,109,74,320.5,109,320.5], null],
    [[76,137,76,312,269.5,312], null, null, null],
    [null, null, null, null]
  ]},
  "4788": {n: "Механизация на селското стопанство - обучение чрез работа", d: [
    [null, null, null, null],
    [[80,80,0,169,169,0], null, null, null],
    [[93,93,0,178.5,178.5,0], null, null, null],
    [null, null, null, null]
  ]},
  "29937": {n: "Електронна техника и технологии", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[52,52,64,178,172,178], null, null, null]
  ]},
  "29765": {n: "Механизация и цифровизация в аграрния сектор", d: [
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null],
    [[41,50,41,328.5,328.5,137], null, null, null]
  ]},
}};
ruoSchools["201104"] = {n: "СУ Кирил и Методий", f: "СУ Кирил и Методий", c: false, p: {
  "1250": {n: "Софтуерни и хардуерни науки", d: [
    [null, [78,0,78,263,0,263], [61,61,0,61,61,0], null],
    [null, null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "4756": {n: "Предприемачески", d: [
    [null, null, null, null],
    [[121,121,122,211.5,190,211.5], [116,116,164,164,118,164], [275,0,275,275,0,275], null],
    [[76,92,76,342,210,342], [210,210,218,218,210,218], [210,210,218,218,210,218], [218,0,218,218,0,218]],
    [[60,92,60,249.5,249.5,174], null, null, null]
  ]},
}};
