// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Madan
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["2102145"] = {n: "ПГ Васил Димитров", f: "ПГ Васил Димитров", c: false, p: {
  "3202": {n: "Програмно осигуряване", d: [
    [[166,0,0,340,0,0], null, null, null],
    [[125,0,0,296,0,0], [252.5,0,0,252.5,0,0], [88,0,0,208,0,0], null],
    [[175,0,0,305.5,0,0], [239,0,0,239,0,0], null, null]
  ]},
  "3981": {n: "Машини и съоръжения за добивната промишленост и строителство", d: [
    [[30,0,0,185,0,0], null, null, null],
    [null, null, null, null],
    [null, null, null, null]
  ]},
  "3982": {n: "Маркшайдерство", d: [
    [[41,0,0,256,0,0], null, null, null],
    [[156,0,0,316.5,0,0], null, null, null],
    [[158,0,0,314.5,0,0], null, null, null]
  ]},
  "3980": {n: "Промишлена електроника", d: [
    [null, null, null, null],
    [[76,0,0,285,0,0], null, null, null],
    [[138.5,0,0,312,0,0], null, null, null]
  ]},
}};
ruoSchools["2100701"] = {n: "СУ Отец Паисий", f: "СУ Отец Паисий", c: false, p: {
  "3780": {n: "Икономическо развитие", d: [
    [[82,0,0,335,0,0], null, null, null],
    [[142,0,0,382.75,0,0], [133,0,0,279.75,0,0], null, null],
    [null, null, null, null]
  ]},
  "807": {n: "Чужди езици", d: [
    [[183,0,0,460,0,0], null, null, null],
    [[295,0,0,451.5,0,0], null, null, null],
    [[216.5,0,0,445.25,0,0], null, [272.5,0,0,356,0,0], null]
  ]},
  "4840": {n: "Софтуерни и хардуерни науки", d: [
    [null, null, null, null],
    [null, null, null, null],
    [[195.5,0,0,414.5,0,0], null, null, null]
  ]},
}};
