// Данни за минимален и максимален бал по паралелки след 7 клас — РУО Belene
// Генериран от RuoDecomplexor. НЕ редактирай ръчно.
//
// ruoYears — масив от години с данни
//
// ruoSchools — обект с ключ = код на училище
//   n        — кратко наименование (от School.schoolCodes; при липса — от CSV)
//   f        — пълно наименование (от School.schoolCodes; при липса — от CSV)
//   c        — true ако е частно училище
//   p        — паралелки, обект с ключ = код на паралелка
//     n  — наименование на паралелката
//     d  — данни: масив по позиция на година (съвпада с ruoYears)
//            всяка година: масив от 4 класирания (по позиция, 0 = 1-во)
//            всяко класиране: [мин_общо, мин_м, мин_ж, макс_общо, макс_м, макс_ж]
//                             или null (паралелката е попълнена в предходно класиране)

let ruoYears = [2023, 2024, 2025];

let ruoSchools = {};
ruoSchools["1500706"] = {n: "ПГ по ядрена енерг.", f: "ПГ ядрена енергетика М. Кюри", c: false, p: {
  "1088": {n: "Монтьор по автоматизация, Автоматизирани системи - с Английски език", d: [
    [[30,0,0,395.5,0,0], null, null, null],
    [[30,0,0,410.75,0,0], null, [234,0,0,234,0,0], [234,0,0,234,0,0]],
    [[69,112.5,69,404.5,404.5,164.5], null, null, null]
  ]},
}};
ruoSchools["1500705"] = {n: "СУ Димчо Дебелянов", f: "СУ Димчо Дебелянов", c: false, p: {
  "1988": {n: "Природни науки - Биология и ЗО и Химия и ООС, с Английски език", d: [
    [[95,0,0,356,0,0], null, null, [297.5,0,0,297.5,0,0]],
    [[131,0,0,404,0,0], null, null, null],
    [[76,76,113,401.5,398.5,401.5], null, [411.5,0,0,411.5,0,0], null]
  ]},
  "3825": {n: "Софтуерни и хардуерни науки - Информатика и Информационни технологии - с Английски език", d: [
    [[84,0,0,369,0,0], null, [189,0,0,301,0,0], [95,0,0,345,0,0]],
    [null, null, null, null],
    [null, null, null, null]
  ]},
}};
