// https://data.egov.bg/data/view/066b4b04-d81d-444e-a61c-8ca0516079e4

let si = [];
let s = [];

// София - индексация
si['София'] = {n: [1, 129], p: [130, 156]};
// София - държавни училища
s[1] = {l: '1 АЕГ', n: 'Първа английска ЕГ', b: [5.469, 5.37, 5.44, 5.36, 5.19, 5.04], m: [5.837, 5.466, 5.62, 5.61, 5.34, 5.155], bu: [218, 214, 222, 210, 214, 204], mu: [218, 214, 222, 210, 214, 203], w: 'http://fels-sofia.org'};
s[2] = {l: '1 СУ', n: '1 СУ Пенчо Славейков', b: [4.483, 4.47, 4.54, 4.36, 4.3, 4.33], m: [4.805, 4.51, 4.46, 4.64, 4.651, 4.801], bu: [124, 106, 73, 87, 91, 102], mu: [124, 106, 73, 86, 91, 101], w: 'http://1sousofia.org'};
s[3] = {l: '2 АЕГ', n: 'Втора английска ЕГ', b: [5.309, 5.33, 5.38, 5.31, 5.12, 5.1], m: [5.717, 5.302, 5.55, 5.52, 5.311, 5.288], bu: [211, 220, 208, 201, 208, 199], mu: [211, 221, 208, 201, 208, 199], w: 'http://2els.com'};
s[4] = {l: '2 СУ', n: '2 СУ Акад. Емилиян Станев', b: [4.561, 4.46, 4.48, 4.45, 4.32, 4.16], m: [4.911, 4.445, 4.82, 4.82, 4.383, 4.314], bu: [99, 95, 93, 94, 92, 102], mu: [99, 93, 92, 95, 92, 105], w: 'http://2su.bg'};
s[5] = {l: '3 СУ', n: '3 СУ Марин Дринов', b: [3.412, 3.56, 3.39, 3.41, 2.98, 3.03], m: [3.785, 3.77, 3.81, 3.93, 3.307, 3.783], bu: [12, 25, 22, 27, 20, 25], mu: [12, 26, 24, 25, 19, 24], w: 'http://3coy.eu'};
s[6] = {l: '5 СУ', n: '5 вечерно СУ Пеньо Пенев', b: [4.032, 3.96, 3.77, 3.87, 2.92, 3.37], m: [4.206, 4.028, 3.79, 4.1, 3.415, 3.624], bu: [34, 25, 19, 24, 13, 17], mu: [35, 24, 19, 25, 13, 15], w: 'http://peta-vg.com'};
s[7] = {l: '7 СУ', n: '7 СУ Св. Седмочисленици', b: [4.727, 4.69, 4.7, 4.6, 4.44, 4.27], m: [5.432, 4.893, 5.1, 4.97, 4.817, 4.715], bu: [125, 124, 138, 130, 146, 151], mu: [100, 111, 139, 121, 125, 127], w: 'http://7-mo.com'};
s[8] = {l: '9 ФЕГ', n: '9 Френска ЕГ Алфонс дьо Ламартин', b: [5.324, 5.28, 5.45, 5.26, 5.2, 4.98], m: [5.409, 5.137, 5.33, 5.22, 4.783, 5.067], bu: [202, 193, 196, 202, 207, 193], mu: [202, 193, 196, 203, 208, 194], w: 'http://feg.bg'};
s[9] = {l: '10 СУ', n: '10 СУ Теодор Траянов', b: [3.933, 3.62, 3.86, 3.76, null, null], m: [3.946, 3.945, 3.9, 3.86, null, null], bu: [22, 15, 13, 15, null, null], mu: [22, 15, 13, 14, null, null], w: 'http://10sou.eu'};
s[10] = {l: '12 СУ', n: '12 СУ Цар Иван Асен II', b: [4.519, 4.55, 4.48, 4.55, 4.37, 4.45], m: [4.974, 4.42, 4.66, 4.73, 4.758, 4.757], bu: [67, 84, 75, 68, 70, 76], mu: [67, 86, 75, 67, 71, 74], w: 'http://12sou-sofia.info'};
s[11] = {l: '14 СУ', n: '14 СУ Проф. Д-р Асен Златаров', b: [4.09, 3.85, 3.8, null, 4.09, 3.27], m: [4.136, 4.236, 4.0, null, 4.397, 3.724], bu: [19, 12, 24, null, 18, 16], mu: [19, 12, 24, null, 18, 15], w: 'http://14su.bg'};
s[12] = {l: '15 СУ', n: '15 СУ Адам Мицкевич', b: [3.923, 3.7, 3.46, 3.43, 3.1, 3.21], m: [4.035, 4.148, 3.61, 3.54, 3.155, 3.101], bu: [21, 20, 21, 14, 12, 20], mu: [21, 19, 22, 15, 12, 18], w: 'http://15sou-sofia.com'};
s[13] = {l: '17 СУ', n: '17 СУ Дамян Груев', b: [3.35, null, null, null, 4.08, null], m: [4.24, null, null, null, 2.87, 2.26], bu: [1, null, null, null, 20, null], mu: [1, null, null, null, 20, 6], w: 'http://17su.bg'};
s[14] = {l: '18 СУ', n: '18 СУ Уилям Гладстон', b: [5.201, 5.13, 5.17, 5.05, 4.97, 4.72], m: [5.414, 4.841, 5.15, 5.13, 5.193, 5.2], bu: [218, 201, 208, 217, 209, 209], mu: [218, 201, 209, 217, 212, 208], w: 'http://18sou.net'};
s[15] = {l: '19 СУ', n: '19 СУ Елин Пелин', b: [4.35, 4.45, 4.57, 4.57, 4.52, 4.26], m: [4.697, 4.32, 4.67, 4.82, 4.767, 4.641], bu: [62, 48, 65, 71, 68, 73], mu: [60, 48, 66, 71, 69, 73], w: 'http://19su.bg'};
s[16] = {l: '21 СУ', n: '21 СУ Христо Ботев', b: [4.387, 4.35, 4.34, 4.6, 4.27, 4.23], m: [5.167, 4.407, 4.63, 4.97, 4.326, 4.436], bu: [43, 43, 33, 45, 46, 37], mu: [44, 43, 33, 44, 46, 36], w: 'http://21su.bg'};
s[17] = {l: '22 СУ', n: '22 СЕУ Георги С. Раковски', b: [5.109, 5.16, 5.21, 5.17, 5.05, 4.79], m: [5.425, 5.015, 5.25, 5.25, 5.188, 5.245], bu: [169, 162, 153, 161, 175, 170], mu: [170, 163, 153, 161, 175, 170], w: 'http://22seu.org'};
s[18] = {l: '23 СУ', n: '23 СУ Фредерик Жолио-Кюри', b: [4.137, 4.3, 4.28, 4.08, 3.93, 3.76], m: [4.565, 4.402, 4.53, 4.38, 4.061, 4.443], bu: [87, 119, 70, 76, 52, 68], mu: [87, 121, 70, 76, 52, 68], w: 'http://23su.info'};
s[19] = {l: '24 СУ', n: '24 СУ Пейо К. Яворов', b: [3.144, 2.49, 3.18, 3.21, 2.0, 2.14], m: [3.307, 2.87, 3.29, 3.18, 2.276, 2.506], bu: [17, 5, 14, 19, 7, 11], mu: [17, 4, 14, 17, 5, 8], w: 'http://sou24.bg.cm'};
s[20] = {l: '26 СУ', n: '26 СУ Йордан Йовков', b: [4.015, 3.49, 4.01, 4.02, 3.72, 3.34], m: [4.25, 3.29, 4.45, 4.24, 3.727, null], bu: [16, 7, 23, 12, 13, 2], mu: [15, 7, 23, 13, 13, null], w: 'http://26coy.net'};
s[21] = {l: '27 СУ', n: '27 СУ Акад. Георги Караславов', b: [null, null, null, null, 3.04, 3.3], m: [null, null, null, null, 3.073, 2.0], bu: [null, null, null, null, 12, 4], mu: [null, null, null, null, 13, 3], w: 'http://27su.eu'};
s[22] = {l: '28 СУ', n: '28 СУ Алеко Константинов', b: [3.953, 3.88, 3.72, 3.6, 3.28, 3.11], m: [3.942, 3.66, 4.09, 3.83, 3.68, 3.492], bu: [21, 26, 18, 17, 21, 22], mu: [21, 27, 17, 19, 21, 20], w: 'http://28sou.eu'};
s[23] = {l: '29 СУ', n: '29 СУ Кузман Шапкарев', b: [3.7, 3.46, 3.6, 3.54, 4.11, 3.57], m: [3.6, 3.637, 3.68, 3.68, 5.49, 2.908], bu: [38, 34, 36, 33, 6, 10], mu: [38, 35, 36, 35, 5, 10], w: 'http://sou29.com'};
s[24] = {l: '30 СУ', n: '30 СУ Братя Миладинови', b: [5.112, 4.92, 4.78, 4.78, 4.46, 4.41], m: [5.021, 4.619, 4.91, 4.83, 4.304, 4.741], bu: [66, 65, 50, 60, 69, 80], mu: [67, 65, 50, 61, 69, 83], w: 'http://30su-bg.com'};
s[25] = {l: '31 СУ', n: '31 СУ Иван Вазов', b: [5.25, 5.19, 5.2, 5.12, 5.04, 4.87], m: [5.539, 4.969, 5.23, 5.23, 4.946, 5.047], bu: [150, 156, 162, 151, 160, 129], mu: [150, 156, 162, 151, 160, 130], w: 'http://ivanvazov.com'};
s[26] = {l: '32 СУ', n: '32 СУ Св. Климент Охридски', b: [5.254, 5.02, 5.19, 5.25, 4.96, 4.8], m: [5.653, 4.931, 5.25, 5.56, 5.141, 5.075], bu: [158, 158, 157, 162, 154, 156], mu: [158, 158, 157, 162, 154, 156], w: 'http://school32.com'};
s[27] = {l: '33 ЕГ', n: '33 ЕГ Света София', b: [4.413, 4.39, 4.6, 4.67, 4.51, 4.04], m: [4.693, 4.28, 4.54, 4.93, 4.258, 4.401], bu: [102, 103, 55, 57, 69, 94], mu: [105, 104, 55, 57, 69, 94], w: 'http://33eg.eu'};
s[28] = {l: '35 СУ', n: '35 СЕУ Добри Войников', b: [5.276, 5.34, 5.42, 5.31, 5.18, 5.09], m: [5.125, 5.046, 5.06, 4.97, 4.569, 4.782], bu: [130, 121, 127, 121, 133, 131], mu: [130, 121, 127, 121, 133, 132], w: 'http://35sou.bg'};
s[29] = {l: '36 СУ', n: '36 СУ Максим Горки', b: [4.237, 4.22, 4.03, 4.08, 3.77, 3.91], m: [4.709, 4.179, 4.3, 4.37, 3.635, 5.104], bu: [23, 30, 37, 33, 19, 27], mu: [23, 30, 37, 33, 19, 27], w: 'http://36sou.com'};
s[30] = {l: '37 СУ', n: '37 СУ Райна Княгиня', b: [3.613, 3.12, 3.45, 3.11, 2.42, 2.35], m: [3.612, 2.914, 3.77, 3.33, 2.562, 2.428], bu: [19, 19, 19, 14, 12, 14], mu: [18, 16, 20, 14, 9, 16], w: 'http://37su.eu'};
s[31] = {l: '39 СУ', n: '39 СУ Петър Динеков', b: [3.915, 3.74, 4.59, 3.64, 3.3, 3.18], m: [4.554, 3.942, 4.9, 3.39, 3.011, 3.215], bu: [34, 18, 15, 1, 18, 20], mu: [34, 19, 15, 1, 17, 26], w: 'http://39su.eu'};
s[32] = {l: '40 СУ', n: '40 СУ Луи Пастьор', b: [3.636, 3.98, 3.8, 4.03, 4.13, 3.63], m: [3.795, 4.411, 3.61, 3.94, 3.961, 3.659], bu: [18, 22, 10, 13, 14, 10], mu: [18, 20, 10, 13, 12, 9], w: 'http://40-su.com'};
s[33] = {l: '44 СУ', n: '44 СУ Неофит Бозвели', b: [4.405, 4.39, 4.22, 4.51, 4.16, 3.69], m: [4.405, 4.052, 4.09, 4.54, 3.774, 3.119], bu: [26, 26, 17, 18, 31, 40], mu: [26, 28, 18, 18, 31, 43], w: 'http://44sou.eu'};
s[34] = {l: '47 СУ', n: '47 СУ Христо Г. Данов', b: [3.879, 3.5, 3.77, 3.67, 3.04, 3.69], m: [4.068, 3.372, 3.87, 3.95, 2.634, 3.648], bu: [27, 27, 29, 32, 16, 18], mu: [28, 25, 30, 35, 14, 20], w: 'http://47suhristodanov.com'};
s[35] = {l: '51 СУ', n: '51 СУ Елисавета Багряна', b: [4.452, 4.42, 4.8, 4.58, 4.41, 4.3], m: [4.822, 4.484, 5.02, 4.97, 3.799, 4.433], bu: [81, 81, 85, 91, 87, 91], mu: [81, 82, 85, 90, 88, 91], w: 'http://51su.info'};
s[36] = {l: '54 СУ', n: '54 СУ Св. Иван Рилски', b: [4.424, 4.54, 4.37, 4.28, 4.14, 3.71], m: [4.897, 4.466, 4.55, 4.53, 4.373, 3.547], bu: [44, 35, 21, 79, 67, 35], mu: [44, 35, 21, 79, 68, 35], w: 'http://54suivanrilski.com'};
s[37] = {l: '55 СУ', n: '55 СУ Петко Каравелов', b: [null, null, null, null, 3.58, 3.5], m: [null, null, null, null, 3.275, 3.606], bu: [null, null, null, null, 19, 23], mu: [null, null, null, null, 19, 26], w: 'http://55su.bg'};
s[38] = {l: '56 СУ', n: '56 СУ Проф. Константин Иречек', b: [4.19, 4.24, 4.29, 4.61, 4.33, 3.82], m: [4.323, 4.443, 4.3, 4.76, 4.156, 3.803], bu: [38, 35, 33, 26, 41, 33], mu: [37, 35, 34, 25, 41, 36], w: 'http://su-56.com'};
s[39] = {l: '66 СУ', n: '66 СУ Филип Станиславов', b: [3.471, 3.23, 3.31, 3.31, 2.59, 3.18], m: [3.453, 3.416, 3.42, 3.31, 3.335, 4.092], bu: [9, 14, 12, 16, 9, 6], mu: [10, 15, 12, 17, 8, 7], w: 'http://66sou.org'};
s[40] = {l: '68 СУ', n: '68 СУ Акад. Никола Обрешков', b: [3.769, 3.72, 3.4, 3.43, 3.46, 3.1], m: [3.728, 3.747, 3.69, 3.46, 4.026, 3.16], bu: [29, 22, 18, 18, 21, 21], mu: [29, 22, 18, 18, 21, 17], w: 'http://68su.org'};
s[41] = {l: '69 СУ', n: '69 СУ Димитър Маринов', b: [2.935, 3.29, 3.97, null, null, 3.09], m: [3.035, 3.73, 4.35, null, null, 3.17], bu: [2, 3, 11, null, null, 5], mu: [2, 2, 10, null, null, 5], w: 'http://sou69.com'};
s[42] = {l: '71 СУ', n: '71 СУ Пейо Яворов', b: [3.785, 4.07, 3.95, 3.5, 2.79, 3.38], m: [3.826, 4.572, 4.12, 3.86, 3.47, 3.546], bu: [22, 13, 11, 21, 12, 16], mu: [22, 12, 11, 19, 11, 16], w: 'http://71sou.org'};
s[43] = {l: '73 СУ', n: '73 СУ Владислав Граматик', b: [5.585, 5.6, 5.63, 5.58, 5.43, 5.23], m: [5.623, 5.421, 5.54, 5.24, 5.165, 5.079], bu: [126, 154, 123, 153, 121, 145], mu: [126, 154, 122, 153, 121, 143], w: 'http://73su.bg'};
s[44] = {l: '74 СУ', n: '74 СУ Гоце Делчев', b: [4.097, 3.68, 3.82, 3.76, 3.1, 3.15], m: [4.086, 3.983, 4.18, 3.88, 2.882, 3.237], bu: [30, 40, 42, 30, 23, 29], mu: [29, 38, 42, 29, 23, 29], w: 'http://74su.org'};
s[45] = {l: '78 СУ', n: '78 СУ Христо Смирненски', b: [3.809, 3.66, 3.64, 3.83, 3.51, 3.15], m: [4.008, 3.787, 3.73, 4.28, 3.217, 3.22], bu: [35, 30, 31, 19, 31, 15], mu: [36, 29, 31, 18, 30, 15], w: 'http://78su.net'};
s[46] = {l: '79 СУ', n: '79 СУ Индира Ганди', b: [4.204, 3.74, 3.65, 4.11, 3.41, 2.85], m: [4.213, 3.905, 4.04, 4.38, 3.117, 2.916], bu: [28, 22, 28, 25, 22, 29], mu: [28, 22, 27, 25, 21, 33], w: 'http://79su.bg'};
s[47] = {l: '81 СУ', n: '81 СУ Виктор Юго', b: [4.286, 4.2, 4.08, 4.33, 4.22, 3.79], m: [4.848, 4.65, 4.16, 4.53, 4.057, 4.15], bu: [17, 21, 34, 43, 22, 36], mu: [17, 21, 34, 44, 22, 36], w: 'http://81su.eu'};
s[48] = {l: '85 СУ', n: '85 СУ Отец Паисий', b: [3.593, 3.66, 3.11, 3.33, 2.77, 2.7], m: [3.798, 3.801, 3.34, 3.65, 2.697, 2.711], bu: [20, 11, 16, 22, 24, 30], mu: [19, 11, 16, 18, 21, 26], w: 'http://su85.org'};
s[49] = {l: '88 СУ', n: '88 СУ Димитър Попниколов', b: [4.157, 4.48, 4.33, 3.97, 3.61, 3.79], m: [4.659, 4.356, 4.57, 4.45, 3.889, 3.598], bu: [39, 40, 46, 36, 36, 25], mu: [40, 41, 46, 36, 36, 25], w: 'http://88cy.info'};
s[50] = {l: '90 СУ', n: '90 СУ Ген. Хосе де Сан Мартин', b: [4.173, 3.92, 3.64, 3.99, 3.75, 3.55], m: [4.127, 3.69, 3.88, 3.85, 3.142, 3.882], bu: [32, 11, 19, 14, 16, 17], mu: [32, 10, 19, 14, 15, 18], w: 'http://sou90.org'};
s[51] = {l: '91 НЕГ', n: '91 немска ЕГ', b: [5.624, 5.64, 5.7, 5.63, 5.5, 5.43], m: [5.782, 5.6, 5.75, 5.63, 5.739, 5.715], bu: [190, 186, 192, 187, 184, 192], mu: [174, 166, 167, 167, 159, 176], w: 'http://91neg.bg'};
s[52] = {l: '93 СУ', n: '93 СУ Ал. Теодоров - Балан', b: [3.848, 3.38, 3.56, 3.69, 3.64, 3.71], m: [3.797, 3.538, 3.64, 3.96, 3.701, 3.711], bu: [34, 18, 15, 18, 39, 44], mu: [36, 18, 18, 18, 39, 44], w: 'http://93su.bg'};
s[53] = {l: '94 СУ', n: '94 СУ Д. Страшимиров', b: [3.25, 3.11, 3.09, 3.24, 2.39, 2.28], m: [3.057, 3.197, 3.23, 3.52, 3.86, 3.113], bu: [22, 25, 29, 33, 32, 35], mu: [16, 21, 16, 23, 30, 38], w: 'http://school94-sofia.com'};
s[54] = {l: '95 СУ', n: '95 СУ Проф. Иван Шишманов', b: [3.931, 3.87, 3.91, 4.01, 3.96, 3.48], m: [4.098, 3.891, 3.99, 4.36, 3.734, 3.303], bu: [32, 31, 49, 49, 38, 49], mu: [32, 30, 50, 49, 36, 50], w: 'http://95su.bg'};
s[55] = {l: '96 СУ', n: '96 СУ Лев Николаевич Толстой', b: [4.58, 4.47, 4.41, 4.31, 3.91, 3.3], m: [4.513, 4.18, 4.52, 4.35, 3.762, 3.207], bu: [22, 20, 42, 45, 34, 24], mu: [23, 20, 42, 46, 35, 24], w: 'http://96sou.com'};
s[56] = {l: '97 СУ', n: '97 СУ Братя Миладинови', b: [3.957, 3.9, 3.97, 3.76, 3.63, 3.59], m: [3.924, 4.04, 4.13, 4.38, 3.823, 3.896], bu: [55, 44, 50, 38, 36, 48], mu: [57, 47, 51, 38, 36, 47], w: 'http://97su.bg'};
s[57] = {l: '101 СУ', n: '101 СУ Бачо Киро', b: [3.815, 3.97, 4.15, 3.93, 3.69, 3.42], m: [3.948, 3.792, 4.23, 4.33, 3.913, 3.699], bu: [49, 39, 44, 41, 27, 35], mu: [46, 40, 44, 41, 26, 33], w: 'http://101su.bg'};
s[58] = {l: '105 СУ', n: '105 СУ Атанас Далчев', b: [4.42, 4.35, 4.16, 4.23, 4.24, 4.0], m: [4.65, 4.304, 4.4, 4.41, 4.314, 4.436], bu: [44, 64, 54, 63, 69, 72], mu: [44, 65, 55, 63, 69, 74], w: 'http://105sou.eu'};
s[59] = {l: '108 СУ', n: '108 СУ Никола Беловеждов', b: [4.178, 3.93, 3.95, 3.89, 3.66, 3.39], m: [4.537, 3.772, 4.0, 4.06, 3.363, 3.61], bu: [20, 33, 44, 18, 24, 25], mu: [20, 33, 44, 18, 24, 25], w: 'http://108su.net'};
s[60] = {l: '113 СУ', n: '113 СУ Сава Филаретов', b: [3.37, 3.01, 2.76, 3.16, 2.17, 2.0], m: [3.301, 3.169, 2.84, 2.99, 2.0, 2.0], bu: [14, 11, 2, 6, 6, 6], mu: [11, 11, 1, 6, 6, 7], w: 'http://113su.net'};
s[61] = {l: '117 СУ', n: '117 СУ Св. Св. Кирил и Методий', b: [3.897, 3.87, 3.75, 3.58, 3.12, 2.71], m: [4.155, 3.936, 3.79, 3.84, 2.373, 2.475], bu: [9, 13, 20, 22, 23, 13], mu: [10, 13, 20, 21, 23, 20], w: 'http://117sou.bg'};
s[62] = {l: '118 СУ', n: '118 СУ Акад. Людмил Стоянов', b: [4.109, 3.92, 4.26, 4.01, 3.69, 3.4], m: [4.494, 4.288, 4.19, 4.59, 3.429, 3.057], bu: [24, 23, 14, 24, 20, 22], mu: [24, 23, 14, 24, 20, 28], w: 'http://sou118.com'};
s[63] = {l: '119 СУ', n: '119 СУ Акад. Михаил Арнаудов', b: [4.501, 4.45, 4.59, 4.58, 4.64, 4.17], m: [4.908, 4.546, 4.84, 4.87, 4.545, 4.305], bu: [75, 94, 92, 93, 105, 107], mu: [75, 94, 92, 93, 105, 107], w: 'http://119su.bg'};
s[64] = {l: '121 СУ', n: '121 СУ Георги Измирлиев', b: [3.514, 3.59, 3.77, 3.49, 3.51, 3.54], m: [3.856, 3.615, 4.1, 4.01, null, 3.014], bu: [24, 22, 16, 18, 1, 20], mu: [23, 23, 16, 17, null, 20], w: 'http://121su.org'};
s[65] = {l: '123 СУ', n: '123 СУ Стефан Стамболов', b: [3.214, 3.47, 3.44, 3.26, 2.95, 2.46], m: [3.287, 3.308, 3.34, 3.26, 2.818, 4.25], bu: [17, 10, 9, 16, 14, 9], mu: [15, 10, 7, 17, 16, 6], w: 'http://123sustefanstambolov.com'};
s[66] = {l: '125 СУИЧЕ', n: '125 СУИЧЕ Боян Пенев', b: [4.011, null, null, null, 4.78, 4.26], m: [4.487, null, null, null, 4.988, 4.638], bu: [24, null, null, null, 38, 33], mu: [24, null, null, null, 38, 32], w: 'https://sou125.com'};
s[67] = {l: '127 СУ', n: '127 СУ Иван Николаевич Денкоглу', b: [4.818, 4.79, 4.97, 4.74, 4.6, 4.53], m: [5.228, 4.834, 5.01, 4.84, 4.808, 4.596], bu: [141, 131, 132, 131, 118, 129], mu: [143, 131, 132, 131, 117, 129], w: 'http://127sou.com'};
s[68] = {l: '128 СУ', n: '128 СУ Алберт Айнщайн', b: [4.309, 3.89, 3.97, 4.02, 3.93, 3.56], m: [4.584, 4.07, 4.23, 4.34, 4.569, 4.436], bu: [23, 67, 42, 50, 42, 41], mu: [23, 67, 42, 51, 42, 40], w: 'http://128sou-sofia.info'};
s[69] = {l: '130 СУ', n: '130 СУ Стефан Караджа', b: [3.767, 3.5, 3.52, 3.41, 2.44, 2.44], m: [3.88, 3.431, 3.52, 3.58, 2.68, 2.5], bu: [17, 9, 16, 13, 13, 14], mu: [17, 8, 16, 13, 13, 10], w: 'http://130cy.com'};
s[70] = {l: '131 СУ', n: '131 СУ Климент Аркад. Тимирязев', b: [3.942, 4.12, 3.92, 3.9, 2.87, null], m: [3.94, 4.053, 3.85, 4.02, 3.239, null], bu: [14, 17, 15, 19, 11, null], mu: [12, 17, 15, 17, 11, null], w: 'http://131su.eu'};
s[71] = {l: '132 СУ', n: '132 СУ Ваня Войнова', b: [3.906, 3.57, 4.06, 3.95, 3.25, 3.33], m: [4.012, 3.701, 4.19, 4.24, 3.432, 3.412], bu: [83, 42, 51, 62, 48, 53], mu: [78, 42, 51, 63, 46, 56], w: 'http://132su.com'};
s[72] = {l: '133 СУ', n: '133 СУ Александър Сергеевич Пушкин', b: [5.296, 5.21, 5.34, 5.25, 5.18, 4.96], m: [5.449, 5.085, 5.27, 5.22, 5.146, 5.126], bu: [100, 107, 105, 105, 100, 102], mu: [100, 107, 105, 105, 101, 102], w: 'http://133sou.com'};
s[73] = {l: '134 СУ', n: '134 СУ Димчо Дебелянов', b: [4.867, 4.86, 4.9, 4.84, 5.0, 4.66], m: [5.307, 4.664, 5.14, 5.37, 5.056, 4.788], bu: [77, 75, 75, 78, 78, 73], mu: [77, 75, 76, 78, 77, 73], w: 'http://hebrewschool-bg.org'};
s[74] = {l: '135 СУ', n: '135 СУ Ян Амос Коменски', b: [3.906, 3.77, 4.11, 4.14, 3.68, 3.39], m: [3.973, 3.67, 4.26, 4.23, 5.13, 4.6], bu: [18, 12, 21, 19, 14, 9], mu: [18, 13, 20, 18, 14, 9], w: 'http://sites.google.com/view/135su-new'};
s[75] = {l: '137 СУ', n: '137 СУ Ангел Кънчев', b: [4.391, 4.05, 4.23, 4.39, 3.92, 3.75], m: [4.918, 4.088, 4.45, 4.85, 3.263, 3.359], bu: [80, 65, 70, 42, 59, 66], mu: [81, 64, 71, 42, 59, 77], w: 'http://137sou.org'};
s[76] = {l: '138 СУ', n: '138 СУ Проф. Васил Златарски', b: [4.575, 4.58, 4.47, 4.37, 4.48, 4.41], m: [4.949, 4.407, 4.55, 4.43, 4.693, 4.899], bu: [99, 93, 92, 103, 97, 101], mu: [97, 94, 93, 104, 96, 104], w: 'http://138suzie.com'};
s[77] = {l: '140 СУ', n: '140 СУ Иван Богоров', b: [3.276, 3.52, 3.64, 3.56, 2.87, 3.48], m: [3.344, 3.663, 3.7, 3.74, 2.788, 4.096], bu: [11, 30, 31, 30, 21, 24], mu: [13, 31, 31, 28, 18, 23], w: 'http://140su.com'};
s[78] = {l: '144 СУ', n: '144 СУ Народни будители', b: [4.127, 4.12, 4.3, 4.1, 3.92, 3.74], m: [4.077, 4.111, 4.21, 4.23, 4.065, 4.19], bu: [59, 70, 45, 67, 63, 67], mu: [63, 73, 45, 68, 63, 68], w: 'http://144sou.bg'};
s[79] = {l: '149 СУ', n: '149 СУ Иван Хаджийски', b: [3.731, 3.59, 3.82, 3.42, 3.38, 3.34], m: [4.14, 3.47, 3.66, 3.35, 2.852, 2.979], bu: [15, 25, 15, 19, 13, 27], mu: [12, 25, 16, 20, 13, 30], w: 'http://149suih.org'};
s[80] = {l: '157 СУ', n: '157 СУ Сесар Вайехо', b: [5.133, 4.95, 5.07, 4.88, 4.54, 4.37], m: [4.998, 4.762, 4.94, 4.87, 5.052, 5.004], bu: [107, 110, 98, 95, 93, 95], mu: [108, 110, 98, 95, 93, 95], w: 'http://157giche.com'};
s[81] = {l: '164 СУ', n: '164 СУ Мигел де Сервантес', b: [5.605, 5.54, 5.56, 5.62, 5.4, 5.37], m: [5.538, 5.578, 5.55, 5.67, 5.302, 5.356], bu: [138, 135, 138, 149, 178, 169], mu: [138, 135, 138, 149, 178, 169], w: 'http://ibbcervantes-bg.com'};
s[82] = {l: '170 СУ', n: '170 СУ Васил Левски', b: [3.814, 4.02, 4.03, 4.13, 3.85, 3.76], m: [3.877, 3.849, 3.95, 4.34, 3.781, 3.564], bu: [35, 44, 39, 38, 29, 38], mu: [35, 44, 41, 38, 29, 36], w: 'http://170su.com'};
s[83] = {l: '192 СУ', n: '192 СУ Христо Ботев', b: [3.894, 3.45, 3.81, 3.48, null, 2.9], m: [4.283, 3.548, 4.32, 4.22, null, 3.501], bu: [18, 23, 12, 12, null, 18], mu: [18, 22, 12, 12, null, 18], w: 'http://hristobotev.net'};
s[84] = {l: '203 ЕГ', n: '203 Профилирана ЕГ Свети Методий', b: [4.304, 4.07, 4.26, 4.05, 3.59, 3.45], m: [4.835, 4.196, 4.47, 4.3, 3.775, 3.64], bu: [87, 55, 23, 20, 47, 40], mu: [86, 55, 26, 21, 47, 37], w: 'http://stmethodiushs.bg'};
s[85] = {l: 'Гимн. по хлебни техн.', n: 'Софийска гимназия по хлебни/сладкарски технологии', b: [3.663, 3.5, 3.67, 3.35, 3.03, 3.15], m: [3.926, 3.405, 3.71, 3.44, 4.53, 4.412], bu: [57, 45, 48, 27, 26, 24], mu: [53, 35, 38, 23, 23, 19], w: 'http://sghst.com'};
s[86] = {l: 'Гимназия за приложни изкуства', n: 'Гимназия за приложни изкуства Св. Лука', b: [4.457, 4.34, 4.6, 4.52, 4.47, 4.36], m: [3.732, 4.845, 4.85, 4.95, 4.73, 4.93], bu: [90, 92, 91, 98, 90, 97], mu: [5, 14, 46, 38, 89, 98], w: 'http://ngpisvetiluka.com'};
s[87] = {l: 'Гимназия по строит., арх. и геод.', n: 'Гимназия по строителство, архитектура и геодезия', b: [4.881, 4.79, 4.88, 4.94, 4.63, 4.32], m: [4.93, 4.52, 4.45, 4.79, 4.424, 4.38], bu: [181, 173, 178, 178, 182, 168], mu: [179, 173, 169, 168, 182, 170], w: 'http://sgcag.info'};
s[88] = {l: 'Духовна семинария', n: 'Софийска духовна семинария', b: [3.773, 3.66, 3.89, 4.03, 3.23, 3.26], m: [3.768, 3.79, 3.95, 4.67, 3.32, 3.24], bu: [11, 13, 9, 9, 11, 13], mu: [11, 13, 10, 9, 11, 13], w: 'http://sofia-seminaria.org'};
s[89] = {l: 'Луи Брайл', n: 'Специално училище за ученици с нарушено зрение Луи Брайл', b: [4.647, 4.92, 5.6, 5.31, 4.03, 3.79], m: [4.412, 4.153, 5.71, 4.58, 3.405, 3.3], bu: [4, 6, 2, 3, 6, 6], mu: [4, 6, 2, 3, 6, 6], w: 'http://suunz.org'};
s[90] = {l: 'Национално СУ', n: 'Национално СУ София', b: [4.037, 3.96, 4.04, 3.7, 3.43, 3.65], m: [4.24, 4.07, 4.24, 4.27, 3.256, 3.522], bu: [49, 36, 37, 29, 19, 31], mu: [51, 36, 37, 29, 18, 32], w: 'http://nsousofia.org'};
s[91] = {l: 'НГДЕК', n: 'Национална гимназия за древни езици и култури', b: [5.426, 5.18, 5.3, 5.36, 5.07, 5.06], m: [5.454, 4.948, 5.23, 5.24, 5.083, 4.561], bu: [94, 93, 73, 70, 75, 78], mu: [94, 93, 73, 70, 75, 78], w: 'http://ngdek.com'};
s[92] = {l: 'НМУ', n: 'Национално музикално училище', b: [4.621, 4.48, 4.62, 4.74, 4.27, 4.21], m: [4.993, 4.33, 4.64, 5.07, 4.96, 4.66], bu: [71, 68, 68, 62, 80, 73], mu: [22, 41, 31, 32, 78, 72], w: 'http://nmu.bg'};
s[93] = {l: 'НПМГ', n: 'НПМГ Акад. Любомир Чакалов', b: [5.143, 5.19, 5.28, 5.17, 5.24, 5.0], m: [5.537, 5.258, 5.49, 5.4, 4.86, 4.888], bu: [235, 237, 234, 237, 244, 246], mu: [234, 236, 234, 238, 244, 248], w: 'http://npmg.org'};
s[94] = {l: 'НУКК', n: 'НУКК (Италиански лицей)', b: [5.062, 4.92, 5.2, 5.17, 4.86, 4.6], m: [5.562, 5.023, 5.38, 5.22, 4.754, 4.745], bu: [54, 51, 49, 50, 49, 54], mu: [54, 51, 49, 50, 49, 54], w: 'http://nukk.org'};
s[95] = {l: 'ПГ за изобр. изкуства', n: 'ПГ за изобразителни изкуства', b: [4.19, 3.92, 4.28, 4.34, 4.04, 4.1], m: [3.45, null, null, 4.18, 4.902, 5.21], bu: [29, 22, 26, 29, 38, 26], mu: [1, null, null, 2, 39, 26], w: 'http://pgii-nrainov.eu'};
s[96] = {l: 'ПГ Княгиня Евдокия', n: 'Софийска ПГ Княгиня Евдокия', b: [3.772, 3.51, 3.52, 3.45, 3.1, 3.1], m: [3.952, 3.562, 3.44, 3.81, 4.59, 4.356], bu: [48, 61, 42, 39, 27, 51], mu: [13, 12, 11, 3, 25, 53], w: 'http://spgke.com'};
s[97] = {l: 'ПГ по аудио, видео и телек.', n: 'ПГ по аудио, видое и телекомуникация', b: [3.926, 3.72, 3.97, 3.79, 3.65, 3.52], m: [4.365, 3.831, 4.12, 4.12, 4.368, 4.822], bu: [147, 135, 98, 123, 105, 157], mu: [142, 125, 92, 77, 98, 149], w: 'http://aspopov.bg'};
s[98] = {l: 'ПГ по дизайн', n: 'ПГ по дизайн Елисавета Вазова', b: [4.233, 3.93, 4.21, 4.19, 4.13, 4.04], m: [4.415, 4.093, 4.03, 4.82, 5.07, 5.268], bu: [56, 82, 62, 50, 91, 91], mu: [10, 30, 25, 5, 92, 94], w: 'http://pgdsofia.com'};
s[99] = {l: 'ПГ по екол. и биот.', n: 'ПГ по екология и биотехнологии', b: [4.262, 4.26, 4.29, 4.21, 4.24, 3.73], m: [4.418, 4.097, 4.43, 4.09, 4.56, 4.53], bu: [64, 46, 49, 50, 47, 50], mu: [63, 47, 48, 36, 46, 51], w: 'http://pgeb-bg.com'};
s[100] = {l: 'ПГ по електроника', n: 'ПГ по електроника Джон Атанасов', b: [4.483, 4.4, 4.58, 4.58, 4.37, 4.3], m: [4.972, 4.35, 4.85, 4.67, 4.97, 5.366], bu: [193, 205, 186, 225, 249, 234], mu: [192, 205, 187, 223, 247, 236], w: 'http://spge-bg.com'};
s[101] = {l: 'ПГ по електрот. и авт.', n: 'ПГ по електротехника и автоматика', b: [4.079, 4.04, 4.18, 4.09, 4.0, 3.74], m: [4.627, 4.303, 4.58, 4.52, 5.018, 4.72], bu: [115, 124, 134, 132, 83, 108], mu: [113, 113, 102, 75, 82, 104], w: 'http://pgea.bg'};
s[102] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.504, 3.3, 3.23, 3.47, 2.74, 2.72], m: [3.628, 3.543, 3.38, 3.87, 3.58, 3.54], bu: [77, 51, 29, 46, 29, 49], mu: [79, 52, 31, 46, 27, 38], w: 'http://pgme-sofia.eu'};
s[103] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [4.077, 4.06, 3.87, 4.02, 3.74, 3.69], m: [4.455, 3.852, 4.58, 3.62, 5.26, 5.05], bu: [40, 51, 42, 42, 53, 61], mu: [19, 28, 5, 9, 52, 59], w: 'http://pgo-sofia.com'};
s[104] = {l: 'ПГ по под/стр/тр. техн.', n: 'ПГ по подемна, строителна и транспортна техника', b: [3.433, 3.34, 3.09, 3.18, 2.39, 2.14], m: [3.496, 3.197, 2.8, 3.82, 3.52, 4.04], bu: [43, 54, 27, 32, 8, 15], mu: [43, 57, 6, 8, 6, 11], w: 'http://pgpstt.com'};
s[105] = {l: 'ПГ по полигр. и фотогр.', n: 'ПГ по полиграфия и фотография', b: [4.771, 4.57, 4.36, 4.57, 4.37, 4.44], m: [null, 4.33, null, 3.14, 4.9, 5.3], bu: [126, 111, 108, 135, 103, 101], mu: [null, 2, null, 1, 103, 101], w: 'http://npgpf.com'};
s[106] = {l: 'ПГ по прец. техн. и опт.', n: 'ПГ по прецизна техника и оптика', b: [4.432, 4.25, 4.52, 4.42, 4.13, 4.18], m: [4.861, 4.287, 4.56, 4.65, 4.62, 4.79], bu: [226, 200, 195, 181, 182, 180], mu: [183, 184, 177, 166, 181, 177], w: 'http://lomonosov-bg.com'};
s[107] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.106, 2.67, 2.92, 3.12, 2.37, 2.0], m: [2.76, 2.832, 2.57, 3.67, 2.0, 2.985], bu: [3, 5, 6, 13, 4, 8], mu: [3, 5, 1, 2, 5, 7], w: 'http://pgss-buzema.eu'};
s[108] = {l: 'ПГ по текстил', n: 'ПГ по текстилни и кожени изделия', b: [2.91, 2.87, 2.72, 3.08, 2.65, 2.52], m: [3.092, 3.022, 2.85, 3.26, 3.884, 4.288], bu: [21, 20, 17, 13, 18, 19], mu: [21, 11, 4, 2, 18, 20], w: 'http://pgtki.org'};
s[109] = {l: 'ПГ по телекомуникации', n: 'ПГ по телекомуникации', b: [4.151, 4.23, 4.33, 4.25, 4.13, 3.74], m: [4.921, 4.479, 4.66, 4.67, 4.62, 4.78], bu: [126, 142, 157, 181, 156, 175], mu: [123, 138, 149, 165, 159, 176], w: 'http://tcom-sf.org'};
s[110] = {l: 'ПГ по трансп. и енерг.', n: 'ПГ по транспорт и енергетика', b: [3.948, 3.71, 3.81, 3.6, 3.38, 3.19], m: [4.107, 3.867, 3.99, 3.87, 3.03, 3.189], bu: [143, 154, 114, 126, 133, 187], mu: [102, 114, 84, 72, 137, 169], w: 'http://pgtehford.com'};
s[111] = {l: 'ПГ по трансп. Макгахан', n: 'ПГ по транспорт Макгахан', b: [3.387, 3.32, 3.49, 3.54, 3.27, 3.09], m: [3.529, 3.486, 3.72, 3.68, 4.08, 3.617], bu: [87, 59, 62, 52, 35, 54], mu: [84, 55, 50, 48, 36, 54], w: 'http://pgtmakgahan.eu'};
s[112] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.525, 3.42, 3.37, 3.36, 3.39, 3.17], m: [3.721, 3.658, 3.56, 3.67, 4.34, 4.54], bu: [26, 51, 40, 41, 37, 42], mu: [28, 51, 34, 35, 28, 34], w: 'http://pgtsofia.com'};
s[113] = {l: 'ПГ по туризъм', n: 'Софийска ПГ по туризъм', b: [4.499, 4.34, 4.26, 4.22, 3.98, 3.74], m: [4.58, 4.034, 4.57, 4.7, 5.052, 5.19], bu: [171, 178, 167, 174, 172, 170], mu: [61, 94, 40, 39, 170, 168], w: 'http://spgt.org'};
s[114] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хранително-вкусови технологии', b: [3.624, 3.49, 3.34, 3.56, 2.75, 2.81], m: [3.9, 3.695, 3.68, 3.92, 3.87, 4.31], bu: [44, 40, 41, 60, 43, 49], mu: [40, 30, 16, 20, 43, 37], w: 'http://pghvt-gpavlov.org'};
s[115] = {l: 'ПГТ - Банкя', n: 'ПГ по туризъм А. Константинов', b: [3.771, 3.54, 3.65, 3.71, 3.13, 3.12], m: [4.083, 3.767, 4.3, 4.38, 4.374, 4.801], bu: [137, 121, 83, 91, 78, 86], mu: [115, 64, 24, 9, 75, 73], w: 'http://pgtbankya.com'};
s[116] = {l: 'Румънска гимназия', n: 'Румънска гимназия Михай Еминеску', b: [3.962, 4.42, 4.71, 4.72, 4.22, 3.83], m: [4.248, 4.453, 4.68, 4.82, 4.639, 4.81], bu: [15, 16, 24, 26, 40, 30], mu: [15, 16, 24, 26, 39, 30], w: 'http://pgiire.com'};
s[117] = {l: 'СМГ', n: 'СМГ Паисий Хилендарски', b: [5.517, 5.44, 5.48, 5.42, 5.38, 5.36], m: [5.828, 5.757, 5.74, 5.68, 5.558, 5.188], bu: [186, 170, 165, 169, 176, 166], mu: [186, 170, 165, 169, 176, 167], w: 'http://smg.bg'};
s[118] = {l: 'Сменно-вечерна гимназия', n: 'IV сменно-вечерна гимназия', b: [3.763, 3.79, 3.84, 3.76, 3.67, 3.54], m: [3.946, 3.931, 3.98, 3.91, 3.824, 3.678], bu: [90, 78, 72, 96, 47, 57], mu: [89, 80, 73, 97, 45, 52], w: 'http://ve4erna.com'};
s[119] = {l: 'СпУ В. Левски', n: '166 спортно у-ще Васил Левски', b: [3.761, 3.46, 3.85, 3.69, 3.22, 3.6], m: [4.436, 3.733, 3.84, 4.29, 4.875, 5.363], bu: [85, 80, 83, 91, 74, 95], mu: [16, 17, 28, 9, 69, 86], w: 'http://166su.com'};
s[120] = {l: 'СпУ Вл. Стойчев', n: 'Спортно у-ще ген. Владимир Стойчев', b: [3.859, 3.72, 3.88, 3.77, 3.55, 3.46], m: [4.091, 3.912, 4.2, 4.12, 4.845, 5.12], bu: [87, 105, 98, 99, 89, 77], mu: [74, 68, 47, 53, 89, 78], w: 'http://sugvs-sofia.com'};
s[121] = {l: 'СпУ Неофит Рилски', n: '153 спортно у-ще Неофит Рилски', b: [3.478, 3.36, 3.55, 3.4, 3.01, 2.97], m: [null, 3.59, 3.15, 3.69, 4.601, 4.552], bu: [25, 42, 51, 50, 65, 58], mu: [null, 2, 2, 6, 64, 54], w: 'http://nrilski153.org'};
s[122] = {l: 'СпУ Св. Наум', n: '57 спортно у-ще Св. Наум Охридски', b: [3.549, 3.34, 3.49, 3.5, 2.87, 2.96], m: [4.014, 4.095, 3.67, 4.03, 4.62, 4.672], bu: [81, 68, 80, 75, 71, 60], mu: [20, 17, 37, 18, 70, 52], w: 'http://57su.com'};
s[123] = {l: 'СУ Св. Иван Рилски', n: 'СУ Св. Иван Рилски', b: [null, 3.24, 3.36, 3.57, null, null], m: [null, 3.709, 3.29, 3.42, null, null], bu: [null, 3, 4, 2, null, null], mu: [null, 3, 3, 2, null, null], w: 'http://su-ivanrilski.com'};
s[124] = {l: 'ТУЕС', n: 'ТУЕС към Технически Университет', b: [4.916, 4.9, 5.06, 5.11, 4.95, 4.76], m: [5.604, 5.06, 5.27, 5.22, 4.89, 4.81], bu: [96, 98, 98, 92, 88, 105], mu: [97, 98, 98, 91, 86, 106], w: 'http://elsys-bg.org'};
s[125] = {l: 'Търговско-банкова', n: 'Търговско-банкова гимназия', b: [5.026, 4.82, 5.0, 4.87, 4.76, 4.63], m: [5.258, 4.743, 5.0, 4.85, 5.69, 5.7], bu: [255, 251, 236, 256, 286, 272], mu: [168, 157, 74, 70, 287, 273], w: 'http://ntbg.bg'};
s[126] = {l: 'У-ще за изящни изкуства', n: 'Училище за изящни изкуства', b: [4.491, 4.55, 4.62, 4.64, 4.63, 4.35], m: [5.93, 4.92, 4.88, 4.03, 4.44, 5.139], bu: [51, 54, 51, 53, 51, 53], mu: [1, 1, 2, 5, 51, 53], w: 'http://hg-iliapetrov.com'};
s[127] = {l: 'У-ще за танцово изкуство', n: 'Училище за танцово изкуство', b: [4.154, 4.14, 4.37, 4.45, 4.13, 3.87], m: [3.396, null, null, null, 5.06, 4.97], bu: [59, 62, 57, 65, 56, 58], mu: [3, null, null, null, 56, 57], w: 'http://nutibg.com'};
s[128] = {l: 'У-ще за ученици с увр. слух', n: 'Специално училище за ученици с увреден слух', b: [3.048, 2.78, null, 2.35, 2.84, 2.92], m: [2.64, 2.52, null, null, 3.95, 4.27], bu: [10, 5, null, 4, 2, 7], mu: [1, 2, null, null, 4, 10], w: 'http://deafschoolsofia.com'};
s[129] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска гимназия', b: [5.108, 5.09, 5.05, 4.85, 4.77, 4.57], m: [5.351, 4.471, 4.97, 4.94, 5.28, 4.834], bu: [176, 185, 196, 207, 175, 159], mu: [159, 166, 174, 150, 175, 158], w: 'http://nfsg-sofia.net'};
// София - частни училища
s[130] = {l: 'Абрахам Линкълн', n: 'ЧСУ с чуждоезиков профил Абрахам Линкълн', b: [null, null, 4.67, null, 4.07, 4.78], m: [null, null, 5.49, null, 4.66, 5.54], bu: [null, null, 3, null, 6, 2], mu: [null, null, 3, null, 6, 2], w: 'http://lincolnsofia.com'};
s[131] = {l: 'Американски колеж', n: 'Американски колеж', b: [5.546, 5.51, 5.59, 5.52, 5.33, 5.16], m: [5.934, 5.577, 5.74, 5.67, 5.582, 5.354], bu: [141, 151, 154, 161, 152, 178], mu: [141, 151, 154, 162, 152, 178], w: 'http://acs.bg'};
s[132] = {l: 'Артис', n: 'ЧСУ Артис', b: [null, null, null, null, 4.62, 3.93], m: [null, null, null, null, 4.83, 4.273], bu: [null, null, null, null, 6, 5], mu: [null, null, null, null, 6, 5], w: 'http://artisbg.com'};
s[133] = {l: 'Банкер', n: 'ЧПГ Банкер', b: [4.867, 4.71, 4.64, 4.63, 4.86, 4.7], m: [null, null, null, null, 5.84, 5.88], bu: [11, 6, 13, 12, 6, 8], mu: [null, null, null, null, 6, 8], w: 'http://banker-school.com'};
s[134] = {l: 'Банково дело', n: 'ЧПГ по банково дело търговия и финанси', b: [4.187, 4.07, 4.07, null, null, 3.89], m: [5.018, 3.75, 4.46, null, null, 5.16], bu: [11, 9, 7, null, null, 13], mu: [11, 8, 2, null, null, 13], w: 'http://btf.ntbg.bg'};
s[135] = {l: 'Британика', n: 'ЧСЕУ Британика', b: [4.431, 4.77, 4.51, 4.74, 4.83, 4.36], m: [5.038, 5.045, 5.27, 4.78, 5.02, 4.96], bu: [16, 19, 15, 13, 11, 13], mu: [16, 19, 15, 13, 11, 13], w: 'http://britanica-parkschool.bg'};
s[136] = {l: 'В. Златарски', n: 'ЧЕГ Проф. д-р В. Златарски', b: [5.003, 5.18, 5.09, 4.91, 4.62, 4.53], m: [5.82, 5.21, 5.64, 5.54, 5.08, 5.21], bu: [45, 49, 44, 41, 44, 38], mu: [45, 48, 44, 41, 44, 38], w: 'http://zlatarskischool.org'};
s[137] = {l: 'Веда', n: 'ЧСУ с немски език Веда', b: [5.045, 5.01, 4.7, 5.15, 5.85, 4.57], m: [5.637, 5.212, 5.16, 5.42, 5.834, 5.9], bu: [11, 14, 8, 11, 5, 8], mu: [11, 14, 8, 11, 5, 8], w: 'http://wedaschule.com'};
s[138] = {l: 'Дорис Тенеди', n: 'ЧЕСУ Дорис Тенеди', b: [5.341, 5.46, 5.3, 5.15, 5.0, 4.94], m: [5.726, 5.35, 5.73, 5.44, 5.44, 5.504], bu: [36, 31, 22, 27, 27, 36], mu: [36, 31, 22, 27, 26, 36], w: 'http://doristenedi.com'};
s[139] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [4.659, 4.54, 4.62, 4.48, 4.28, 4.24], m: [5.383, 4.755, 4.93, 4.87, 4.86, 4.388], bu: [46, 48, 23, 30, 27, 20], mu: [46, 48, 23, 30, 27, 21], w: 'http://drujba.org'};
s[140] = {l: 'Езиков свят', n: 'ЧПГ с чуждоезиково обучение Езиков свят', b: [4.284, 4.15, 4.01, 4.63, 4.26, 3.8], m: [5.317, 3.983, 4.21, 4.96, 4.575, 4.118], bu: [9, 11, 7, 14, 6, 15], mu: [9, 11, 7, 14, 6, 15], w: 'http://www.ezikovsviat.com'};
s[141] = {l: 'Ерих Кестнер', n: 'ЧНГ Ерих Кестнер', b: [5.249, 5.25, 5.39, 5.1, 4.73, 4.44], m: [5.507, 5.332, 5.46, 5.33, 5.459, 5.79], bu: [18, 14, 10, 15, 14, 11], mu: [18, 14, 10, 15, 14, 11], w: 'http://eks-bg.eu'};
s[142] = {l: 'Иван Апостолов', n: 'ЧЕГ Проф. Иван Апостолов', b: [4.902, 5.12, 4.89, 5.14, 4.73, 4.71], m: [5.838, 5.385, 5.54, 5.67, 5.33, 5.229], bu: [31, 32, 37, 38, 43, 53], mu: [31, 32, 38, 38, 43, 53], w: 'http://ivanapostolov.bg'};
s[143] = {l: 'Икономика, туризъм и информатика', n: 'ЧПГ по икономика, туризъм и информатика', b: [4.09, 3.85, 3.91, 3.66, 3.55, 3.54], m: [4.061, 3.32, null, null, 5.828, 5.47], bu: [8, 7, 10, 12, 5, 22], mu: [8, 1, null, null, 8, 22], w: 'http://www.bulprogress.com/old/Za%20kontakti.html'};
s[144] = {l: 'Меридиан 22', n: 'ЧПГ Меридиан 22', b: [5.167, 5.13, 5.37, 5.04, 4.93, 4.66], m: [5.6, 5.227, 5.61, 5.46, 5.07, 4.82], bu: [14, 17, 10, 24, 15, 16], mu: [14, 17, 10, 24, 15, 16], w: 'http://meridian22.bg'};
s[145] = {l: 'Николай Райнов', n: 'ЧСУ Проф. Николай Райнов', b: [null, null, null, null, 4.02, null], m: [null, null, null, null, 4.84, null], bu: [null, null, null, null, 4, null], mu: [null, null, null, null, 4, null], w: 'http://waldorf.bg'};
s[146] = {l: 'Обр. технологии', n: 'ЧПГ Образователни технологии', b: [4.561, 4.25, 4.59, 4.44, 4.47, 4.3], m: [5.383, 4.359, 4.71, 4.89, 4.881, 4.982], bu: [30, 18, 45, 39, 34, 36], mu: [30, 18, 45, 39, 34, 36], w: 'http://eduteh.eu'};
s[147] = {l: 'Орфей', n: 'ЧСУ Орфей', b: [3.965, 3.78, 3.74, 4.13, 4.42, 4.19], m: [4.672, 4.632, 4.84, 4.75, 4.578, 5.06], bu: [4, 10, 6, 4, 7, 3], mu: [5, 11, 5, 4, 7, 4], w: 'http://orfei.net'};
s[148] = {l: 'Прир. науки и предпр.', n: 'ЧГ по прир. науки и предпр. Асен Йорданов', b: [null, null, null, null, 4.8, null], m: [null, null, null, null, 5.73, null], bu: [null, null, null, null, 1, null], mu: [null, null, null, null, 1, null], w: 'http://tzarsimeon.bg/gimnazia-asen-yordanov'};
s[149] = {l: 'ПЧАГ', n: 'Първа частна английска гимназия', b: [4.523, 4.53, 4.49, 4.37, 4.38, 4.29], m: [5.465, 4.84, 5.17, 5.06, 4.932, 4.912], bu: [26, 30, 16, 28, 20, 17], mu: [26, 30, 15, 28, 20, 17], w: 'http://fpels.ws'};
s[150] = {l: 'ПЧМГ', n: 'Първа Частна Математическа Гимназия', b: [null, 5.41, 5.55, 5.45, 5.37, 5.17], m: [null, 5.67, 5.78, 5.78, 5.414, 4.834], bu: [null, 23, 18, 14, 23, 19], mu: [null, 23, 18, 14, 23, 19], w: 'http://parvamatematicheska.com'};
s[151] = {l: 'Рьорих', n: 'ЧСУ Рьорих', b: [4.14, null, 4.47, 4.06, 4.34, 4.46], m: [4.86, null, 4.55, 4.41, 5.36, 4.88], bu: [9, null, 9, 5, 5, 3], mu: [9, null, 9, 5, 5, 3], w: 'http://roerich-school.org'};
s[152] = {l: 'Св. Георги', n: 'ЧСУ Свети Георги', b: [null, null, null, 4.45, 4.76, 4.54], m: [null, null, null, 5.86, 5.92, 5.796], bu: [null, null, null, 3, 9, 15], mu: [null, null, null, 3, 11, 15], w: 'http://stgeorgeschool.eu'};
s[153] = {l: 'Св. Наум', n: 'ЧПСУ Свети Наум', b: [4.636, 4.35, 4.55, 3.73, null, 3.24], m: [5.46, 4.15, 4.61, 3.26, null, 3.95], bu: [3, 7, 4, 3, null, 6], mu: [3, 7, 5, 3, null, 6], w: 'http://svetinaum.net'};
s[154] = {l: 'СофтУни Светлина', n: 'ЧПГ по дигитални науки СофтУни Светлина', b: [null, null, null, null, null, 4.29], m: [null, null, null, null, null, 4.82], bu: [null, null, null, null, null, 60], mu: [null, null, null, null, null, 57], w: 'http://svetlina.softuni.bg'};
s[155] = {l: 'Увекинд', n: 'ЧСУ Увекинд', b: [4.826, 4.8, 5.15, 4.83, 4.75, 4.51], m: [5.65, 4.755, 5.65, 5.63, 5.44, 5.32], bu: [20, 9, 21, 12, 22, 26], mu: [20, 9, 21, 12, 23, 26], w: 'http://uwekind.com'};
s[156] = {l: 'Цар Симеон Велики', n: 'ЧСУ Цар Симеон Велики', b: [null, 4.28, 3.81, 5.21, null, null], m: [null, 4.53, 4.61, 5.27, null, null], bu: [null, 4, 1, 6, null, null], mu: [null, 4, 1, 6, null, null], w: 'http://tzarsimeon.bg'};

// Пловдив - индексация
si['Пловдив'] = {n: [157, 196], p: [197, 203]};
// Пловдив - държавни училища
s[157] = {l: 'Духовна семинария', n: 'Пловдивска духовна семинария', b: [4.09, 3.69, 4.17, 3.8, 3.75, 4.32], m: [3.952, 3.977, 3.73, 3.45, 4.37, 3.26], bu: [11, 10, 8, 9, 4, 2], mu: [11, 9, 11, 10, 4, 3], w: 'http://seminaria.bg'};
s[158] = {l: 'ЕГ Иван Вазов', n: 'ЕГ Иван Вазов', b: [5.512, 5.34, 5.4, 5.3, 5.18, 5.06], m: [5.382, 5.18, 5.2, 5.18, 5.03, 4.843], bu: [221, 239, 237, 235, 236, 227], mu: [222, 239, 237, 235, 236, 227], w: 'http://egiv-plovdiv.bg'};
s[159] = {l: 'ЕГ Пловдив', n: 'ЕГ Пловдив', b: [5.6, 5.5, 5.43, 5.34, 5.32, 5.21], m: [5.846, 5.291, 5.62, 5.47, 5.475, 5.465], bu: [288, 265, 266, 270, 267, 273], mu: [288, 265, 266, 270, 267, 275], w: 'http://eg-plovdiv.com'};
s[160] = {l: 'МГ Акад. Кирил Попов', n: 'МГ Акад. Кирил Попов', b: [5.274, 5.24, 5.26, 5.18, 5.17, 5.08], m: [5.337, 5.07, 5.25, 5.17, 5.109, 4.823], bu: [214, 205, 212, 212, 202, 214], mu: [209, 204, 210, 209, 202, 215], w: 'http://omg-bg.com'};
s[161] = {l: 'НУМТИ', n: 'НУМТИ Добрин Петков', b: [4.772, 4.58, 4.58, 4.57, 4.44, 4.17], m: [4.915, 4.239, 4.73, 4.37, 4.65, 4.48], bu: [38, 37, 26, 26, 20, 23], mu: [11, 15, 9, 2, 20, 23], w: 'http://plovdivmusicschool.wordpress.com'};
s[162] = {l: 'ПГ по арх., строит. и геод.', n: 'ПГ по архитектура строителство и геодезия', b: [4.486, 4.18, 4.27, 4.25, 4.01, 3.9], m: [4.399, 4.092, 4.2, 4.2, 3.437, 3.946], bu: [201, 181, 188, 190, 170, 182], mu: [161, 154, 170, 166, 170, 201], w: 'http://pgasg-plovdiv.com'};
s[163] = {l: 'ПГ по битова техника', n: 'ПГ по битова техника', b: [3.849, 3.69, 3.64, 3.65, 3.57, 3.51], m: [4.235, 3.829, 3.99, 4.03, 3.43, 4.559], bu: [91, 91, 78, 81, 59, 101], mu: [89, 89, 66, 70, 57, 98], w: 'http://pgbt-plovdiv-bg.com'};
s[164] = {l: 'ПГ по вътр. арх. и дърв.', n: 'ПГ по вътрешна архитектура и дървообработване', b: [3.601, 3.28, 3.56, 3.53, 2.96, 3.43], m: [3.412, 3.409, 3.43, 3.79, 4.77, 4.959], bu: [45, 40, 41, 24, 34, 59], mu: [14, 11, 12, 8, 24, 57], w: 'http://pgvad.org'};
s[165] = {l: 'ПГ по електрот. и електрон.', n: 'ПГ по електротехника и електроника', b: [4.415, 4.01, 4.02, 4.31, 4.0, 3.93], m: [4.67, 4.007, 4.31, 4.44, 5.3, 4.64], bu: [187, 183, 169, 202, 179, 212], mu: [160, 166, 151, 180, 162, 210], w: 'http://pgee-plovdiv.com'};
s[166] = {l: 'ПГ по кожени изедлия', n: 'ПГ по кожени изделия и текстил Д-р Иван Богоров', b: [2.946, 2.68, 2.72, 3.47, 2.35, 3.04], m: [3.193, 2.682, 3.29, 3.52, 3.35, 3.828], bu: [13, 10, 15, 14, 13, 6], mu: [13, 10, 10, 10, 12, 7], w: 'http://pgkitbogorov-plovdiv.com'};
s[167] = {l: 'ПГ по машиностроене', n: 'ПГ по машиностроене', b: [3.026, 2.99, 3.12, 3.05, 2.6, 2.39], m: [2.752, 3.312, 2.84, 3.01, 4.1, 3.989], bu: [33, 29, 29, 21, 20, 13], mu: [4, 4, 1, 4, 17, 14], w: 'http://pgm-plovdiv.eu'};
s[168] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [3.765, 3.56, 3.62, 3.65, 3.16, 2.79], m: [4.035, 3.769, 3.8, 4.0, 3.759, 4.533], bu: [106, 102, 89, 93, 88, 98], mu: [107, 97, 77, 47, 89, 95], w: 'http://pgmtplovdiv.info'};
s[169] = {l: 'ПГ по облекло', n: 'ПГ по облекло Ана Май', b: [3.675, 3.58, 3.56, 3.81, 3.27, 3.26], m: [3.31, 3.662, 3.49, 3.75, 4.9, 4.36], bu: [68, 81, 41, 47, 36, 27], mu: [2, 24, 4, 12, 34, 26], w: 'http://pgoanamay.com'};
s[170] = {l: 'ПГ по трансп. и стр. техн.', n: 'ПГ по транспорт и строителни технологии', b: [3.493, 3.21, 3.16, 3.2, 2.42, 2.35], m: [3.446, 3.572, 3.33, 3.33, 2.18, 3.0], bu: [106, 86, 86, 77, 58, 62], mu: [28, 27, 88, 75, 52, 62], w: 'http://pgtst-plovdiv.com'};
s[171] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Проф д-р Асен Златаров', b: [4.29, 4.08, 4.17, 4.04, 4.03, 3.64], m: [4.242, 4.161, 4.12, 4.04, 5.396, 5.236], bu: [183, 158, 177, 146, 100, 133], mu: [167, 95, 81, 45, 99, 133], w: 'http://pgt-zlatarov-plovdiv.com'};
s[172] = {l: 'ПГ по хр. техн. и техника', n: 'ПГ по хранителни технологии и техника', b: [4.007, 3.86, 4.05, 4.02, 3.44, 3.26], m: [4.105, 3.776, 4.16, 3.8, 5.03, 5.14], bu: [139, 131, 104, 130, 124, 120], mu: [68, 51, 30, 34, 120, 108], w: 'http://pghtt.net'};
s[173] = {l: 'СпУ Васил Левски', n: 'Спортно у-ще Васил Левски', b: [3.907, 3.74, 3.82, 3.74, 3.27, 3.38], m: [4.341, 3.961, 4.23, 4.92, 4.875, 5.176], bu: [92, 65, 78, 70, 69, 75], mu: [26, 14, 15, 10, 62, 66], w: 'http://suvlevski.com'};
s[174] = {l: 'СУ Братя Миладинови', n: 'СУ Братя Миладинови', b: [3.342, 3.34, 3.17, 3.45, 2.52, 2.0], m: [3.589, 3.453, 3.47, 3.48, 2.541, 2.473], bu: [28, 38, 27, 26, 21, 12], mu: [30, 40, 25, 25, 18, 11], w: 'http://miladinovi.eu'};
s[175] = {l: 'СУ Димитър Матевски', n: 'СУ Димитър Матевски', b: [3.704, 3.82, 3.81, 3.71, 2.0, 3.34], m: [3.79, 3.866, 3.65, 3.95, null, 3.15], bu: [16, 19, 12, 21, 2, 26], mu: [15, 22, 14, 23, null, 24], w: 'http://sudm.eu'};
s[176] = {l: 'СУ К. Величков', n: 'СУ Константин Величков', b: [4.246, 4.02, 3.97, 3.93, 3.86, 3.36], m: [3.691, 3.891, 4.24, 3.95, 2.919, 2.46], bu: [16, 27, 31, 16, 14, 11], mu: [16, 27, 30, 17, 14, 11], w: 'http://soukv.com'};
s[177] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.137, 3.69, 4.11, 3.7, 3.5, 3.64], m: [4.099, 3.851, 4.16, 3.95, 4.39, 4.08], bu: [58, 63, 46, 33, 37, 46], mu: [58, 63, 46, 33, 37, 42], w: 'http://ecoschoolplovdiv.bg'};
s[178] = {l: 'СУ Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.15, 4.13, 4.01, 4.2, 3.69, 3.62], m: [4.702, 4.391, 4.25, 4.26, 3.48, 3.58], bu: [51, 55, 69, 75, 53, 61], mu: [51, 56, 68, 73, 51, 62], w: 'http://souklimentohridski.alle.bg'};
s[179] = {l: 'СУ Л. Каравелов', n: 'СУ Любен Каравелов', b: [3.892, 4.16, 3.73, 4.27, 3.74, 3.77], m: [3.728, 3.911, 3.7, 3.96, 3.531, 4.575], bu: [23, 20, 13, 18, 19, 27], mu: [24, 22, 13, 18, 19, 23], w: 'http://soulkaravelovpd.com'};
s[180] = {l: 'СУ Найден Геров', n: 'СУ Найден Геров', b: [3.13, 3.01, 2.73, 3.19, 3.43, 2.28], m: [3.398, 3.39, 2.97, 3.4, 2.206, 2.31], bu: [16, 21, 18, 20, 2, 11], mu: [15, 19, 13, 17, 6, 12], w: 'http://naidengerov-pd.org'};
s[181] = {l: 'СУ Никола Вапцаров', n: 'СУ Никола Вапцаров', b: [3.502, 3.39, 3.2, 3.56, 2.94, 2.74], m: [3.686, 3.092, 3.1, 3.7, 4.404, 4.44], bu: [5, 17, 17, 18, 19, 16], mu: [6, 17, 17, 18, 20, 16], w: 'http://vapcarov.com'};
s[182] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [4.048, 3.83, 3.91, 3.86, 3.47, 3.89], m: [4.192, 3.929, 3.99, 4.15, 3.444, 3.91], bu: [68, 99, 59, 73, 42, 44], mu: [66, 97, 61, 72, 36, 43], w: 'http://suyavorov.com'};
s[183] = {l: 'СУ Св. К. Кирил Философ', n: 'СУ Св. К. Кирил Философ', b: [4.372, 4.12, 3.96, 3.79, 3.74, 3.5], m: [4.247, 4.061, 4.24, 4.14, 3.512, 3.732], bu: [20, 27, 25, 21, 24, 24], mu: [20, 26, 26, 23, 24, 28], w: 'http://kkfilosof.com'};
s[184] = {l: 'СУ Св. П. Хилендарски', n: 'СУ Св. П. Хилендарски', b: [4.389, 4.24, 4.22, 4.45, 3.99, 3.94], m: [4.709, 4.172, 4.32, 4.62, 3.824, 3.956], bu: [94, 101, 92, 102, 92, 101], mu: [94, 101, 92, 101, 93, 101], w: 'http://paisii.info'};
s[185] = {l: 'СУ Св. Патриарх Евтимий', n: 'СУ Св. Патриарх Евтимий', b: [4.839, 4.69, 4.94, 4.64, 4.85, 4.48], m: [4.902, 4.433, 4.75, 4.69, 4.635, 4.628], bu: [114, 113, 115, 114, 125, 124], mu: [115, 115, 115, 114, 125, 124], w: 'http://patriarcha.com'};
s[186] = {l: 'СУ Св. Седмочисленици', n: 'СУ Св. Седмочисленици', b: [3.719, 3.53, 3.64, 3.52, null, null], m: [3.814, 3.571, 3.65, 3.83, null, null], bu: [23, 24, 20, 20, null, null], mu: [24, 23, 23, 20, null, null], w: 'http://sou7.org'};
s[187] = {l: 'СУ Св. Софроний Врачански', n: 'СУ Св. Софроний Врачански', b: [4.01, 4.18, 4.27, 4.44, 3.62, 3.48], m: [3.9, 4.016, 4.64, 4.32, 4.111, 4.043], bu: [1, 25, 13, 16, 22, 19], mu: [1, 25, 13, 17, 22, 19], w: 'http://sofrony.net'};
s[188] = {l: 'СУ Христо Г. Данов', n: 'СУ Христо Груев Данов', b: [4.117, 3.64, 3.68, 3.72, 2.98, 3.21], m: [3.91, 3.802, 3.96, 3.84, 2.919, 3.723], bu: [16, 11, 16, 14, 14, 23], mu: [16, 12, 16, 15, 14, 24], w: 'http://soudanov.org'};
s[189] = {l: 'СУ Цар Симеон Велики', n: 'СУ Цар Симеон Велики', b: [4.507, null, 3.9, 3.56, 2.78, 3.19], m: [4.872, null, 4.36, 4.01, 2.978, 3.004], bu: [27, null, 38, 23, 20, 27], mu: [27, null, 37, 23, 20, 27], w: 'http://csv-plovdiv.com'};
s[190] = {l: 'СУ Черноризец Храбър', n: 'СУ Черноризец Храбър', b: [4.525, 4.33, 4.32, 4.23, 4.19, 4.0], m: [4.363, 4.195, 4.44, 4.61, 4.472, 4.05], bu: [42, 35, 32, 36, 47, 45], mu: [43, 35, 32, 36, 47, 46], w: 'http://cherhrab.com'};
s[191] = {l: 'Сценични и екранни изкуства', n: 'Гимназия за сценични и екранни изкуства', b: [4.227, 4.26, 4.36, 4.08, 4.36, 4.03], m: [null, 4.24, 5.01, 3.39, 4.24, 5.15], bu: [42, 44, 50, 36, 42, 43], mu: [null, 14, 3, 3, 42, 43], w: 'http://skadri.org'};
s[192] = {l: 'Търговска гимназия', n: 'Търговска гимназия - Пловдив', b: [5.418, 4.99, 5.24, 5.08, 4.9, 4.81], m: [5.401, 4.605, 5.29, 5.14, 5.306, 5.164], bu: [202, 219, 203, 215, 208, 181], mu: [88, 135, 94, 120, 208, 181], w: 'http://ntg-plovdiv.net'};
s[193] = {l: 'У-ще за ученици с увр. слух', n: 'Специално училище за ученици с увреден слух', b: [3.15, 2.74, null, 3.31, null, null], m: [null, null, null, null, null, null], bu: [4, 5, null, 1, null, null], mu: [null, null, null, null, null, null], w: 'http://spu-belinov.com'};
s[194] = {l: 'Френска ЕГ', n: 'Френска ЕГ Антоан дьо Сент - Екзюпери', b: [5.089, 4.95, 4.97, 4.74, 4.5, 4.34], m: [5.113, 4.698, 4.89, 4.92, 4.804, 5.001], bu: [208, 214, 199, 200, 191, 207], mu: [208, 214, 199, 198, 190, 211], w: 'http://feg-exupery.com'};
s[195] = {l: 'Художествена гимназия', n: 'Художествена гимназия Цанко Лавренов', b: [4.671, 4.44, 4.6, 4.39, 4.44, 4.08], m: [null, 4.12, null, null, 5.27, 5.06], bu: [47, 47, 41, 59, 46, 49], mu: [null, 1, null, null, 46, 49], w: 'http://nhglavrenov.bg'};
s[196] = {l: 'Хуманитарна гимназия', n: 'Хуманитарна гимназия Св. Св. Кирил и Методий', b: [5.128, 5.09, 5.11, 5.08, 5.03, 4.82], m: [5.183, 4.718, 5.01, 5.12, 4.742, 4.725], bu: [198, 180, 188, 181, 189, 186], mu: [198, 179, 188, 181, 189, 186], w: 'http://ghp-pld.com'};
// Пловдив - частни училища
s[197] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [4.171, 4.94, 4.62, 4.52, 4.14, 3.93], m: [4.585, 4.74, 5.11, 4.51, 4.13, 4.45], bu: [9, 12, 18, 11, 12, 12], mu: [9, 12, 18, 11, 12, 12], w: 'http://drujbaplovdiv.bg'};
s[198] = {l: 'Едмънд Бърк', n: 'ЧПГ Едмънд Бърк', b: [4.31, null, null, null, 3.72, null], m: [4.605, null, null, null, 3.08, null], bu: [4, null, null, null, 4, null], mu: [4, null, null, null, 3, null], w: 'http://edburk.eu'};
s[199] = {l: 'Икономика и управление', n: 'ЧПГ по икономика и управление', b: [4.018, 4.28, 4.4, 3.69, 4.5, 3.79], m: [4.753, 4.07, 5.19, 4.49, 5.97, 5.09], bu: [9, 5, 4, 7, 3, 8], mu: [3, 2, 2, 3, 3, 8], w: 'http://chpgiu.org'};
s[200] = {l: 'Информ. и комп. науки', n: 'ЧПГ по информатика и комп. науки', b: [null, null, null, null, 3.95, null], m: [null, null, null, null, 5.69, null], bu: [null, null, null, null, 1, null], mu: [null, null, null, null, 1, null], w: 'http://gikn.eu'};
s[201] = {l: 'Класик', n: 'ЧПГ Класик', b: [4.438, 4.72, 4.18, 4.25, 3.98, 3.72], m: [4.993, 4.65, 4.73, 4.41, 4.262, 4.72], bu: [17, 15, 17, 17, 13, 10], mu: [16, 15, 17, 19, 12, 10], w: 'http://classicschool.org'};
s[202] = {l: 'Стоян Сариев', n: 'ЧЕГ Стоян Сариев', b: [4.89, 4.37, 4.16, 4.39, 4.37, 3.81], m: [5.192, 4.595, 5.17, 4.92, 4.52, 3.932], bu: [16, 15, 6, 11, 7, 11], mu: [16, 15, 6, 11, 7, 11], w: 'http://sarievschools.eu'};
s[203] = {l: 'Талантите', n: 'ЧСБУ Талантите', b: [null, null, null, null, null, 3.69], m: [null, null, null, null, null, 5.64], bu: [null, null, null, null, null, 2], mu: [null, null, null, null, null, 2], w: 'http://talantite.org'};

// Варна - индексация
si['Варна'] = {n: [204, 232], p: [233, 238]};
// Варна - държавни училища
s[204] = {l: '1 ЕГ', n: '1 ЕГ', b: [5.499, 5.34, 5.39, 5.58, 5.24, 5.18], m: [5.848, 5.281, 5.63, 5.63, 5.487, 5.343], bu: [239, 236, 237, 227, 243, 240], mu: [238, 236, 237, 227, 243, 240], w: 'http://1eg.eu'};
s[205] = {l: '3 ПМГ', n: '3 ПМГ Акад. Методий Попов', b: [4.831, 4.63, 4.79, 4.94, 4.54, 4.56], m: [5.119, 4.781, 4.78, 4.96, 4.205, 4.339], bu: [140, 135, 134, 134, 135, 134], mu: [140, 136, 134, 134, 134, 134], w: 'http://pmg3-varna.org'};
s[206] = {l: '4 ЕГ', n: '4 ЕГ Фредерик Жолио - Кюри', b: [5.303, 5.13, 5.12, 5.15, 4.91, 4.74], m: [5.353, 4.978, 5.18, 5.22, 5.263, 5.415], bu: [194, 200, 211, 216, 222, 210], mu: [194, 200, 211, 216, 222, 210], w: 'http://4egvarna.com'};
s[207] = {l: '5 ЕГ', n: '5 ЕГ Йоан Екзарх', b: [5.457, 5.38, 5.39, 5.4, 5.16, 4.93], m: [5.51, 5.091, 5.41, 5.32, 5.37, 5.404], bu: [180, 184, 179, 180, 183, 184], mu: [180, 184, 179, 180, 184, 184], w: 'http://5eg.org'};
s[208] = {l: '7 СУ', n: '7 СУ Найден Геров', b: [4.12, 3.75, 3.75, 4.02, 3.59, 3.53], m: [4.342, 3.908, 4.09, 4.4, 3.606, 3.507], bu: [72, 76, 69, 47, 73, 47], mu: [72, 75, 69, 49, 72, 48], w: 'http://7suvarna.com'};
s[209] = {l: 'Варненска морска гимназия', n: 'Варненска морска гимназия', b: [3.777, 3.54, 3.7, 3.75, 3.19, 3.02], m: [3.968, 3.779, 4.08, 4.09, 3.925, 3.967], bu: [85, 112, 86, 35, 70, 70], mu: [57, 95, 62, 15, 66, 61], w: 'http://vmg.bg'};
s[210] = {l: 'Варненска търг. гимназия', n: 'Варненска търговска гимназия', b: [4.792, 4.49, 4.75, 4.57, 4.38, 4.3], m: [4.848, 4.37, 4.65, 4.51, 5.43, 5.49], bu: [162, 127, 122, 134, 128, 160], mu: [83, 111, 98, 100, 128, 159], w: 'http://vtg-rakovski.eu'};
s[211] = {l: 'МГ Петър Берон', n: 'МГ Д-р Петър Берон', b: [5.29, 5.14, 5.29, 5.37, 5.24, 5.13], m: [5.533, 5.424, 5.53, 5.43, 5.233, 4.701], bu: [222, 203, 210, 202, 180, 185], mu: [221, 203, 210, 202, 180, 185], w: 'http://mgberon.com'};
s[212] = {l: 'НУИ Добри Христов', n: 'НУИ Добри Христов', b: [4.44, 4.43, 4.61, 4.27, 4.52, 4.0], m: [4.832, 4.445, 4.64, 4.51, 5.03, 4.8], bu: [68, 54, 61, 63, 61, 67], mu: [17, 8, 8, 18, 61, 66], w: 'http://artschool-varna.com'};
s[213] = {l: 'ПГ по горско стопанство', n: 'ПГ по горско стопанство и дървообр.', b: [3.503, 3.31, 3.18, 3.31, 2.51, 2.68], m: [3.559, 3.222, 3.3, 2.81, 4.288, 4.21], bu: [85, 76, 52, 48, 56, 45], mu: [30, 15, 11, 5, 38, 30], w: 'http://pggsd-varna.com'};
s[214] = {l: 'ПГ по електротехника', n: 'ПГ по електротехника', b: [4.014, 3.79, 3.81, 3.81, 3.63, 3.48], m: [3.99, 4.214, 4.17, 4.16, 4.153, 4.486], bu: [118, 100, 118, 105, 97, 123], mu: [84, 78, 90, 87, 93, 113], w: 'http://pgevarna.com'};
s[215] = {l: 'ПГ по икономика', n: 'ПГ по икономика Д-р Иван Богоров', b: [4.374, 4.17, 4.38, 4.08, 3.96, 3.58], m: [4.385, 4.095, 4.13, 4.31, 4.64, 4.654], bu: [160, 149, 136, 131, 144, 146], mu: [130, 115, 56, 74, 144, 143], w: 'http://pgi-varna.com'};
s[216] = {l: 'ПГ по комп. моделиране', n: 'ПГ по комп. моделиране и комп. системи', b: [null, null, null, null, null, 3.48], m: [null, null, null, null, null, 5.05], bu: [null, null, null, null, null, 40], mu: [null, null, null, null, null, 37], w: 'http://itpg-varna.bg'};
s[217] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [3.948, 3.78, 3.77, 3.57, 3.43, 3.44], m: [3.719, 3.74, 3.69, 3.67, 3.796, 4.058], bu: [73, 96, 70, 48, 68, 43], mu: [70, 55, 38, 20, 66, 50], w: 'http://pgsag-varna.com'};
s[218] = {l: 'ПГ по текстил и моден дизайн', n: 'ПГ по текстил и моден дизайн', b: [3.681, 3.63, 3.65, 3.51, 3.26, 2.9], m: [3.695, 3.731, 3.87, 3.89, 4.85, 4.421], bu: [67, 75, 36, 24, 56, 51], mu: [19, 14, 12, 9, 53, 44], w: 'http://pgtmd-varna.com'};
s[219] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [4.414, 4.27, 4.27, 4.25, 3.92, 3.92], m: [4.832, 4.133, 4.84, 4.74, 4.2, 3.979], bu: [157, 182, 161, 175, 162, 146], mu: [50, 73, 20, 22, 162, 148], w: 'http://pgtvarna.com'};
s[220] = {l: 'ПГ по хим. и хр.-вк. техн.', n: 'ПГ по химични и хранително-вкусови технологии', b: [3.7, 3.83, 3.69, 3.52, 3.63, 3.23], m: [3.856, 4.166, 3.99, 3.67, 4.391, 4.671], bu: [49, 24, 20, 23, 37, 31], mu: [49, 24, 18, 23, 35, 30], w: 'http://pghhvt-varna.com'};
s[221] = {l: 'Проф. техн. гимназия', n: 'Професионална техническа гимназия', b: [3.844, 3.72, 3.71, 3.67, 3.59, 3.33], m: [4.099, 4.05, 4.04, 4.02, 4.11, 4.655], bu: [149, 161, 144, 139, 103, 175], mu: [67, 43, 48, 18, 102, 171], w: 'http://ptgvarna.com'};
s[222] = {l: 'Спец. у-ще за уч. с нар. зр.', n: 'Специално у-ще за ученици с нарушено зрение', b: [4.176, null, 4.12, null, 3.92, 4.14], m: [4.16, null, 4.47, null, 3.46, 3.17], bu: [9, null, 8, null, 4, 2], mu: [9, null, 8, null, 4, 2], w: 'http://suunzvarna.com'};
s[223] = {l: 'СпУ Г. Бенковски', n: 'Спортно у-ще Г. Бенковски', b: [3.718, 3.69, 3.74, 3.69, 3.4, 3.28], m: [4.413, 4.015, 3.93, 4.78, 4.846, 4.4], bu: [82, 58, 63, 69, 46, 61], mu: [21, 16, 11, 12, 44, 54], w: 'http://sportno-varna.com'};
s[224] = {l: 'СУ Гео Милев', n: 'СУ Гео Милев', b: [4.156, 4.03, 4.12, 4.09, 3.79, 3.82], m: [4.603, 4.359, 4.45, 4.44, 3.929, 3.903], bu: [41, 49, 30, 19, 45, 46], mu: [42, 48, 32, 19, 45, 49], w: 'http://geomilev.info'};
s[225] = {l: 'СУ Д. Дебелянов', n: 'СУ Димчо Дебелянов', b: [4.041, null, 4.11, 4.41, 3.92, 3.48], m: [4.105, null, 4.13, 4.41, 4.421, 3.812], bu: [39, null, 27, 46, 24, 46], mu: [40, null, 26, 44, 22, 41], w: 'http://sou-ddeb.com'};
s[226] = {l: 'СУ Елин Пелин', n: 'СУ Елин Пелин', b: [3.708, 3.63, 3.24, 3.33, 3.68, 2.62], m: [3.921, 3.54, 3.44, 3.54, 4.98, 2.89], bu: [11, 3, 10, 10, 12, 11], mu: [11, 3, 9, 10, 11, 9], w: 'http://elinpelin-varna.com'};
s[227] = {l: 'СУ за хуман. науки и изк.', n: 'СУ за хуманитарни науки и изкуства', b: [4.634, 4.65, 4.6, 4.63, 4.39, 4.25], m: [4.723, 4.595, 4.64, 4.68, 4.718, 4.654], bu: [224, 187, 233, 207, 224, 227], mu: [225, 188, 234, 206, 226, 227], w: 'http://nghni-varna.com'};
s[228] = {l: 'СУ Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.592, 4.39, 4.29, 4.28, 4.3, 4.45], m: [4.887, 4.402, 4.9, 4.73, 4.252, 4.434], bu: [43, 47, 43, 49, 50, 47], mu: [45, 48, 43, 49, 48, 47], w: 'http://klimentvarna.com'};
s[229] = {l: 'СУ Л. Каравелов', n: 'СУ Любен Каравелов', b: [3.744, 3.55, 3.52, 3.68, 2.79, 2.65], m: [3.681, 3.584, 3.48, 3.7, 3.086, 2.915], bu: [35, 27, 35, 27, 25, 20], mu: [34, 27, 36, 26, 20, 16], w: 'http://soukaravelov.com'};
s[230] = {l: 'СУ Неофит Бозавели', n: 'СУ Неофит Бозавели', b: [3.494, 3.2, 3.2, 3.39, 3.0, 2.83], m: [3.638, 3.449, 3.27, 3.65, 2.611, 2.92], bu: [64, 43, 45, 41, 27, 30], mu: [65, 45, 42, 44, 27, 33], w: 'http://neofit-bozveli.bg'};
s[231] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [3.799, 3.78, 3.79, 3.7, 3.18, 2.98], m: [3.95, 3.994, 3.5, 4.24, 2.911, 2.402], bu: [18, 22, 11, 22, 28, 21], mu: [16, 23, 11, 22, 28, 20], w: 'http://souyavorov-varna.com'};
s[232] = {l: 'СУЕО Пушкин', n: 'СУЕО Ал. С. Пушкин', b: [4.76, 4.77, 4.66, 4.91, 4.61, 4.54], m: [4.96, 4.647, 4.73, 5.0, 4.825, 5.051], bu: [122, 127, 120, 128, 105, 102], mu: [120, 126, 120, 128, 104, 102], w: 'http://sueovarna.com'};
// Варна - частни училища
s[233] = {l: 'А. Екзюпери', n: 'ЧПГ Антоан дьо Сент-Екзюпери', b: [4.856, 4.57, 4.66, 4.6, 4.62, 4.68], m: [5.469, 4.681, 5.17, 5.04, 5.526, 5.8], bu: [13, 9, 13, 16, 16, 21], mu: [13, 9, 13, 16, 16, 21], w: 'http://exupery.net'};
s[234] = {l: 'Аз съм българче', n: 'ЧСУ Аз съм българче', b: [null, null, null, null, null, 4.21], m: [null, null, null, null, null, 3.951], bu: [null, null, null, null, null, 6], mu: [null, null, null, null, null, 6], w: 'http://balgarche.eu'};
s[235] = {l: 'Джордж Байрон', n: 'ЧЕГ Джордж Байрон', b: [4.46, 4.09, 4.25, 4.14, 4.16, 3.73], m: [4.915, 4.539, 5.08, 4.49, 3.734, 3.741], bu: [26, 20, 16, 11, 15, 13], mu: [26, 21, 16, 11, 14, 12], w: 'http://byronschool-varna.com'};
s[236] = {l: 'Мария Монтесори', n: 'ЧСУ Мария Монтесори', b: [null, null, null, 4.87, 4.34, 3.45], m: [null, null, null, 5.14, 5.2, 3.83], bu: [null, null, null, 2, 1, 2], mu: [null, null, null, 2, 1, 2], w: 'http://montessori-varna.com'};
s[237] = {l: 'Мечтатели', n: 'ЧСУ Мечтатели', b: [null, null, 3.95, null, null, 4.76], m: [null, null, 3.11, null, null, 3.236], bu: [null, null, 1, null, null, 3], mu: [null, null, 1, null, null, 3], w: 'http://mechtateli.eu'};
s[238] = {l: 'Търговска гимназия', n: 'Частна Търговска Гимназия Конто Трейд', b: [4.08, 4.23, 3.98, 4.18, 4.14, 4.04], m: [4.254, 3.883, 4.34, 4.32, 4.71, 5.53], bu: [5, 10, 6, 5, 6, 5], mu: [5, 11, 7, 5, 5, 5], w: 'http://tradescl.com'};

// Бургас - индексация
si['Бургас'] = {n: [239, 267], p: [268, 268]};
// Бургас - държавни училища
s[239] = {l: 'Английска ЕГ', n: 'Английска ЕГ Гео Милев', b: [5.224, 5.06, 5.06, 4.97, 4.92, 4.62], m: [5.775, 5.079, 5.32, 5.43, 5.107, 4.696], bu: [167, 163, 163, 165, 161, 153], mu: [167, 163, 163, 165, 161, 154], w: 'http://gpaeburgas.org'};
s[240] = {l: 'Вечерно СУ', n: 'Вечерно СУ Захари Стоянов', b: [3.575, 3.2, 3.37, 3.28, 2.66, 2.73], m: [3.524, 3.335, 3.44, 3.49, 3.342, 2.88], bu: [37, 32, 37, 47, 19, 42], mu: [39, 30, 37, 46, 15, 38], w: 'http://vsu-bs.com'};
s[241] = {l: 'НЕГ Гьоте', n: 'Немска езикова гимназия Гьоте', b: [5.449, 5.28, 5.45, 5.36, 5.24, 5.09], m: [5.646, 5.339, 5.57, 5.37, 5.603, 5.624], bu: [161, 159, 148, 156, 157, 155], mu: [161, 160, 148, 156, 157, 155], w: 'http://neg-goethe.org'};
s[242] = {l: 'НУМСИ', n: 'НУМСИ Проф. Панчо Владигеров', b: [4.747, 4.52, 4.65, 4.49, 4.34, 4.28], m: [4.978, 4.255, 4.78, 4.54, 5.06, 4.63], bu: [28, 48, 49, 51, 58, 49], mu: [5, 17, 18, 31, 58, 49], w: 'http://numsiburgas.com'};
s[243] = {l: 'ПГ за романски езици', n: 'ПГ за романски езици', b: [5.022, 4.88, 4.93, 4.89, 4.65, 4.33], m: [5.095, 4.754, 4.98, 5.13, 5.17, 5.036], bu: [176, 177, 172, 178, 181, 178], mu: [176, 177, 172, 179, 181, 178], w: 'http://gre-rakovski.com'};
s[244] = {l: 'ПГ за чужди езици', n: 'ПГ за чужди езици Васил Левски', b: [4.712, 4.68, 4.78, 4.75, 4.39, 4.13], m: [5.111, 4.715, 4.8, 4.81, 4.473, 4.469], bu: [158, 156, 149, 151, 153, 157], mu: [159, 155, 148, 151, 153, 160], w: 'http://gimnasy-rus-bs.net'};
s[245] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване', b: [3.125, 3.09, 3.27, 3.24, null, null], m: [3.367, 3.142, 3.53, 3.19, null, null], bu: [17, 25, 12, 14, null, null], mu: [18, 26, 9, 13, null, null], w: 'http://obrazovatelen-register.bg/pgd-georgi-kondolov-burgas/'};
s[246] = {l: 'ПГ по ел. и ел.', n: 'ПГ по електротехника и електроника', b: [3.843, 3.82, 3.72, 3.71, 3.47, 3.07], m: [4.195, 4.109, 4.0, 4.29, 3.38, 3.301], bu: [128, 105, 64, 72, 101, 115], mu: [130, 72, 57, 62, 101, 127], w: 'http://pgee-bourgas.com'};
s[247] = {l: 'ПГ по компют. програм.', n: 'ПГ по комп. програмиране и иновации', b: [null, null, null, null, null, 4.5], m: [null, null, null, null, null, 4.379], bu: [null, null, null, null, null, 89], mu: [null, null, null, null, null, 88], w: 'http://codingburgas.bg'};
s[248] = {l: 'ПГ по м. кораб. и риб.', n: 'ПГ по морско корабоплаване и риболов', b: [3.662, 3.64, null, 3.25, 2.76, 2.38], m: [3.928, 3.217, 3.53, null, 4.736, 4.88], bu: [15, 19, null, 23, 23, 26], mu: [15, 7, 1, null, 20, 21], w: 'http://school.morskoburgas.com'};
s[249] = {l: 'ПГ по мех. и електр.', n: 'ПГ по механоелектротехника и електроника', b: [4.247, 3.89, 4.02, 3.88, 3.56, 3.39], m: [4.234, 3.964, 4.21, 4.17, 4.59, 4.331], bu: [180, 192, 153, 122, 142, 154], mu: [175, 175, 141, 99, 142, 147], w: 'http://pgmee.com'};
s[250] = {l: 'ПГ по сград. и инст.', n: 'ПГ по сградостроителство и инсталации', b: [3.04, 2.87, 2.72, 2.96, 2.0, 2.2], m: [3.037, 3.036, 3.08, 2.92, 4.94, 3.799], bu: [14, 20, 19, 20, 13, 17], mu: [10, 24, 12, 22, 4, 9], w: 'http://pgsi.bg'};
s[251] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [4.295, 4.14, 4.19, 4.16, 3.99, 3.94], m: [4.432, 4.243, 4.18, 4.23, 4.09, 3.648], bu: [158, 150, 142, 154, 142, 137], mu: [147, 149, 142, 148, 135, 142], w: 'http://kolioficheto.com'};
s[252] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.258, 3.13, 2.93, 2.98, 2.34, 2.29], m: [3.437, 3.389, 3.02, 3.14, 3.27, 3.14], bu: [74, 73, 27, 52, 58, 72], mu: [68, 67, 28, 50, 52, 52], w: 'http://autoburgas.com'};
s[253] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [4.114, 3.98, 3.88, 3.99, 3.39, 3.34], m: [3.94, 3.943, 4.11, 4.4, 4.798, 4.941], bu: [201, 213, 218, 148, 182, 181], mu: [199, 192, 80, 42, 177, 168], w: 'http://pgtbs.com'};
s[254] = {l: 'ПГ по хим. техн.', n: 'ПГ по химични технологии', b: [3.902, 3.71, 3.9, 3.68, 3.06, 2.93], m: [4.07, 3.819, 3.89, 3.7, 4.12, 4.56], bu: [145, 145, 101, 125, 112, 109], mu: [107, 104, 58, 60, 109, 84], w: 'http://pght-zelinskij.com'};
s[255] = {l: 'ППМГ', n: 'ППМГ Акад. Никола Обрешков', b: [5.489, 5.24, 5.33, 5.29, 5.29, 5.11], m: [5.766, 5.555, 5.65, 5.51, 5.122, 4.454], bu: [157, 150, 158, 153, 157, 159], mu: [157, 150, 158, 153, 157, 159], w: 'http://pmgbs.com'};
s[256] = {l: 'Проф. техн. гимназия', n: 'Професионална техническа гимназия', b: [3.46, 3.19, 3.06, 3.15, 2.54, 2.2], m: [2.99, 3.091, 2.82, 3.67, 3.77, 4.19], bu: [9, 14, 24, 18, 27, 19], mu: [4, 5, 4, 1, 22, 15], w: 'http://ptgburgas.com'};
s[257] = {l: 'СпУ Юрий Гагарин', n: 'Спортно у-ще Юрий Гагарин', b: [3.456, 3.24, 3.43, 3.59, 2.79, 2.63], m: [2.911, 3.326, 3.66, 3.92, 4.34, 4.86], bu: [50, 48, 39, 45, 40, 48], mu: [6, 16, 17, 10, 38, 36], w: 'http://sportnotoburgas.com'};
s[258] = {l: 'СУ Димчо Дебелянов', n: 'СУ Димчо Дебелянов', b: [3.766, 3.71, 3.45, 3.53, null, null], m: [4.103, 3.702, 3.86, 3.89, null, null], bu: [19, 15, 17, 15, null, null], mu: [19, 17, 16, 14, null, null], w: 'http://ddebelyanov-bs.com'};
s[259] = {l: 'СУ Добри Чинтулов', n: 'СУ Добри Чинтулов', b: [3.517, 3.19, 3.34, 3.42, 2.0, 2.98], m: [3.699, 3.38, 3.56, 3.6, null, 2.89], bu: [26, 23, 22, 20, 2, 26], mu: [26, 21, 22, 19, null, 25], w: 'http://dchintulov.com'};
s[260] = {l: 'СУ Еп. К. Преславски', n: 'СУ Еп. К. Преславски', b: [3.885, 3.71, 3.72, 3.99, 3.62, 3.32], m: [4.115, 4.16, 4.12, 4.05, 3.53, 3.202], bu: [47, 38, 23, 56, 28, 22], mu: [47, 40, 21, 57, 26, 23], w: 'http://preslavski.eu'};
s[261] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [3.486, 3.16, 3.5, 3.21, 2.0, 2.99], m: [3.557, 3.56, 3.79, 3.38, null, 4.106], bu: [28, 3, 20, 16, 3, 27], mu: [27, 4, 19, 17, null, 25], w: 'http://ivazov-burgas.com'};
s[262] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.186, 3.14, 3.62, 3.26, 2.66, 2.7], m: [3.448, 3.418, 3.96, 3.22, 2.9, 2.862], bu: [6, 9, 8, 8, 3, 5], mu: [6, 7, 8, 8, 3, 4], w: 'http://jovkov.org'};
s[263] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.192, 3.97, 3.79, 3.74, 3.56, 3.36], m: [4.668, 4.092, 3.95, 4.35, 3.679, 3.59], bu: [87, 77, 43, 88, 74, 67], mu: [87, 78, 43, 90, 72, 69], w: 'http://sukim.bg'};
s[264] = {l: 'СУ Конст. Петканов', n: 'СУ Константин Петканов', b: [3.367, 3.12, 3.4, 2.84, null, 2.58], m: [3.545, 2.83, 3.43, 2.31, null, 2.904], bu: [10, 4, 18, 1, null, 13], mu: [10, 3, 20, 1, null, 13], w: 'http://su-konstantin-petkanov.com'};
s[265] = {l: 'СУ Петко Росен', n: 'СУ Петко Росен', b: [3.32, 3.08, 3.16, 3.29, 2.22, 2.47], m: [3.065, 3.623, 3.22, 3.69, 4.16, 3.36], bu: [19, 20, 20, 21, 18, 19], mu: [4, 3, 3, 4, 14, 11], w: 'http://petko-rosen.com'};
s[266] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [2.961, 2.97, 4.01, null, null, null], m: [2.854, 2.61, 3.69, 2.73, null, null], bu: [6, 2, 2, null, null, null], mu: [5, 2, 2, 2, null, null], w: 'http://suhristobotevburgas.com'};
s[267] = {l: 'Търговска гимназия', n: 'Търговска гимназия', b: [4.99, 4.74, 4.92, 4.77, 4.63, 4.45], m: [5.112, 4.535, 4.9, 4.82, 4.461, 5.247], bu: [149, 152, 155, 152, 156, 159], mu: [135, 139, 134, 102, 156, 162], w: 'http://tg-bs.com'};
// Бургас - частни училища
s[268] = {l: 'Британика', n: 'ЧПГ Британика', b: [4.309, 4.27, 4.68, 4.88, 4.16, 4.04], m: [4.895, 4.436, 4.66, 4.28, 4.5, 4.03], bu: [12, 15, 8, 3, 4, 12], mu: [12, 15, 8, 4, 4, 12], w: 'http://britanika-bs.com'};

// Благоевград - индексация
si['Благоевград'] = {n: [269, 279], p: null};
// Благоевград - държавни училища
s[269] = {l: 'ЕГ Акад. Л. Стоянов', n: 'ЕГ Акад. Людмил Стоянов', b: [5.259, 5.23, 5.4, 5.24, 5.17, 4.96], m: [5.433, 5.111, 5.42, 5.4, 5.387, 5.477], bu: [150, 162, 155, 158, 156, 158], mu: [149, 163, 155, 158, 156, 158], w: 'http://egblg.com'};
s[270] = {l: 'ПГ Ичко Бойчев', n: 'ПГ Ичко Бойчев', b: [3.353, 3.23, 3.15, 3.31, 2.55, 2.49], m: [3.61, 3.244, 3.15, 3.32, 2.988, 4.094], bu: [53, 74, 30, 51, 49, 42], mu: [37, 79, 34, 32, 43, 37], w: 'http://bpg-blg.com'};
s[271] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [4.62, 4.36, 4.46, 4.46, 4.01, 4.01], m: [4.59, 4.134, 4.16, 4.56, 5.58, 5.729], bu: [144, 150, 116, 130, 103, 106], mu: [23, 45, 38, 47, 102, 106], w: 'http://pgiblg.com'};
s[272] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и геодезия', b: [4.137, 3.76, 3.74, 3.84, 3.31, 3.34], m: [3.943, 3.861, 3.87, 4.01, 4.835, 4.94], bu: [63, 70, 70, 75, 53, 81], mu: [38, 62, 64, 67, 53, 74], w: 'http://pgsag-blg.com'};
s[273] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм и лека промишленост', b: [3.464, 3.37, 3.27, 3.39, 3.01, 2.87], m: [3.21, null, 3.11, null, 4.62, 4.264], bu: [27, 37, 23, 30, 12, 17], mu: [2, null, 1, null, 10, 15], w: 'http://pgtlp-blg.com'};
s[274] = {l: 'ПМГ Акад. С. Корольов', n: 'ПМГ Акад. Сергей Корольов', b: [5.225, 5.07, 5.02, 5.06, 4.79, 4.62], m: [5.559, 5.279, 5.19, 5.22, 4.906, 4.496], bu: [151, 162, 160, 158, 156, 151], mu: [151, 162, 160, 158, 156, 151], w: 'http://pmg-blg.com'};
s[275] = {l: 'СУ Г. Измирлиев', n: '5 СУ Георги Измирлиев', b: [3.563, 3.65, 3.48, 3.6, 3.21, 3.17], m: [3.914, 3.68, 3.83, 3.87, 3.141, 2.851], bu: [24, 30, 22, 20, 18, 27], mu: [25, 31, 21, 20, 18, 28], w: 'http://petosoubl.com'};
s[276] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [null, null, 2.81, 2.04, null, 2.0], m: [null, null, 3.14, 3.06, null, null], bu: [null, null, 1, 1, null, 1], mu: [null, null, 1, 1, null, null], w: 'http://souivanvazov.com'};
s[277] = {l: 'СУ К. Шапкарев', n: '7 СУ Кузман Шапкарев', b: [null, 3.71, 3.88, null, 3.57, 3.46], m: [null, 4.061, 3.95, 2.44, 3.672, 3.2], bu: [null, 23, 16, null, 20, 22], mu: [null, 24, 17, 1, 20, 25], w: 'http://7sou-blagoevgrad.com'};
s[278] = {l: 'СУИЧЕ', n: 'СУИЧЕ Св. Кл. Охридски', b: [4.208, 4.12, 4.02, 3.71, 3.7, 3.5], m: [4.439, 4.379, 4.08, 4.07, 3.577, 3.784], bu: [52, 21, 39, 43, 25, 26], mu: [52, 21, 39, 43, 25, 27], w: 'http://fllschool.eu'};
s[279] = {l: 'Хуманитарна гимн.', n: 'Национална хуманитарна гимназия', b: [4.521, 4.29, 4.43, 4.59, 4.19, 4.21], m: [4.43, 4.278, 4.48, 4.66, 4.3, 4.595], bu: [91, 109, 101, 103, 112, 135], mu: [93, 112, 103, 102, 111, 133], w: 'http://nhg-blg.com'};

// Велико Търново - индексация
si['Велико Търново'] = {n: [280, 291], p: [292, 292]};
// Велико Търново - държавни училища
s[280] = {l: 'ЕГ', n: 'ЕГ. Проф. д-р Асен Златаров', b: [5.131, 5.0, 5.23, 4.99, 4.94, 4.65], m: [5.358, 5.072, 5.16, 5.2, 5.121, 5.385], bu: [145, 143, 144, 152, 120, 126], mu: [145, 142, 145, 153, 120, 127], w: null};
s[281] = {l: 'ПГ по електроника', n: 'ПГ по електроника', b: [3.597, 3.36, 3.32, 3.46, 3.11, 2.56], m: [3.858, 3.567, 3.41, 3.8, 4.463, 4.87], bu: [41, 34, 43, 31, 27, 29], mu: [39, 32, 38, 31, 24, 17], w: null};
s[282] = {l: 'ПГ по икономика', n: 'Старопрестолна ПГ по икономика', b: [4.51, 4.21, 4.39, 3.99, 3.96, 3.66], m: [4.437, 4.253, 4.36, 4.66, 4.81, 4.58], bu: [75, 68, 53, 43, 50, 65], mu: [23, 30, 23, 16, 49, 64], w: null};
s[283] = {l: 'ПГ по моден дизайн', n: 'ПГ по моден дизайн', b: [3.491, 3.16, 3.49, 3.59, 2.91, 2.63], m: [null, 3.36, 3.52, null, 4.708, 4.295], bu: [17, 24, 15, 6, 12, 15], mu: [null, 1, 2, null, 14, 9], w: null};
s[284] = {l: 'ПГ по строителство', n: 'ПГ по строителство архитектура и геодезия', b: [4.059, 3.87, 4.15, 4.06, 4.07, 3.87], m: [3.979, 3.9, 4.06, 4.56, 4.329, 4.031], bu: [84, 96, 100, 86, 77, 91], mu: [63, 61, 61, 19, 76, 89], w: null};
s[285] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [3.982, 3.74, 4.11, 3.88, 3.93, 3.63], m: [3.939, 3.878, 3.83, 3.89, 3.926, 3.932], bu: [75, 115, 88, 93, 85, 66], mu: [60, 52, 52, 38, 80, 72], w: null};
s[286] = {l: 'ПМГ В. Друмев', n: 'ПМГ Васил Друмев', b: [5.208, 5.11, 5.22, 5.03, 4.89, 4.77], m: [5.431, 5.04, 5.3, 5.27, 4.731, 4.438], bu: [147, 133, 151, 157, 148, 126], mu: [146, 134, 151, 157, 148, 128], w: null};
s[287] = {l: 'Спортно у-ще', n: 'Спортно училище Героги Живков', b: [3.888, 3.54, 3.82, 3.79, 3.23, 3.24], m: [3.777, 5.69, null, 4.35, 4.58, 5.171], bu: [38, 34, 31, 38, 40, 43], mu: [8, 2, null, 1, 43, 36], w: null};
s[288] = {l: 'СУ В. Благоева', n: 'СУ Вела Благоева', b: [3.653, 3.7, 4.29, 3.97, 3.42, 3.28], m: [3.505, 3.91, 4.12, 4.6, 4.163, 4.404], bu: [17, 20, 26, 18, 22, 8], mu: [18, 20, 27, 19, 22, 8], w: null};
s[289] = {l: 'СУ В. Комаров', n: 'СУ Владимир Комаров', b: [3.563, 3.52, 3.62, 3.14, null, 3.25], m: [3.569, 3.43, 3.51, 3.24, null, 5.38], bu: [16, 10, 11, 1, null, 3], mu: [18, 11, 11, 3, null, 3], w: null};
s[290] = {l: 'СУ Е. Станев', n: 'СУ Емилиян Станев', b: [4.563, 4.25, 4.55, 4.24, 4.25, 4.19], m: [4.918, 4.484, 4.7, 4.74, 4.495, 4.92], bu: [78, 54, 67, 75, 54, 70], mu: [78, 54, 67, 75, 53, 70], w: null};
s[291] = {l: 'Хуманитарна гимн.', n: 'Профилирана Хуманитарна гимназия', b: [null, 4.13, 4.15, 3.52, 3.45, 4.21], m: [null, 3.94, 4.08, null, 3.583, 4.32], bu: [null, 7, 10, 12, 8, 2], mu: [null, 7, 9, null, 8, 3], w: null};
// Велико Търново - частни училища
s[292] = {l: 'АК-Арукс', n: 'ЧПГ АК-Аркус', b: [4.985, 5.16, 5.49, 5.25, 4.95, 4.75], m: [5.541, 4.923, 5.53, 5.34, 5.021, 4.861], bu: [37, 29, 27, 23, 39, 55], mu: [37, 29, 27, 23, 39, 56], w: null};

// Видин - индексация
si['Видин'] = {n: [293, 300], p: null};
// Видин - държавни училища
s[293] = {l: 'ГПЧЕ', n: 'ГПЧЕ Йордан Радичков', b: [5.115, 4.85, 5.07, 4.75, 4.57, 4.62], m: [5.396, 4.588, 5.13, 5.28, 4.518, 4.807], bu: [95, 94, 97, 85, 98, 82], mu: [95, 95, 97, 85, 98, 82], w: null};
s[294] = {l: 'ПГ А. Златаров', n: 'ПГ Проф. д-р Асен Златаров', b: [4.118, 4.14, 4.3, 4.22, 3.92, 3.62], m: [4.154, 4.03, 4.18, 3.99, 4.395, 5.083], bu: [119, 79, 88, 76, 54, 84], mu: [90, 49, 66, 58, 54, 86], w: null};
s[295] = {l: 'ПГТ', n: 'ПГТ Михалаки Георгиев', b: [3.512, 3.44, 3.49, 3.58, 3.09, 3.04], m: [3.585, 3.549, 4.27, 3.79, 4.434, 4.36], bu: [69, 62, 64, 63, 27, 49], mu: [38, 26, 9, 5, 27, 52], w: null};
s[296] = {l: 'ППМГ', n: 'ППМГ Екзарх Антим I', b: [4.625, 4.53, 4.79, 4.56, 4.47, 4.18], m: [4.764, 4.577, 4.78, 4.6, 4.37, 4.279], bu: [82, 101, 99, 76, 91, 76], mu: [82, 101, 102, 75, 92, 77], w: null};
s[297] = {l: 'ПТГ', n: 'ПТГ Васил Левски', b: [3.241, 3.57, 2.97, 3.2, 2.25, 2.15], m: [3.54, 3.325, 2.53, null, 3.69, 4.01], bu: [9, 10, 14, 6, 13, 23], mu: [3, 2, 1, null, 13, 15], w: null};
s[298] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [3.748, 4.21, 4.12, 4.41, 3.7, 3.65], m: [3.818, 3.84, 4.36, 4.38, 4.038, 3.631], bu: [13, 15, 19, 10, 15, 16], mu: [13, 15, 19, 10, 15, 16], w: null};
s[299] = {l: 'СУ Петко Славейков', n: 'СУ Петко Рачов Славейков', b: [4.388, 3.56, 3.73, 3.7, 3.13, 2.78], m: [4.475, 3.58, 3.91, 3.72, 3.24, 3.239], bu: [20, 16, 24, 17, 20, 22], mu: [20, 18, 24, 16, 20, 21], w: null};
s[300] = {l: 'СУ Цар Симеон', n: 'СУ Цар Симеон Велики', b: [4.772, 4.57, 4.24, 4.47, 3.91, 3.83], m: [4.905, 4.547, 4.48, 4.67, 3.785, 3.938], bu: [71, 71, 49, 57, 58, 67], mu: [70, 73, 50, 57, 58, 67], w: null};

// Враца - индексация
si['Враца'] = {n: [301, 312], p: null};
// Враца - държавни училища
s[301] = {l: 'ЕГ', n: 'Профилирана ЕГ Йоан Екзарх', b: [4.952, 4.32, 4.65, 4.69, 4.45, 4.22], m: [5.161, 4.537, 5.02, 5.19, 4.662, 4.294], bu: [84, 86, 46, 50, 83, 101], mu: [84, 86, 46, 50, 83, 100], w: null};
s[302] = {l: 'ПГ Д. Хаджитошин', n: 'ПГ Димитраки Хаджитошин', b: [3.26, 3.05, 3.22, 3.36, 2.71, 2.87], m: [2.786, 3.005, 3.39, 3.66, 3.12, 4.132], bu: [17, 6, 16, 15, 11, 18], mu: [8, 7, 15, 13, 8, 15], w: null};
s[303] = {l: 'ПГ по търговия', n: 'ПГ по търговия и ресторантьорство', b: [3.611, 3.64, 3.43, 3.48, 3.18, 2.82], m: [3.637, 3.695, 3.64, 3.55, 4.103, 4.232], bu: [77, 61, 62, 68, 49, 64], mu: [10, 10, 10, 14, 47, 58], w: null};
s[304] = {l: 'ППМГ', n: 'ППМГ Акад. Иван Ценов', b: [5.141, 4.82, 4.93, 5.01, 4.99, 4.9], m: [5.303, 5.042, 5.09, 5.13, 4.628, 5.008], bu: [173, 177, 164, 151, 150, 128], mu: [173, 177, 164, 151, 150, 131], w: null};
s[305] = {l: 'Спортно у-ще', n: 'Спортно у-ще Св. Климент Охридски', b: [3.691, 3.19, 3.56, 3.42, 3.05, 2.77], m: [3.805, 3.493, 3.74, 3.84, 5.07, 5.3], bu: [32, 15, 41, 37, 41, 27], mu: [34, 15, 40, 34, 39, 21], w: null};
s[306] = {l: 'СУ Васил Кънчов', n: 'СУ Васил Кънчов', b: [4.048, 3.98, 4.55, 4.04, 4.11, 4.34], m: [3.949, 3.914, 4.32, 4.46, 3.655, 4.384], bu: [49, 39, 47, 51, 20, 25], mu: [47, 39, 47, 39, 20, 26], w: null};
s[307] = {l: 'СУ Козма Тричков', n: 'СУ Козма Тричков', b: [4.253, 3.91, 4.14, 4.02, 4.03, 3.83], m: [4.241, 4.029, 4.55, 4.48, 3.774, 3.841], bu: [53, 50, 51, 50, 21, 24], mu: [53, 49, 51, 48, 21, 24], w: null};
s[308] = {l: 'СУ Мито Орозов', n: 'СУ Мито Орозов', b: [null, 4.4, 3.02, 3.09, null, null], m: [null, 4.33, 3.38, 3.59, null, null], bu: [null, 2, 2, 3, null, null], mu: [null, 2, 2, 3, null, null], w: null};
s[309] = {l: 'СУ Никола Войводов', n: 'СУ Никола Войводов', b: [4.292, 3.93, 3.93, 4.23, 4.28, 3.96], m: [4.123, 4.1, 4.05, 4.48, 5.55, 4.58], bu: [29, 26, 23, 21, 23, 25], mu: [28, 26, 23, 21, 23, 25], w: null};
s[310] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [4.077, 3.91, 3.84, 4.18, 3.67, 3.17], m: [4.169, 4.069, 3.85, 4.2, 4.515, 4.65], bu: [47, 40, 29, 26, 25, 16], mu: [49, 40, 29, 26, 25, 13], w: null};
s[311] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.768, 4.53, 4.77, 4.68, 4.42, 4.63], m: [5.06, 4.764, 5.08, 5.2, 4.191, 4.685], bu: [96, 99, 74, 74, 68, 50], mu: [96, 99, 75, 74, 68, 51], w: null};
s[312] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [3.561, 3.41, 3.64, 3.49, 3.48, 3.18], m: [3.753, 3.736, 4.24, 4.01, 4.36, 4.16], bu: [57, 74, 60, 59, 49, 96], mu: [58, 38, 23, 17, 42, 85], w: null};

// Габрово - индексация
si['Габрово'] = {n: [313, 318], p: null};
// Габрово - държавни училища
s[313] = {l: 'Априловска гимн.', n: 'Национална априловска гимназия', b: [5.12, 5.04, 5.29, 5.05, 4.81, 4.75], m: [5.437, 4.94, 5.35, 5.25, 4.974, 4.93], bu: [114, 122, 125, 126, 123, 128], mu: [114, 122, 125, 126, 123, 128], w: null};
s[314] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Пенчо Семов', b: [3.99, 3.76, 3.97, 3.79, 3.16, 3.23], m: [3.894, 3.938, 4.0, 4.23, 3.75, 4.1], bu: [79, 72, 71, 87, 58, 84], mu: [54, 45, 21, 43, 54, 75], w: null};
s[315] = {l: 'ПМГ', n: 'ПМГ Акад. Иван Гюзелев', b: [4.782, 4.81, 5.16, 4.97, 4.63, 4.65], m: [5.2, 4.923, 5.27, 5.14, 4.361, 4.802], bu: [93, 101, 104, 102, 96, 102], mu: [92, 101, 104, 102, 96, 105], w: null};
s[316] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [3.731, 3.49, 4.05, 3.43, 3.15, 3.22], m: [3.815, 3.826, 4.19, 3.69, 4.15, 4.26], bu: [37, 27, 13, 22, 18, 31], mu: [22, 16, 13, 20, 18, 25], w: null};
s[317] = {l: 'СУ Райчо Каролев', n: 'СУ Райчо Каролев', b: [3.871, 3.18, 3.73, 3.46, 3.3, 3.2], m: [3.894, 3.407, 3.62, 3.69, 3.19, 3.45], bu: [24, 12, 16, 23, 26, 15], mu: [24, 11, 16, 22, 26, 14], w: null};
s[318] = {l: 'Техническа гимн.', n: 'Професионална техническа гимназия', b: [4.002, 3.71, 3.79, 3.83, 3.26, 3.37], m: [4.304, 4.086, 4.07, 4.24, 4.25, 4.068], bu: [108, 100, 100, 112, 86, 99], mu: [100, 97, 92, 91, 86, 88], w: null};

// Добрич - индексация
si['Добрич'] = {n: [319, 332], p: [333, 334]};
// Добрич - държавни училища
s[319] = {l: 'ЕГ Гео Милев', n: 'ЕГ Гео Милев', b: [5.119, 5.27, 5.26, 5.11, 4.83, 4.8], m: [5.399, 5.304, 5.45, 5.26, 5.161, 4.924], bu: [147, 146, 143, 128, 143, 151], mu: [147, 146, 143, 129, 144, 151], w: 'http://eg-dobrich.com'};
s[320] = {l: 'ПГ по агр. стоп.', n: 'Професионална гимназия по аграрно стопанство', b: [3.27, 3.24, 3.34, 3.25, 2.23, 2.46], m: [3.544, 3.84, 5.45, 2.97, 3.491, 3.305], bu: [26, 38, 29, 32, 35, 35], mu: [7, 2, 2, 1, 33, 25], w: 'http://pgasdobrich.com'};
s[321] = {l: 'ПГ по вет. медицина', n: 'ПГ по ветеринарна медицина', b: [3.873, 3.58, 3.66, 3.84, 3.27, 3.35], m: [3.998, 4.035, 4.05, 3.95, 3.68, 3.73], bu: [21, 22, 26, 23, 18, 27], mu: [21, 22, 21, 23, 19, 25], w: 'http://pgvm-dobrich.eu'};
s[322] = {l: 'ПГ по техника', n: 'ПГ по техника и строителство', b: [3.558, 3.31, 3.22, 3.24, 2.77, 3.26], m: [6.0, 3.42, 2.84, 3.07, 3.793, 3.163], bu: [19, 16, 22, 10, 15, 16], mu: [1, 1, 1, 2, 16, 17], w: 'http://pglomonosov.org'};
s[323] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт, обслужване и лека промишленост', b: [3.314, 3.1, 3.14, 3.0, 2.05, 2.65], m: [3.2, null, null, 2.62, 3.71, 4.44], bu: [22, 23, 22, 54, 22, 24], mu: [1, null, null, 1, 26, 27], w: 'http://pgtolp.com'};
s[324] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм П. К. Яворов', b: [3.86, 3.5, 3.63, 3.49, 2.72, 2.88], m: [3.39, 3.32, null, null, 4.78, 4.73], bu: [85, 82, 84, 82, 59, 66], mu: [1, 1, null, null, 58, 49], w: 'http://pgtdobrich.org'};
s[325] = {l: 'ПМГ Иван Вазов', n: 'ПМГ Иван Вазов', b: [4.526, 4.37, 4.68, 4.47, 3.84, 4.29], m: [4.928, 4.503, 4.9, 4.88, 3.493, 4.084], bu: [74, 55, 47, 74, 61, 78], mu: [75, 55, 48, 74, 61, 81], w: 'http://pmg-dobrich.com'};
s[326] = {l: 'Спортно у-ще', n: 'Спортно у-ще Георги Раковски', b: [3.11, 3.32, 3.23, 3.25, 2.3, 3.01], m: [3.21, 3.802, 3.29, 3.54, 4.12, 3.54], bu: [21, 16, 17, 19, 11, 16], mu: [19, 4, 14, 2, 10, 14], w: 'http://sportnodobrich.com'};
s[327] = {l: 'СУ Димитър Талев', n: 'СУ Димитър Талев', b: [4.17, 4.08, 3.92, 4.18, 3.88, 4.01], m: [4.74, 4.531, 4.23, 4.53, 4.02, 4.005], bu: [36, 23, 36, 42, 20, 25], mu: [37, 23, 36, 42, 20, 26], w: 'http://sou-dtalev.info'};
s[328] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.193, 4.1, 4.26, 4.48, 3.83, 4.0], m: [4.554, 4.055, 4.57, 4.98, 3.894, 4.073], bu: [50, 51, 54, 25, 31, 26], mu: [51, 51, 54, 25, 31, 26], w: 'http://hg-dobrich.com'};
s[329] = {l: 'СУ Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.511, 4.46, 4.41, 4.9, 4.38, 4.15], m: [4.688, 4.432, 4.44, 4.82, 4.428, 4.631], bu: [49, 39, 59, 42, 50, 62], mu: [49, 41, 59, 42, 49, 66], w: 'http://klohridski.com'};
s[330] = {l: 'СУ Л. Каравелов', n: 'СУ Любен Каравелов', b: [3.846, 4.13, 4.08, 3.61, 3.35, 2.8], m: [3.886, 4.454, 4.2, 4.12, 2.765, 3.015], bu: [32, 15, 18, 19, 21, 26], mu: [31, 15, 18, 19, 21, 28], w: 'http://karavelov.com'};
s[331] = {l: 'СУ Петко Славейков', n: 'СУ Петко Рачов Славейков', b: [4.116, 4.41, 4.64, 4.19, 4.3, 3.94], m: [4.771, 4.539, 4.82, 4.81, 4.351, 4.035], bu: [14, 30, 17, 23, 27, 21], mu: [14, 30, 19, 21, 27, 21], w: 'http://prslaveikov.com'};
s[332] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска гимназия', b: [4.356, 4.15, 4.32, 4.2, 3.8, 3.96], m: [4.711, 4.332, 4.3, 4.53, 4.63, 5.29], bu: [111, 114, 92, 77, 94, 103], mu: [104, 90, 69, 36, 94, 102], w: 'http://fsgdobrich.org'};
// Добрич - частни училища
s[333] = {l: 'Леонардо да Винчи', n: 'ЧСУ Леонардо да Винчи', b: [null, 4.43, 4.55, 4.76, 3.85, 4.51], m: [null, 4.764, 4.48, 4.94, 3.443, 4.534], bu: [null, 10, 5, 6, 3, 5], mu: [null, 10, 5, 6, 3, 5], w: 'http://leonardo-dobrich.com'};
s[334] = {l: 'Райко Цончев', n: 'ЧПГ Райко Цончев', b: [5.079, 5.07, 4.96, 5.15, 4.93, 4.46], m: [5.514, 4.817, 4.63, 5.26, 4.82, 4.985], bu: [14, 14, 5, 8, 7, 14], mu: [14, 14, 5, 8, 7, 14], w: 'http://rconchev.com'};

// Кърджали - индексация
si['Кърджали'] = {n: [335, 346], p: null};
// Кърджали - държавни училища
s[335] = {l: 'ЕГ', n: 'ЕГ Христо Ботев', b: [5.057, 4.91, 5.09, 5.03, 4.85, 4.76], m: [5.275, 4.817, 5.08, 4.92, 4.548, 4.832], bu: [179, 181, 166, 176, 173, 179], mu: [179, 181, 165, 176, 173, 180], w: null};
s[336] = {l: 'ПГ В. Левски', n: 'ПГ Васил Левски', b: [3.103, 2.69, 2.84, 3.0, 2.46, 2.0], m: [null, null, null, null, 3.66, 3.57], bu: [17, 10, 6, 8, 5, 5], mu: [null, null, null, null, 3, 4], w: null};
s[337] = {l: 'ПГ по електр.', n: 'ПГ по електротехника и електроника', b: [3.477, 3.2, 3.24, 3.38, 2.72, 3.27], m: [3.401, 3.076, 3.53, 3.59, 4.099, 4.6], bu: [50, 50, 29, 40, 35, 56], mu: [54, 55, 28, 43, 36, 47], w: null};
s[338] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [3.531, 3.44, 3.56, 3.99, 3.7, 3.32], m: [3.533, 3.553, 3.14, 4.19, 4.97, 4.78], bu: [131, 129, 104, 117, 70, 88], mu: [70, 30, 13, 11, 67, 74], w: null};
s[339] = {l: 'ПГ по облекло', n: 'ПГ по облекло и дизайн', b: [2.885, 2.98, 2.57, 2.69, 2.15, 2.0], m: [2.685, 2.31, null, null, 3.71, 3.48], bu: [17, 15, 9, 6, 14, 7], mu: [2, 1, null, null, 10, 8], w: null};
s[340] = {l: 'ПГ по с/г стоп.', n: 'ПГ по селско и горско стопанство', b: [3.072, 2.78, 2.76, 2.85, 2.47, 2.44], m: [3.081, 2.536, 2.83, 2.79, 3.67, 3.64], bu: [38, 33, 29, 32, 20, 26], mu: [21, 9, 6, 3, 12, 16], w: null};
s[341] = {l: 'ПГ по строит.', n: 'ПГ по строителство', b: [2.981, 3.13, 3.25, 3.12, 2.76, 3.0], m: [3.168, 2.967, 3.33, 2.9, 4.47, 3.64], bu: [18, 28, 22, 21, 14, 23], mu: [13, 20, 17, 10, 10, 23], w: null};
s[342] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [3.322, 3.13, 3.02, 3.09, 2.51, 2.45], m: [3.504, 3.268, 2.38, 4.41, 3.462, 3.923], bu: [81, 83, 71, 59, 41, 47], mu: [53, 29, 3, 1, 33, 38], w: null};
s[343] = {l: 'СУ В. Димитров', n: 'СУ Владимир Димитров - Майстора', b: [null, 3.63, 3.8, 3.08, 2.42, 3.34], m: [null, 3.905, 4.01, null, 2.12, 3.576], bu: [null, 13, 8, 1, 12, 28], mu: [null, 13, 8, null, 12, 26], w: null};
s[344] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.389, 3.19, 3.19, 3.33, 2.78, 3.18], m: [3.705, 3.599, 3.65, 3.76, 2.918, 3.318], bu: [46, 49, 50, 29, 54, 63], mu: [43, 44, 51, 27, 50, 63], w: null};
s[345] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [4.142, 3.86, 3.96, 4.09, 4.17, 4.16], m: [4.401, 4.332, 4.13, 4.48, 3.758, 4.404], bu: [80, 76, 77, 75, 75, 81], mu: [80, 76, 76, 74, 75, 87], w: null};
s[346] = {l: 'СУ Петко Славейков', n: 'СУ Петко Рачов Славейков', b: [4.528, 4.34, 4.7, 4.94, 4.31, 4.32], m: [4.845, 3.92, 4.74, 5.05, 3.804, 4.106], bu: [90, 93, 93, 78, 102, 103], mu: [88, 94, 93, 78, 102, 106], w: null};

// Кюстендил - индексация
si['Кюстендил'] = {n: [347, 354], p: null};
// Кюстендил - държавни училища
s[347] = {l: 'ЕГ', n: 'ЕГ Д-р Петър Берон', b: [4.766, 4.54, 4.86, 4.5, 4.49, 4.42], m: [5.106, 4.577, 5.09, 4.95, 4.622, 4.27], bu: [73, 75, 77, 57, 106, 83], mu: [74, 77, 77, 57, 106, 83], w: null};
s[348] = {l: 'ПГ по икономика', n: 'ПГ по икономика и мениджмънт', b: [4.368, 3.95, 3.92, 3.84, 3.47, 3.6], m: [4.106, 3.938, 3.74, 3.92, 4.17, 4.256], bu: [122, 117, 110, 88, 77, 100], mu: [127, 116, 110, 82, 75, 99], w: null};
s[349] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост', b: [2.915, 2.94, 2.77, 2.67, 2.0, 2.0], m: [2.582, 2.99, 3.01, 3.06, 2.0, 2.51], bu: [11, 7, 17, 9, 7, 7], mu: [8, 3, 4, 2, 2, 5], w: null};
s[350] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [2.92, 2.7, null, 2.92, 2.0, 2.0], m: [null, 2.92, null, 2.94, null, null], bu: [2, 1, null, 5, 1, 2], mu: [null, 1, null, 2, null, null], w: null};
s[351] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Н. Вапцаров', b: [3.517, 3.44, 3.36, 3.48, 2.51, 2.49], m: [3.593, 3.424, 3.41, 3.61, 4.03, 3.9], bu: [59, 29, 37, 28, 31, 50], mu: [61, 31, 39, 29, 24, 38], w: null};
s[352] = {l: 'ПМГ', n: 'ПМГ Проф. Емануил Иванов', b: [5.039, 4.68, 5.01, 4.76, 4.54, 4.71], m: [5.403, 4.76, 5.08, 5.08, 4.53, 4.293], bu: [75, 101, 99, 95, 96, 75], mu: [75, 100, 99, 95, 96, 75], w: null};
s[353] = {l: 'Спортно у-ще', n: 'Спортно у-ще Васил Левски', b: [3.052, 2.93, 2.88, 2.98, 2.63, 2.47], m: [3.257, 3.145, 3.16, 3.2, 4.3, 4.08], bu: [32, 26, 19, 21, 25, 29], mu: [20, 11, 4, 1, 22, 19], w: null};
s[354] = {l: 'Техн. гимназия', n: 'Професионална техническа гимназия', b: [3.223, 2.89, 2.72, 2.96, 2.18, 2.54], m: [3.213, 2.859, 2.6, 3.11, 3.909, 5.42], bu: [25, 21, 22, 19, 15, 11], mu: [23, 20, 24, 14, 11, 8], w: null};

// Ловеч - индексация
si['Ловеч'] = {n: [355, 362], p: null};
// Ловеч - държавни училища
s[355] = {l: 'ЕГ', n: 'Профилирана ЕГ Екзарх Йосиф I', b: [5.368, 5.23, 5.39, 5.29, 5.21, 4.77], m: [5.621, 4.954, 5.19, 5.19, 5.139, 5.353], bu: [175, 177, 180, 178, 155, 154], mu: [175, 177, 180, 178, 155, 154], w: null};
s[356] = {l: 'ПГ по вет. медицина', n: 'Национална ПГ по ветеринарна медицина', b: [3.824, 3.43, 3.73, 3.67, 3.41, 3.21], m: [4.119, 4.373, 3.96, 3.98, 4.83, 4.44], bu: [42, 47, 59, 55, 45, 42], mu: [26, 20, 24, 16, 42, 39], w: null};
s[357] = {l: 'ПГ по икономика', n: 'ПГ по икономика, търговия и услуги', b: [4.063, 3.68, 3.8, 3.73, 2.32, 2.44], m: [3.985, 3.677, 3.54, 3.29, 4.66, 4.566], bu: [76, 44, 33, 36, 26, 18], mu: [76, 43, 35, 36, 25, 19], w: null};
s[358] = {l: 'ПГ по механ.', n: 'ПГ по механоелектротехника', b: [3.709, 3.42, 3.49, 3.51, 3.1, 2.77], m: [4.11, 3.586, 3.54, 3.76, 3.893, 3.87], bu: [57, 77, 63, 41, 43, 37], mu: [32, 47, 45, 23, 40, 33], w: null};
s[359] = {l: 'ППМГ', n: 'ППМГ', b: [4.621, 4.33, 4.49, 4.34, 4.04, 4.35], m: [4.851, 4.349, 4.34, 4.5, 3.678, 4.1], bu: [112, 103, 98, 101, 81, 91], mu: [112, 104, 99, 102, 81, 96], w: null};
s[360] = {l: 'СУ Димитър Митев', n: 'СУ Димитър Митев', b: [null, null, 2.96, 3.0, null, null], m: [null, null, null, 2.95, null, null], bu: [null, null, 5, 2, null, null], mu: [null, null, null, 1, null, null], w: null};
s[361] = {l: 'СУ Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.575, 3.89, 3.96, 3.86, null, 3.82], m: [4.46, 3.867, 3.93, 4.2, null, 3.565], bu: [23, 14, 14, 11, null, 12], mu: [24, 15, 16, 12, null, 12], w: null};
s[362] = {l: 'СУ Тодор Кирков', n: 'СУ Тодор Кирков', b: [3.737, 3.43, 3.29, 3.51, 3.15, 2.86], m: [3.705, 3.663, 3.15, 3.99, 3.22, 3.036], bu: [21, 22, 18, 21, 23, 17], mu: [21, 23, 19, 22, 23, 17], w: null};

// Монтана - индексация
si['Монтана'] = {n: [363, 371], p: null};
// Монтана - държавни училища
s[363] = {l: '2 СУ', n: '2 СУ Никола Вапцаров', b: [3.837, 3.83, 3.63, 3.66, 3.48, 3.49], m: [3.844, 3.77, 3.45, 3.56, 4.85, 3.73], bu: [9, 12, 10, 14, 8, 7], mu: [9, 13, 10, 14, 8, 7], w: null};
s[364] = {l: '6 СУ', n: '6 СУ Отец Паисий', b: [3.801, 3.52, 3.13, 3.23, 3.94, 2.71], m: [3.664, 3.582, 3.27, 3.46, 2.755, 2.437], bu: [12, 9, 14, 7, 2, 6], mu: [12, 9, 13, 8, 2, 7], w: null};
s[365] = {l: '7 СУ', n: '7 СУ Йоран Радичков', b: [3.565, 3.26, 3.75, 3.22, 2.73, 2.72], m: [3.886, 3.385, 3.74, 3.47, 3.283, 3.057], bu: [16, 20, 24, 18, 12, 20], mu: [18, 20, 25, 17, 12, 19], w: null};
s[366] = {l: 'ГПЧЕ', n: 'ГПЧЕ Петър Богдан', b: [4.99, 4.91, 5.1, 4.59, 4.6, 4.41], m: [5.422, 4.897, 5.15, 4.8, 4.522, 4.687], bu: [100, 96, 97, 80, 92, 101], mu: [100, 96, 97, 80, 92, 105], w: null};
s[367] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост', b: [3.413, 3.29, 3.29, 3.04, 2.57, 2.24], m: [3.153, 2.876, 3.15, 3.41, 3.37, 4.734], bu: [15, 11, 20, 20, 14, 9], mu: [10, 5, 6, 2, 14, 9], w: null};
s[368] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и компютърни науки', b: [3.781, 3.65, 3.74, 3.74, 3.71, 3.39], m: [3.953, 3.703, 3.74, 3.93, 4.42, 5.208], bu: [109, 73, 74, 104, 48, 43], mu: [104, 53, 25, 23, 48, 38], w: null};
s[369] = {l: 'ПГ по техника', n: 'ПГ по техника и електротехника', b: [3.548, 3.47, 3.7, 3.44, 2.96, 3.41], m: [3.626, 3.307, 3.35, 3.33, 4.27, 4.539], bu: [68, 71, 62, 48, 43, 44], mu: [58, 53, 33, 36, 41, 37], w: null};
s[370] = {l: 'ППМГ', n: 'ППМГ Св. Климент Охридски', b: [4.767, 4.6, 4.72, 4.49, 4.29, 4.19], m: [5.054, 4.909, 4.96, 4.95, 4.208, 4.396], bu: [76, 84, 75, 101, 95, 79], mu: [76, 84, 75, 101, 95, 81], w: null};
s[371] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска ПГ   ', b: [4.316, 4.38, 4.5, 4.24, 3.98, 3.91], m: [4.553, 4.92, 4.73, 4.41, 5.04, 5.06], bu: [111, 99, 91, 94, 83, 53], mu: [55, 18, 13, 20, 83, 49], w: null};

// Пазарджик - индексация
si['Пазарджик'] = {n: [372, 385], p: null};
// Пазарджик - държавни училища
s[372] = {l: 'ЕГ', n: 'ЕГ Бертолт Брехт', b: [5.198, 4.98, 5.09, 5.12, 4.92, 4.66], m: [5.416, 4.909, 5.26, 5.16, 5.182, 5.215], bu: [224, 216, 217, 227, 207, 199], mu: [224, 216, 217, 227, 207, 200], w: 'http://egbb.org'};
s[373] = {l: 'ПГ Иван Аксаков', n: 'Профилирана гимназия Иван С. Аксаков', b: [4.246, 4.02, 3.87, 3.83, 3.03, 3.5], m: [4.499, 4.099, 4.15, 4.14, 3.254, 3.496], bu: [30, 33, 11, 24, 5, 10], mu: [31, 34, 11, 23, 5, 10], w: 'http://aksakov-bg.com'};
s[374] = {l: 'ПГ по икономика', n: 'ПГ по икономика и мениджмънт', b: [4.291, 4.3, 4.43, 4.32, 3.9, 3.63], m: [4.273, 4.116, 4.13, 4.09, 5.48, 5.303], bu: [209, 161, 178, 151, 174, 169], mu: [87, 106, 111, 103, 172, 164], w: 'http://pgimpazardjik.com'};
s[375] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.579, 3.37, 3.44, 3.5, 3.14, 2.88], m: [3.87, 3.511, 3.67, 3.6, 4.81, 4.75], bu: [130, 135, 122, 106, 121, 102], mu: [100, 65, 58, 40, 110, 89], w: 'http://pgmetpz.com'};
s[376] = {l: 'ПГ по пром. техн.', n: 'ПГ по промишлени технологии', b: [3.05, 2.92, 2.88, 2.95, 2.0, 2.1], m: [3.42, null, null, 3.48, null, 3.27], bu: [19, 16, 19, 15, 3, 11], mu: [1, null, null, 1, null, 5], w: 'http://pgpt-pazardzhik.com'};
s[377] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.266, 2.99, 3.26, 2.97, 2.15, 2.17], m: [3.523, 3.522, 3.65, 3.1, 4.3, 4.23], bu: [43, 37, 30, 55, 31, 28], mu: [10, 4, 4, 2, 21, 18], w: 'http://pgss-pz.com'};
s[378] = {l: 'ПГ по строителство', n: 'ПГ по строителство и архитектура', b: [3.525, 3.3, 3.44, 3.34, 2.84, 3.0], m: [3.478, 3.417, 3.37, 3.05, 3.44, 4.53], bu: [72, 37, 42, 35, 26, 27], mu: [72, 34, 31, 15, 29, 26], w: 'http://pgsa-paz.com'};
s[379] = {l: 'ПГ по фризьорство', n: 'ПГ по фризьорство и ресторантьорство', b: [3.512, 3.15, 3.75, 2.97, 2.33, 2.78], m: [3.444, null, null, null, 4.08, 5.52], bu: [15, 10, 6, 14, 10, 8], mu: [5, null, null, null, 9, 9], w: 'http://pgfr-pz.com'};
s[380] = {l: 'ПГ по хим. и хр. техн.', n: 'ПГ по химични и хранителни технологии', b: [3.671, 3.14, 3.17, 3.06, 2.43, 2.28], m: [4.332, 3.217, 2.84, 2.66, 4.059, 3.868], bu: [51, 23, 55, 65, 45, 50], mu: [7, 4, 1, 1, 37, 54], w: 'http://pghht.weebly.com'};
s[381] = {l: 'ПМГ', n: 'ПМГ Константин Величков', b: [4.822, 4.57, 4.94, 4.74, 4.54, 4.26], m: [5.047, 4.628, 4.86, 4.76, 4.48, 4.296], bu: [105, 90, 84, 119, 135, 118], mu: [106, 90, 84, 98, 135, 118], w: 'http://mgpz.org'};
s[382] = {l: 'СпУ Пазарджик', n: 'Спортно у-ще Пазарджик', b: [null, null, null, null, null, 3.18], m: [null, null, null, null, null, 5.07], bu: [null, null, null, null, null, 58], mu: [null, null, null, null, null, 57], w: 'http://sportnopz.com'};
s[383] = {l: 'СУ Г. Бенковски', n: 'СУ Георги Бенковски', b: [4.123, 4.18, 3.94, 3.7, 3.78, 3.59], m: [4.13, 4.144, 3.97, 3.73, 3.735, 3.9], bu: [13, 20, 48, 39, 33, 28], mu: [13, 20, 48, 39, 33, 27], w: 'http://facebook.com/sugbenkovski'};
s[384] = {l: 'СУ Г. Брегов', n: 'СУ Георги Брегов', b: [4.175, 3.77, 3.24, 3.43, 3.53, 3.4], m: [3.918, 3.766, 3.5, 3.73, 3.785, 4.176], bu: [18, 45, 1, 22, 18, 23], mu: [18, 45, 1, 20, 16, 24], w: 'http://soubregov.wordpress.com'};
s[385] = {l: 'СУ П. Берон', n: 'СУ Д-р Петър Берон', b: [3.456, 3.03, 3.31, 3.66, 2.96, 3.18], m: [3.627, 3.118, 3.44, 4.16, 3.615, 3.611], bu: [17, 11, 15, 21, 16, 23], mu: [17, 11, 15, 20, 15, 23], w: 'http://beronpz.eu'};

// Перник - индексация
si['Перник'] = {n: [386, 397], p: null};
// Перник - държавни училища
s[386] = {l: '5 СУ', n: '5 СУ Петко Рачов Славейков', b: [3.486, 3.53, 2.77, 3.29, 2.0, 3.08], m: [3.532, 3.633, null, 3.54, null, 5.19], bu: [13, 4, 1, 13, 1, 9], mu: [14, 3, null, 13, null, 8], w: 'http://5supernik.bg'};
s[387] = {l: '6 СУ', n: '6 СУ Св. Св. Кирил и Методий', b: [3.898, 3.5, 4.01, 3.71, 3.44, 2.64], m: [3.998, 3.517, 4.18, 3.89, 5.45, 4.52], bu: [17, 15, 6, 8, 11, 9], mu: [16, 15, 6, 8, 10, 4], w: 'http://6su-pernik.eu'};
s[388] = {l: 'ГПЧЕ', n: 'ГПЧЕ Симеон Радев', b: [5.093, 4.95, 4.98, 5.0, 4.56, 4.38], m: [5.214, 4.746, 5.01, 5.17, 4.866, 4.891], bu: [147, 153, 145, 142, 142, 133], mu: [147, 153, 145, 142, 142, 133], w: 'http://simeonradev.org'};
s[389] = {l: 'ОбУ Темелко Ненков', n: 'ОбУ Темелко Ненков', b: [null, null, null, null, 2.15, 2.0], m: [null, null, null, null, 4.11, 3.98], bu: [null, null, null, null, 16, 12], mu: [null, null, null, null, 12, 8], w: 'http://facebook.com/SUTemelkoNenkov/'};
s[390] = {l: 'ПГ Мария Кюри', n: 'Технологична ПГ Мария Кюри', b: [3.584, 3.36, 3.02, 3.43, 2.42, 2.95], m: [3.77, 3.476, 3.14, 3.66, 3.7, 4.42], bu: [31, 23, 18, 26, 31, 15], mu: [29, 23, 14, 26, 27, 12], w: 'http://tpg-pk.eu'};
s[391] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [4.254, 3.96, 4.21, 4.03, 3.63, 3.66], m: [4.303, 4.16, 4.3, 4.37, 4.67, 4.82], bu: [122, 114, 82, 104, 96, 115], mu: [93, 115, 67, 83, 96, 103], w: 'http://pgi-pernik.bg-schools.com'};
s[392] = {l: 'ПГ по облекло', n: 'Професионална гимназия по облекло и туризъм', b: [3.549, 3.44, 3.56, 3.36, 2.81, 2.94], m: [3.599, 3.588, 3.74, 3.66, 3.83, 4.49], bu: [78, 56, 69, 36, 17, 29], mu: [74, 54, 31, 20, 16, 26], w: 'http://pgotpernik.com'};
s[393] = {l: 'ПГ по техн. и енерг.', n: 'ПГ по техника и енергетика', b: [3.266, 3.37, 3.31, 3.34, 3.05, 3.06], m: [3.343, 3.582, 3.43, 3.61, 5.26, 4.62], bu: [51, 45, 48, 44, 17, 30], mu: [56, 51, 49, 45, 14, 25], w: 'http://pgtehristobotev.com'};
s[394] = {l: 'ПГ по техн. и строит.', n: 'ПГ по техника и строителство', b: [3.887, 3.67, 4.04, 3.78, 3.34, 3.33], m: [3.923, 3.935, 4.01, 4.2, 3.84, 4.615], bu: [102, 84, 98, 91, 92, 102], mu: [82, 49, 59, 60, 92, 89], w: 'http://pgts.info'};
s[395] = {l: 'ПМГ', n: 'ПМГ Христо Смирненски', b: [4.507, 4.17, 4.52, 4.37, 4.46, 4.31], m: [5.054, 4.588, 4.77, 4.94, 4.344, 4.315], bu: [97, 98, 83, 73, 75, 78], mu: [96, 98, 83, 73, 75, 81], w: 'http://pmg-pernik.com'};
s[396] = {l: 'СпУ Олимпиец', n: 'Спортно у-ще Олимпиец', b: [3.488, 3.28, 3.24, 3.23, 2.92, 2.83], m: [3.33, 3.425, 3.31, 3.61, 2.69, 4.145], bu: [22, 20, 20, 16, 12, 24], mu: [23, 22, 21, 12, 12, 22], w: 'http://sportnopernik.com'};
s[397] = {l: 'СУРИЧЕ П. Берон', n: 'СУРИЧЕ Д-р Петър Берон', b: [4.758, 4.95, 4.61, 4.59, 4.19, 4.0], m: [5.23, 4.645, 4.99, 4.98, 4.822, 4.07], bu: [25, 25, 24, 21, 47, 45], mu: [25, 25, 24, 21, 47, 44], w: 'http://suberon-pernik.com'};

// Плевен - индексация
si['Плевен'] = {n: [398, 419], p: null};
// Плевен - държавни училища
s[398] = {l: 'ГПЧЕ', n: 'ГПЧЕ', b: [4.874, 4.77, 4.88, 4.81, 4.5, 4.43], m: [5.314, 4.873, 4.99, 5.15, 4.792, 4.8], bu: [161, 166, 170, 155, 159, 175], mu: [161, 166, 170, 155, 159, 176], w: 'http://gpche-pl.com'};
s[399] = {l: 'ДФСГ Интелект', n: 'Държавна финансово-стопанска гимназия Интелект', b: [4.509, 4.3, 4.48, 4.45, 3.95, 3.71], m: [4.494, 4.477, 4.43, 4.67, 4.563, 4.86], bu: [116, 102, 101, 93, 67, 86], mu: [88, 68, 68, 38, 67, 84], w: 'http://dfsg-intellect.com'};
s[400] = {l: 'МГ Гео Милев', n: 'МГ Гео Милев', b: [5.154, 5.14, 5.13, 5.05, 4.75, 4.8], m: [5.592, 5.208, 5.21, 5.17, 4.648, 4.778], bu: [146, 150, 151, 149, 147, 153], mu: [146, 150, 151, 149, 147, 157], w: 'http://pleven-mg.com'};
s[401] = {l: 'НУИ', n: 'НУИ Панайот Пипков', b: [4.517, 4.15, 4.45, 4.3, 4.19, 4.02], m: [4.333, 4.234, 4.44, 4.3, 4.31, 4.733], bu: [59, 42, 41, 49, 47, 57], mu: [24, 23, 33, 24, 47, 60], w: 'http://plevenartschool.com'};
s[402] = {l: 'ПГ Захарий Зограф', n: 'ПГ Захарий Зограф', b: [3.153, 2.86, 2.67, 2.71, 2.0, null], m: [3.302, 2.48, 2.42, 2.64, 2.0, null], bu: [12, 5, 4, 4, 1, null], mu: [11, 1, 2, 2, 1, null], w: 'http://www.daskalo.com/pgdm/'};
s[403] = {l: 'ПГ по ел. и хим.', n: 'ПГ по електроника и химични технологии', b: [4.028, 3.98, 4.09, 3.98, 3.69, 3.66], m: [4.576, 4.507, 4.71, 4.65, 4.985, 5.08], bu: [78, 70, 100, 99, 79, 92], mu: [46, 29, 28, 20, 76, 92], w: 'http://pgeht.net'};
s[404] = {l: 'ПГ по лоз. и вин.', n: 'ПГ по лозарство и винарство', b: [3.474, 3.22, 3.22, 3.28, 2.55, 2.28], m: [3.58, 3.164, 2.57, 4.22, 3.97, 4.48], bu: [32, 26, 19, 28, 23, 15], mu: [2, 5, 1, 5, 19, 8], w: 'http://pglv-pleven.alle.bg'};
s[405] = {l: 'ПГ по мениджмънт', n: 'ПГ по мениджмънт и хранителни технологии', b: [2.775, 2.86, 2.46, 2.71, 2.0, 2.69], m: [3.61, 3.11, 3.03, 2.9, 2.51, 4.286], bu: [6, 1, 1, 10, 9, 3], mu: [1, 2, 1, 5, 4, 3], w: 'http://pgmht-pleven.com'};
s[406] = {l: 'ПГ по механ.', n: 'ПГ по механоелектротехника', b: [3.73, 3.35, 3.56, 3.53, 2.56, 2.73], m: [4.55, 3.514, 4.04, 4.41, 4.56, 4.319], bu: [49, 56, 50, 52, 27, 28], mu: [24, 34, 24, 13, 25, 18], w: 'http://pgmet.pleven.bg'};
s[407] = {l: 'ПГ по облекло', n: 'ПГ по облекло и текстил', b: [3.414, 3.44, 3.1, 3.01, 2.48, 2.31], m: [2.93, 3.383, 3.23, 4.01, 4.587, 3.82], bu: [10, 17, 16, 15, 9, 7], mu: [2, 6, 4, 1, 7, 6], w: 'http://pgot-pleven.com'};
s[408] = {l: 'ПГ по под/стр/тр. техн.', n: 'ПГ по подемна, строителна и транспортна техника', b: [3.018, 2.9, 2.85, 3.1, 2.25, 2.27], m: [3.024, 2.695, 2.79, 3.48, 4.93, 4.48], bu: [45, 41, 35, 18, 17, 16], mu: [35, 17, 2, 4, 14, 15], w: 'http://pgpstt-pleven.com'};
s[409] = {l: 'ПГ по рест., търг. и обсл.', n: 'ПГ по ресторантьорство, търговия и обслужване', b: [3.593, 3.61, 3.57, 3.47, 3.33, 2.91], m: [3.778, 3.651, 3.8, 3.69, 4.174, 4.46], bu: [94, 48, 64, 44, 41, 33], mu: [82, 44, 43, 15, 38, 32], w: 'http://pgrto.com'};
s[410] = {l: 'ПГ по строителство', n: 'ПГ по строит., арх. и геод.', b: [4.052, 3.6, 3.74, 3.58, 3.86, 3.34], m: [4.244, 3.537, 3.64, 3.77, 4.14, 4.462], bu: [32, 20, 17, 12, 6, 25], mu: [17, 8, 8, 9, 5, 24], w: 'http://pgsag.org'};
s[411] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.322, 3.33, 3.22, 3.12, 2.75, 2.55], m: [3.533, 3.324, 3.9, 2.88, 4.019, 3.769], bu: [70, 54, 56, 30, 41, 51], mu: [42, 11, 11, 7, 38, 38], w: 'http://sites.google.com/view/pgtpleven'};
s[412] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Алеко Константинов', b: [4.395, 4.08, 4.09, 4.11, 3.8, 3.71], m: [4.488, 4.16, 4.14, 4.6, 4.979, 4.711], bu: [78, 98, 83, 96, 72, 86], mu: [62, 52, 50, 28, 70, 86], w: 'http://pgt-pleven.com'};
s[413] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хранително-вкусови технологии', b: [3.34, 3.22, 3.11, 3.31, 2.4, 2.63], m: [3.1, 3.165, 2.91, 3.51, 4.97, 4.93], bu: [26, 22, 17, 30, 22, 32], mu: [6, 14, 10, 11, 14, 21], w: 'http://pghvt.com'};
s[414] = {l: 'СпУ Г. Бенковски', n: 'Спортно у-ще Георги Бенковски', b: [3.675, 3.53, 3.67, 3.41, 3.04, 2.78], m: [4.492, 4.159, 4.39, 4.89, 3.3, 4.005], bu: [42, 47, 52, 48, 39, 47], mu: [14, 7, 5, 2, 36, 45], w: 'http://supleven.bg'};
s[415] = {l: 'СУ А. Димитрова', n: 'СУ Анастасия Димитрова', b: [4.025, 3.3, 3.92, 3.34, 2.95, 2.41], m: [4.21, 3.304, 3.96, 3.32, 2.32, 2.7], bu: [22, 9, 15, 12, 17, 12], mu: [20, 9, 14, 12, 16, 12], w: 'http://www.daskalo.com/anastasia'};
s[416] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [4.851, 4.81, 5.08, 4.93, 4.52, 4.36], m: [5.229, 5.053, 4.98, 5.04, 4.092, 4.19], bu: [84, 87, 51, 80, 98, 106], mu: [84, 87, 51, 80, 98, 109], w: 'http://suivanvazov.com'};
s[417] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [3.713, 3.85, 3.6, 3.7, 3.31, 3.04], m: [4.009, 3.804, 3.54, 3.96, 3.126, 3.309], bu: [27, 18, 15, 26, 17, 14], mu: [28, 18, 15, 26, 17, 13], w: 'http://su-yavorov-pl.com'};
s[418] = {l: 'СУ Стоян Заимов', n: 'СУ Стоян Заимов', b: [4.342, 4.37, 4.58, 3.64, 4.0, 3.75], m: [4.308, 4.555, 4.99, 3.74, 3.571, 3.571], bu: [27, 46, 14, 20, 36, 50], mu: [28, 46, 14, 20, 36, 55], w: 'http://zaimov-pl.com'};
s[419] = {l: 'СУ Х. Смирненски', n: 'СУ Христо Смирненски', b: [3.427, 3.14, 3.52, 3.41, 3.03, 2.77], m: [3.603, 3.28, 3.86, 3.65, 2.98, 2.515], bu: [23, 20, 21, 10, 17, 16], mu: [24, 15, 20, 10, 14, 13], w: 'http://smirnenskipleven.com'};

// Разград - индексация
si['Разград'] = {n: [420, 428], p: null};
// Разград - държавни училища
s[420] = {l: 'ГПЧЕ', n: 'ГПЧЕ Екзарх Йосиф', b: [4.958, 4.97, 5.15, 4.75, 4.52, 4.64], m: [5.21, 4.941, 5.28, 5.06, 4.725, 4.862], bu: [109, 109, 108, 108, 98, 102], mu: [109, 109, 108, 108, 98, 102], w: null};
s[421] = {l: 'ПГ по икономика', n: 'ПГ по икономика Робер Шуман', b: [3.873, 3.71, 3.89, 3.71, 3.69, 3.23], m: [3.871, 3.952, 3.92, 3.93, 4.289, 4.554], bu: [120, 96, 93, 86, 69, 89], mu: [117, 86, 86, 74, 70, 85], w: null};
s[422] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [3.377, 3.12, 3.26, 3.27, 2.18, 2.15], m: [3.572, 3.21, null, null, 4.32, 4.46], bu: [17, 15, 16, 22, 12, 12], mu: [12, 2, null, null, 11, 15], w: null};
s[423] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.074, 3.01, 3.0, 2.93, 2.31, 2.17], m: [3.47, 3.278, 3.17, 2.96, 4.61, 4.048], bu: [15, 24, 13, 19, 20, 28], mu: [14, 22, 10, 3, 14, 23], w: null};
s[424] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт и строителство', b: [3.46, 3.35, 3.23, 3.28, 2.27, 2.68], m: [5.84, null, null, null, 3.48, 4.9], bu: [10, 7, 17, 13, 11, 8], mu: [1, null, null, null, 11, 13], w: null};
s[425] = {l: 'ПГ по хим. техн.', n: 'ПГ по химични технологии и биотехнологии', b: [3.28, 3.19, 3.48, 3.46, 2.79, 2.58], m: [3.36, 3.636, 3.8, 5.43, 4.705, 4.565], bu: [48, 37, 22, 24, 28, 31], mu: [45, 24, 4, 2, 27, 25], w: null};
s[426] = {l: 'ППМГ', n: 'ППМГ Акад. Никола Обрешков', b: [5.034, 4.72, 4.96, 5.15, 4.73, 4.56], m: [5.101, 4.814, 5.12, 5.14, 4.438, 4.576], bu: [98, 93, 83, 101, 106, 102], mu: [98, 93, 83, 101, 106, 102], w: null};
s[427] = {l: 'Спортно у-ще', n: 'Спортно у-ще - Разград', b: [3.073, 3.13, 3.14, 3.3, 2.99, 3.26], m: [2.82, 3.11, null, null, 5.13, 4.71], bu: [19, 22, 21, 21, 20, 18], mu: [5, 1, null, null, 23, 16], w: null};
s[428] = {l: 'Техническа гимназия', n: 'Национална професионална техническа гимназия', b: [3.71, 3.58, 3.64, 3.67, 3.02, 3.12], m: [3.719, 3.557, 3.86, 4.09, 3.402, 3.877], bu: [110, 112, 84, 104, 96, 89], mu: [108, 102, 61, 47, 90, 84], w: null};

// Русе - индексация
si['Русе'] = {n: [429, 450], p: [451, 452]};
// Русе - държавни училища
s[429] = {l: 'АЕГ Гео Милев', n: 'Английска ЕГ Гео Милев', b: [4.966, 5.09, 5.11, 5.11, 4.73, 4.73], m: [5.695, 5.132, 5.6, 5.41, 5.129, 5.039], bu: [90, 99, 99, 98, 102, 105], mu: [90, 97, 99, 98, 102, 105], w: 'http://elsruse.eu'};
s[430] = {l: 'Духовно училище', n: 'Духовно училище', b: [3.402, 3.09, 3.48, 3.25, 2.99, 2.41], m: [3.799, 3.459, 3.47, 3.11, 2.85, 3.048], bu: [10, 5, 1, 3, 4, 4], mu: [10, 3, 3, 3, 4, 5], w: 'http://sodu-ruse.com'};
s[431] = {l: 'МГ Баба Тонка', n: 'МГ Баба Тонка', b: [5.151, 5.09, 5.26, 5.19, 4.98, 4.95], m: [5.695, 5.287, 5.33, 5.54, 4.832, 4.977], bu: [126, 122, 124, 127, 131, 101], mu: [126, 122, 124, 127, 131, 101], w: 'http://mg-babatonka.bg'};
s[432] = {l: 'НУИ', n: 'НУИ Проф. Веселин Стоянов', b: [4.282, 4.17, 4.41, 4.3, 3.78, 3.67], m: [4.437, 4.658, 4.28, 4.39, 3.54, 4.23], bu: [34, 38, 39, 55, 39, 46], mu: [13, 15, 15, 40, 38, 47], w: 'http://artrousse.com'};
s[433] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване и вътрешна архитектура', b: [3.618, 2.95, 3.14, 3.58, 3.2, 3.05], m: [4.115, 3.1, null, 3.2, 4.5, 3.569], bu: [43, 14, 18, 31, 23, 41], mu: [12, 3, null, 4, 23, 40], w: 'http://pgdva-ruse.net'};
s[434] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и електроника', b: [3.911, 3.85, 3.99, 3.73, 3.68, 3.47], m: [4.261, 3.923, 4.28, 4.23, 4.929, 4.956], bu: [99, 89, 69, 68, 65, 80], mu: [100, 92, 69, 64, 65, 78], w: 'http://electroschool.com'};
s[435] = {l: 'ПГ по икономика', n: 'ПГ по икономика и управление', b: [4.865, 4.38, 4.75, 4.75, 4.17, 4.47], m: [4.977, 4.392, 4.78, 4.91, 5.09, 5.27], bu: [125, 128, 124, 124, 102, 83], mu: [125, 127, 114, 83, 102, 82], w: 'http://pgiu-ruse.jusoft.net'};
s[436] = {l: 'ПГ по корабостр.', n: 'ПГ по речно корабостроене и корабоплаване', b: [3.684, 3.3, 3.38, 3.32, 2.92, 2.79], m: [3.803, 3.452, 3.53, 3.49, 4.16, 3.76], bu: [45, 59, 66, 45, 34, 51], mu: [44, 59, 58, 35, 31, 44], w: 'http://pgrkk-ruse-bg.net'};
s[437] = {l: 'ПГ по механот.', n: 'ПГ по механотехника', b: [3.459, 3.29, 3.27, 3.2, 2.27, 2.59], m: [3.384, 3.237, 2.74, 3.04, 4.25, 3.78], bu: [24, 21, 22, 44, 24, 43], mu: [17, 4, 3, 14, 21, 29], w: 'http://pgmt-ruse.com'};
s[438] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [3.633, 3.29, 3.45, 3.34, 2.71, 2.73], m: [5.303, 3.34, 3.0, null, 4.75, 4.9], bu: [68, 62, 55, 50, 65, 74], mu: [6, 1, 1, null, 58, 61], w: 'http://pgo-rousse.com'};
s[439] = {l: 'ПГ по пром. техн.', n: 'ПГ по промишлени технологии', b: [3.394, 3.25, 3.47, 3.34, 2.3, 2.52], m: [2.87, 3.22, null, 5.63, 3.59, 3.85], bu: [57, 54, 28, 33, 23, 20], mu: [2, 1, null, 1, 20, 13], w: 'http://pgpt.org'};
s[440] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.228, 3.11, 3.31, 3.07, 2.34, 2.62], m: [3.241, 3.076, 3.28, 3.15, 2.79, 4.38], bu: [16, 19, 10, 22, 14, 23], mu: [19, 20, 10, 20, 12, 21], w: 'http://pgss-ruse.com'};
s[441] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и геодезия', b: [4.089, 4.02, 3.99, 3.9, 3.75, 3.76], m: [4.109, 3.767, 4.08, 3.83, 3.93, 4.219], bu: [54, 65, 60, 50, 35, 75], mu: [37, 47, 35, 17, 35, 73], w: 'http://pgsag.com'};
s[442] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.342, 3.32, 3.3, 3.44, 3.2, 2.78], m: [2.83, 3.29, 5.61, 4.04, 5.09, 5.004], bu: [17, 36, 39, 28, 24, 32], mu: [2, 2, 1, 3, 26, 27], w: 'http://pgtransport-ruse.com'};
s[443] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [4.018, 3.87, 3.79, 3.72, 3.82, 3.56], m: [4.142, 3.967, 3.88, 3.82, 4.9, 4.11], bu: [119, 112, 93, 118, 88, 99], mu: [65, 54, 79, 97, 88, 96], w: 'http://pgtourism.info'};
s[444] = {l: 'СпУ Ат. Узунов', n: 'Спортно у-ще Атанас Узунов', b: [3.727, 3.45, 3.63, 3.21, 2.57, 2.5], m: [4.018, 3.938, 3.93, 3.71, 4.66, 3.13], bu: [31, 31, 17, 17, 26, 26], mu: [8, 19, 16, 14, 23, 19], w: 'http://suruse.eu'};
s[445] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [4.433, 4.4, 4.48, 4.68, 4.04, 4.16], m: [4.974, 4.659, 4.95, 5.01, 4.207, 4.339], bu: [67, 50, 60, 62, 52, 72], mu: [68, 50, 60, 62, 51, 73], w: 'http://sulevski-ruse.org'};
s[446] = {l: 'СУ Възраждане', n: 'СУ Възраждане', b: [4.197, 3.84, 3.89, 3.92, 3.94, 4.04], m: [4.287, 4.073, 4.03, 4.06, 3.474, 4.169], bu: [46, 46, 48, 47, 24, 29], mu: [45, 45, 48, 46, 23, 32], w: 'http://vazrajdane.com'};
s[447] = {l: 'СУ за европ. езици', n: 'СУ за европейски езици', b: [4.977, 4.92, 4.73, 4.73, 4.53, 4.6], m: [5.164, 4.951, 5.03, 5.03, 4.862, 5.241], bu: [148, 101, 97, 117, 101, 107], mu: [148, 101, 97, 116, 101, 107], w: 'http://souee.bg'};
s[448] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.846, 3.8, null, 3.96, null, 3.72], m: [3.866, 3.936, null, 4.16, null, 3.7], bu: [26, 20, null, 17, null, 11], mu: [26, 20, null, 17, null, 11], w: 'http://yovkov-rs.info'};
s[449] = {l: 'СУ Фридрих Шилер', n: 'СУ с немски език Фридрих Шилер', b: [5.0, 4.9, 4.95, 4.75, 4.43, 4.46], m: [5.175, 4.806, 5.18, 4.94, 5.041, 5.567], bu: [68, 69, 68, 53, 74, 77], mu: [68, 69, 68, 53, 74, 77], w: 'http://schiller-schule.info'};
s[450] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.658, 4.44, 4.51, 4.25, 4.23, 4.55], m: [4.835, 4.35, 4.59, 4.73, 3.812, 4.122], bu: [76, 71, 45, 64, 77, 83], mu: [77, 71, 46, 63, 77, 87], w: 'http://sou-botev.com'};
// Русе - частни училища
s[451] = {l: 'Джордж Байрон', n: 'ЧПАГ Джордж Байрон', b: [4.533, 4.03, 3.97, 4.4, 3.27, null], m: [5.313, 4.285, 4.7, 4.65, 3.04, null], bu: [12, 6, 7, 2, 2, null], mu: [13, 6, 7, 2, 2, null], w: 'http://lordbyronruse.eu'};
s[452] = {l: 'Леонардо да Винчи', n: 'Първо ЧСУ Леонардо да Винчи', b: [4.81, 4.68, 4.42, 4.65, 3.87, 3.66], m: [5.554, 4.444, 5.02, 5.08, 4.09, 3.83], bu: [12, 6, 9, 7, 5, 11], mu: [12, 6, 9, 7, 5, 12], w: 'http://psleonardo.com'};

// Силистра - индексация
si['Силистра'] = {n: [453, 461], p: null};
// Силистра - държавни училища
s[453] = {l: 'ЕГ', n: 'ЕГ Пейо Яворов', b: [5.114, 5.03, 5.06, 4.98, 4.76, 4.69], m: [5.453, 5.005, 5.33, 5.16, 5.126, 5.053], bu: [71, 72, 48, 57, 54, 73], mu: [71, 72, 48, 57, 54, 73], w: null};
s[454] = {l: 'Земеделска гимназия', n: 'Професионална земеделска гимназия', b: [3.058, 2.92, 3.02, 3.14, 2.51, 2.65], m: [3.227, 3.089, 3.37, 3.71, 3.282, 4.649], bu: [65, 51, 38, 33, 17, 23], mu: [61, 30, 8, 3, 17, 14], w: null};
s[455] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [3.405, 3.27, 3.43, 3.32, 2.71, 2.76], m: [4.08, 4.013, 3.96, null, 3.949, 4.154], bu: [79, 60, 54, 44, 43, 42], mu: [8, 6, 5, null, 43, 36], w: null};
s[456] = {l: 'ПГ по произв. техн.', n: 'ПГ по производствени технологии', b: [3.701, 3.26, 3.43, 3.45, 3.3, 3.27], m: [3.993, 3.68, 3.93, 3.51, 4.5, 4.417], bu: [21, 26, 27, 39, 21, 24], mu: [18, 3, 2, 4, 21, 24], w: null};
s[457] = {l: 'ПГ по стоп. упр.', n: 'ПГ по стопанско управление', b: [4.479, 4.22, 4.3, 4.51, 3.84, 3.9], m: [4.33, 3.927, 3.94, 4.54, 5.075, 4.99], bu: [97, 99, 74, 72, 71, 64], mu: [67, 70, 35, 34, 70, 60], w: null};
s[458] = {l: 'ПГ по строителство', n: 'ПГ по строителство Пеньо Пенев', b: [3.225, 3.42, 2.94, 3.44, 3.09, 2.85], m: [3.343, 3.601, 3.15, 2.48, 4.737, 3.769], bu: [46, 28, 24, 22, 13, 22], mu: [30, 25, 15, 1, 10, 19], w: null};
s[459] = {l: 'ПМГ', n: 'ПМГ Св. Климент Охридски', b: [4.776, 4.61, 4.92, 4.94, 4.45, 4.53], m: [5.191, 4.727, 5.08, 5.07, 4.526, 4.476], bu: [67, 68, 51, 72, 72, 67], mu: [68, 68, 51, 71, 72, 67], w: null};
s[460] = {l: 'Спортно у-ще', n: 'Спортно у-ще Дръстър', b: [3.584, 3.43, 3.53, 3.38, 2.91, 3.18], m: [3.716, 3.576, 4.51, null, 4.16, 3.94], bu: [19, 14, 18, 19, 15, 15], mu: [18, 3, 3, null, 15, 15], w: null};
s[461] = {l: 'СУ Н. Вапцаров', n: 'СУ Никола Вапцаров', b: [4.35, 3.92, 4.05, 4.48, 3.93, 3.53], m: [4.725, 4.206, 4.27, 4.88, 3.481, 3.329], bu: [28, 33, 44, 19, 20, 20], mu: [28, 33, 46, 19, 19, 22], w: null};

// Сливен - индексация
si['Сливен'] = {n: [462, 477], p: null};
// Сливен - държавни училища
s[462] = {l: 'Гимн. със зап. ез.', n: 'ПГ с преподаване на западни езици', b: [5.12, 4.95, 5.0, 5.06, 4.87, 4.52], m: [5.419, 4.896, 5.15, 5.2, 5.049, 5.035], bu: [119, 121, 125, 109, 153, 151], mu: [119, 121, 126, 111, 152, 153], w: 'http://gpzebg.org'};
s[463] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и електроника', b: [3.539, 3.39, 3.38, 3.37, 2.61, 2.48], m: [3.605, 3.633, 3.61, 3.47, 4.49, 4.6], bu: [63, 54, 48, 41, 39, 40], mu: [64, 53, 46, 42, 34, 31], w: 'http://pgee-sliven.bg'};
s[464] = {l: 'ПГ по икономика', n: 'ПГ по икономика Проф. д-р Димитър Табаков', b: [4.417, 4.18, 4.43, 4.19, 3.99, 3.62], m: [4.444, 4.259, 4.27, 4.59, 5.35, 5.37], bu: [118, 105, 72, 88, 88, 114], mu: [117, 99, 51, 76, 86, 111], w: 'http://pgisliven.eu'};
s[465] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [3.045, 2.97, 3.02, 3.06, 2.08, 2.16], m: [2.892, 2.98, 3.15, 3.19, 3.893, 2.707], bu: [39, 51, 65, 63, 31, 38], mu: [23, 6, 58, 59, 29, 33], w: 'http://pgmsliven.com'};
s[466] = {l: 'ПГ по стр. и геод.', n: 'Сливенска ПГ по строителство и геодезия', b: [3.467, 3.43, 3.24, 3.35, 2.59, 2.53], m: [3.34, 3.869, 3.82, 3.67, 3.231, 3.84], bu: [31, 40, 37, 19, 19, 13], mu: [12, 16, 9, 7, 23, 15], w: 'http://pgsg-sliven.com'};
s[467] = {l: 'ПГ по текстил', n: 'ПГ по текстил и облекло Добри Желязков', b: [3.334, 3.65, 3.28, 3.24, 2.23, 2.66], m: [3.413, 3.754, 3.47, 3.5, 4.01, 3.982], bu: [7, 10, 32, 24, 15, 13], mu: [3, 7, 8, 14, 11, 14], w: 'http://pgto-sliven.com'};
s[468] = {l: 'ПГ по хотелиерство', n: 'ПГ по хотелиерство и туризъм', b: [4.133, 4.1, 4.05, 4.32, 3.54, 3.59], m: [4.02, 4.117, 3.98, 4.36, 4.302, 4.45], bu: [100, 113, 113, 84, 83, 79], mu: [67, 52, 95, 65, 79, 72], w: 'http://pght-sliven.com'};
s[469] = {l: 'ППМГ', n: 'ППМГ Добри Чинтулов', b: [5.16, 4.86, 5.14, 4.77, 4.76, 4.7], m: [5.458, 5.253, 5.25, 5.12, 4.699, 4.8], bu: [151, 146, 150, 155, 151, 141], mu: [151, 146, 150, 155, 151, 140], w: 'http://ppmgsliven.com'};
s[470] = {l: 'СпУ Д. Рохов', n: 'Спортно у-ще Димитър Рохов', b: [3.745, 3.3, 3.66, 3.69, 2.86, 3.03], m: [3.575, 2.79, 3.61, 3.7, 3.765, 5.373], bu: [42, 21, 33, 32, 24, 36], mu: [7, 1, 1, 5, 22, 34], w: 'http://sportno-uchilishte.sliven.net'};
s[471] = {l: 'СУ Арг. Жечкова', n: 'СУ Аргира Жечкова', b: [null, 3.78, null, 3.82, 3.14, null], m: [null, null, null, null, 5.57, null], bu: [null, 1, null, 2, 1, null], mu: [null, null, null, null, 1, null], w: 'http://prisonschool-bg.org'};
s[472] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.642, 3.43, 3.62, 3.41, null, 3.56], m: [3.674, 3.519, 3.84, 3.93, null, 3.548], bu: [9, 21, 15, 19, null, 10], mu: [11, 22, 15, 18, null, 10], w: 'http://10sou.sliven.net'};
s[473] = {l: 'СУ К. Константинов', n: 'СУ Константин Константинов', b: [4.165, 2.59, null, null, 3.21, 3.23], m: [4.454, null, null, null, 5.05, 5.43], bu: [16, 1, null, null, 9, 18], mu: [15, null, null, null, 9, 16], w: 'http://kkonstantinov.com'};
s[474] = {l: 'СУ Мина Пашов', n: 'СУ Хаджи Мина Пашов', b: [3.432, 2.82, 2.4, 3.03, 2.0, 2.65], m: [3.601, null, null, 3.45, 2.0, 2.44], bu: [8, 2, 1, 1, 1, 11], mu: [7, null, null, 1, 1, 11], w: 'http://suhmpashov.com'};
s[475] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [3.917, 3.53, 3.77, 3.56, 3.08, 3.05], m: [3.881, 3.793, 3.81, 3.77, 3.188, 3.677], bu: [31, 24, 25, 50, 22, 32], mu: [30, 24, 25, 50, 21, 31], w: 'http://sou5sl.com'};
s[476] = {l: 'Худож. гимн.', n: 'Художествена гимназия Димитър Добрович', b: [4.354, 3.92, 4.53, 4.38, 4.1, 3.97], m: [4.026, 4.096, 3.4, 3.47, 5.18, 5.02], bu: [29, 25, 17, 25, 19, 23], mu: [11, 12, 2, 2, 19, 23], w: 'http://nhgdd-sliven.net'};
s[477] = {l: 'Хуманит. гимн.', n: 'Хуманитарна гимназия Дамян Дамянов', b: [4.458, 4.0, 4.47, 4.19, 4.02, 3.94], m: [4.688, 4.392, 4.83, 4.35, 4.306, 4.067], bu: [47, 42, 25, 21, 21, 24], mu: [47, 42, 25, 21, 21, 24], w: 'http://hg.sliven.net'};

// Смолян - индексация
si['Смолян'] = {n: [478, 485], p: null};
// Смолян - държавни училища
s[478] = {l: 'ЕГ Иван Вазов', n: 'ЕГ Иван Вазов', b: [5.105, 4.96, 5.06, 5.08, 4.61, 4.63], m: [5.365, 4.932, 5.19, 5.1, 4.702, 4.834], bu: [85, 75, 82, 95, 90, 76], mu: [85, 75, 82, 95, 90, 76], w: null};
s[479] = {l: 'ПГ за прил. изк.', n: 'ПГ за приложни изкуства', b: [4.025, 4.07, null, 3.89, 3.58, 3.17], m: [null, null, null, null, 4.21, 4.19], bu: [6, 6, null, 10, 11, 8], mu: [null, null, null, null, 11, 8], w: null};
s[480] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика', b: [4.074, 3.94, 4.14, 4.03, 3.5, 3.72], m: [3.982, 4.272, 4.4, 4.14, 4.38, 4.819], bu: [69, 65, 40, 81, 41, 52], mu: [62, 50, 30, 51, 39, 51], w: null};
s[481] = {l: 'ПГ по техника', n: 'ПГ по техника и технологии', b: [3.507, 3.49, 3.64, 3.4, 3.11, 3.43], m: [3.631, 3.507, 3.6, 3.01, 3.75, 4.136], bu: [51, 47, 36, 18, 42, 40], mu: [19, 23, 15, 2, 42, 36], w: null};
s[482] = {l: 'ПГ по туризъм', n: 'Смолянска ПГ по туризъм и строителство', b: [4.028, 3.64, 3.96, 3.79, 3.68, 3.27], m: [3.467, 3.577, 3.49, 3.95, 4.82, 4.3], bu: [26, 21, 28, 21, 19, 23], mu: [24, 8, 4, 2, 19, 23], w: null};
s[483] = {l: 'ППМГ', n: 'ППМГ Васил Левски', b: [5.016, 4.64, 5.09, 5.12, 4.87, 4.78], m: [5.29, 4.942, 5.16, 5.21, 4.739, 4.556], bu: [96, 93, 87, 94, 92, 76], mu: [96, 93, 87, 94, 92, 77], w: null};
s[484] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.555, 4.14, 4.65, 4.72, 4.33, 4.23], m: [4.659, 4.162, 4.72, 5.04, 4.584, 4.295], bu: [32, 31, 33, 28, 19, 28], mu: [32, 31, 33, 28, 19, 28], w: null};
s[485] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [4.215, 3.75, 4.08, null, 3.18, 3.05], m: [4.32, 4.282, 4.49, null, 3.466, null], bu: [11, 17, 19, null, 9, 1], mu: [11, 17, 18, null, 8, null], w: null};

// Стара Загора - индексация
si['Стара Загора'] = {n: [486, 504], p: null};
// Стара Загора - държавни училища
s[486] = {l: 'Вечерно СУ', n: 'Вечерно СУ Захари Стоянов', b: [3.629, 3.35, 3.59, 3.48, 2.0, 3.63], m: [3.532, 3.407, 3.73, 3.56, null, 2.89], bu: [27, 25, 27, 40, 3, 22], mu: [30, 24, 27, 41, null, 23], w: 'http://vsousz.org'};
s[487] = {l: 'ГПЧЕ Ромен Ролан', n: 'ГПЧЕ Ромен Ролан', b: [5.353, 5.28, 5.29, 5.24, 5.15, 4.97], m: [5.569, 5.227, 5.46, 5.34, 5.254, 5.299], bu: [239, 231, 228, 226, 221, 212], mu: [239, 231, 228, 226, 221, 214], w: 'http://www.romainrolland.org'};
s[488] = {l: 'НУМСИ', n: 'НУМСИ Христина Морфова', b: [4.578, 4.29, 4.05, 4.39, 4.09, 4.2], m: [4.024, 3.898, 4.12, 4.17, 4.61, 5.16], bu: [27, 27, 17, 14, 24, 17], mu: [14, 16, 11, 11, 24, 17], w: 'http://metronombg.com'};
s[489] = {l: 'ПГ по вет. медицина', n: 'Национална ПГ по ветеринарна медицина', b: [3.806, 3.77, 3.86, 3.82, 3.41, 3.34], m: [3.783, 4.013, 3.95, 3.75, 4.55, 4.95], bu: [138, 124, 114, 99, 75, 77], mu: [82, 76, 63, 38, 71, 69], w: 'http://pgvm-bg.com'};
s[490] = {l: 'ПГ по електроника', n: 'ПГ по електроника', b: [3.796, 3.5, 3.69, 3.59, 3.01, 3.26], m: [3.859, 3.658, 3.9, 4.15, 3.828, 4.313], bu: [101, 85, 58, 55, 61, 79], mu: [102, 88, 59, 55, 60, 66], w: 'http://pgeja-sz.com'};
s[491] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и технологии', b: [3.641, 3.45, 3.38, 3.45, 2.89, 2.78], m: [3.892, 3.75, 3.51, 3.66, 3.089, 4.235], bu: [74, 57, 45, 47, 29, 60], mu: [75, 56, 45, 45, 29, 59], w: 'http://pgetstz.eu'};
s[492] = {l: 'ПГ по механот.', n: 'ПГ по механотехника и транспорт', b: [3.544, 3.34, 3.19, 3.28, 2.66, 2.92], m: [3.394, 3.391, 3.21, 3.36, 3.84, 4.201], bu: [44, 49, 34, 23, 15, 24], mu: [45, 55, 34, 20, 13, 18], w: 'http://pgmttsz.com'};
s[493] = {l: 'ПГ по облекло', n: 'ПГ по облекло и хранене', b: [3.868, 3.66, 3.82, 3.63, 2.96, 3.08], m: [4.32, 3.658, 4.07, 3.87, 3.549, 4.137], bu: [101, 107, 61, 90, 53, 91], mu: [17, 25, 14, 8, 53, 89], w: 'http://pgohsz.com'};
s[494] = {l: 'ПГ по строит и дърв.', n: 'ПГ по строителство и дървообработване', b: [3.098, 2.97, 2.82, 3.15, 2.26, 2.46], m: [3.0, 2.77, 2.79, null, 3.51, 3.6], bu: [13, 19, 21, 10, 7, 6], mu: [5, 2, 1, null, 8, 7], w: 'http://pgsdsz.com'};
s[495] = {l: 'ПГ по строит., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [4.647, 4.38, 4.38, 4.42, 4.07, 4.16], m: [4.726, 4.173, 4.32, 4.47, 4.61, 5.601], bu: [126, 147, 144, 136, 144, 119], mu: [109, 125, 119, 92, 143, 121], w: 'http://pgsag-sz.org'};
s[496] = {l: 'ППМГ Гео Милев', n: 'ППМГ Гео Милев', b: [4.891, 4.87, 4.93, 4.82, 4.68, 4.64], m: [5.12, 4.844, 5.17, 4.95, 4.458, 4.467], bu: [125, 124, 123, 130, 118, 129], mu: [125, 124, 123, 130, 118, 131], w: 'http://site-chxtdpdgda-lm.a.run.app'};
s[497] = {l: 'СпУ Т. Каблешков', n: 'Спортно у-ще Тодор Каблешков', b: [3.642, 3.48, 3.29, 3.36, 2.97, 2.91], m: [3.191, 3.772, 3.49, 3.43, 4.73, 3.84], bu: [29, 47, 35, 27, 26, 52], mu: [7, 5, 7, 1, 25, 43], w: 'http://sportno-sz.com'};
s[498] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [4.09, 3.98, 4.05, 4.0, 3.49, 3.66], m: [4.344, 4.167, 4.27, 4.15, 2.909, 3.429], bu: [42, 42, 20, 41, 18, 16], mu: [42, 41, 18, 41, 18, 20], w: 'http://sou-vlevski-sz.org'};
s[499] = {l: 'СУ Железник', n: 'СУ Железник', b: [3.878, 2.26, 3.99, 3.57, 2.72, 2.0], m: [3.983, 2.639, 4.02, 3.82, 3.104, 2.0], bu: [25, 1, 7, 20, 12, 2], mu: [23, 2, 7, 21, 12, 1], w: 'http://jeleznik.org'};
s[500] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [4.038, 3.92, 3.88, 3.87, 3.49, 3.99], m: [4.126, 3.83, 4.04, 3.98, 3.14, 3.245], bu: [40, 43, 38, 19, 25, 25], mu: [41, 43, 38, 20, 23, 28], w: 'http://suvazov.bg'};
s[501] = {l: 'СУ Максим Горки', n: 'СУ Максим Горки', b: [4.697, 4.56, 4.66, 4.81, 4.49, 4.38], m: [4.778, 4.571, 4.9, 4.84, 4.792, 4.893], bu: [97, 95, 80, 79, 90, 105], mu: [97, 95, 80, 79, 91, 104], w: 'http://soumgsz.info'};
s[502] = {l: 'СУ Минчо Кънчев', n: 'СУ Поп Минчо Кънчев', b: [3.133, 2.74, 3.2, 3.03, 2.0, 3.37], m: [null, null, null, null, 2.91, 3.07], bu: [6, 5, 3, 4, 5, 2], mu: [null, null, null, null, 4, 5], w: 'http://soupmk.com'};
s[503] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [3.369, 3.19, 3.32, null, 2.49, 3.86], m: [3.088, 3.238, 3.29, 2.84, 2.42, 2.79], bu: [11, 12, 18, null, 6, 2], mu: [12, 13, 15, 1, 5, 2], w: 'http://souhrbsz.com'};
s[504] = {l: 'Търговска гимназия', n: 'Търговска гимназия Княз Симеон Търновски', b: [5.095, 4.97, 4.98, 4.89, 4.49, 4.46], m: [5.016, 4.606, 4.64, 4.65, 4.748, 5.67], bu: [130, 131, 150, 128, 122, 129], mu: [96, 78, 98, 68, 120, 131], w: 'http://tgstz.bg'};

// Търговище - индексация
si['Търговище'] = {n: [505, 513], p: null};
// Търговище - държавни училища
s[505] = {l: '1 СУ', n: '1 СУ Свети Седмочисленици', b: [4.921, 4.76, 4.8, 4.87, 4.48, 4.35], m: [5.423, 5.048, 5.24, 5.2, 4.692, 4.387], bu: [83, 80, 97, 68, 93, 101], mu: [83, 80, 97, 68, 93, 101], w: null};
s[506] = {l: '2 СУ', n: '2 СУ Проф. Никола Маринов', b: [4.604, 4.46, 4.44, 4.46, 4.48, 4.29], m: [4.871, 4.535, 4.51, 4.76, 4.25, 4.301], bu: [86, 102, 72, 73, 84, 85], mu: [87, 102, 72, 73, 83, 87], w: null};
s[507] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и строителство', b: [3.2, 3.35, 3.07, 3.1, 2.49, 2.48], m: [4.342, 3.453, 3.54, null, 4.76, 3.511], bu: [10, 23, 19, 12, 7, 8], mu: [7, 12, 10, null, 5, 5], w: null};
s[508] = {l: 'ПГ по земеделие', n: 'ПГ по земеделие', b: [3.316, 3.03, 2.81, 3.25, 2.45, 2.73], m: [2.984, 3.243, 2.99, 3.35, 4.438, 4.272], bu: [31, 23, 39, 10, 8, 8], mu: [7, 3, 3, 3, 5, 15], w: null};
s[509] = {l: 'ПГ по икон. инф.', n: 'ПГ по икономическа информатика', b: [4.148, 3.9, 3.89, 3.75, 3.4, 3.32], m: [3.838, 4.172, 4.04, 4.25, 4.784, 4.58], bu: [55, 72, 73, 71, 62, 94], mu: [25, 12, 5, 12, 62, 82], w: null};
s[510] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм и хран.-вкусови технологии', b: [3.697, 3.48, 3.54, 3.36, 2.56, 2.99], m: [3.682, 3.572, 3.66, 3.55, 3.4, 3.07], bu: [61, 58, 26, 30, 27, 23], mu: [28, 32, 14, 16, 25, 24], w: null};
s[511] = {l: 'Спортно у-ще', n: 'Спортно училище Никола Симов', b: [3.663, 3.67, 3.14, 3.08, 2.59, 3.36], m: [3.937, 3.711, 3.29, 3.48, 3.44, 4.58], bu: [28, 16, 11, 13, 10, 12], mu: [31, 17, 13, 12, 9, 11], w: null};
s[512] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [3.627, 3.52, 3.62, 3.58, 3.25, 3.05], m: [3.904, 3.944, 4.21, 3.91, 4.832, 4.6], bu: [43, 65, 64, 44, 56, 48], mu: [37, 59, 52, 29, 53, 41], w: null};
s[513] = {l: 'У-ще за уч. с увр. слух', n: 'Специално у-ще за ученици с увреден слух', b: [3.016, null, 3.16, 3.01, 2.55, null], m: [null, null, null, null, 4.77, null], bu: [3, null, 6, 3, 6, null], mu: [null, null, null, null, 6, null], w: null};

// Хасково - индексация
si['Хасково'] = {n: [514, 524], p: null};
// Хасково - държавни училища
s[514] = {l: 'ЕГ', n: 'ЕГ Проф. д-р Асен Златаров', b: [5.077, 4.89, 5.05, 4.93, 4.65, 4.68], m: [5.4, 4.86, 5.25, 5.07, 4.994, 5.063], bu: [181, 174, 167, 178, 181, 180], mu: [181, 173, 167, 179, 180, 181], w: 'http://eghaskovo.org'};
s[515] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване и строителство', b: [3.84, 3.68, 3.63, 3.72, 3.46, 3.58], m: [4.127, 3.734, 4.14, 4.07, 4.71, 4.476], bu: [114, 130, 122, 127, 104, 108], mu: [116, 111, 82, 35, 101, 103], w: 'http://pgds.org'};
s[516] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост Райна Княгиня', b: [3.12, 3.05, 3.26, 2.93, 2.38, 2.44], m: [3.028, 3.087, 3.34, 2.96, 3.52, 3.917], bu: [27, 41, 18, 19, 15, 8], mu: [26, 30, 16, 16, 11, 8], w: 'http://pglp.bg'};
s[517] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.305, 3.1, 3.2, 3.02, 2.33, 2.64], m: [3.482, 3.345, 3.48, 3.25, 2.37, 4.81], bu: [56, 59, 51, 40, 53, 55], mu: [18, 12, 10, 20, 57, 43], w: 'http://pgmethaskovo.com'};
s[518] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт и аграрни технологии', b: [3.146, 2.95, 3.08, 3.12, 2.19, 2.36], m: [2.865, 2.929, 3.07, 2.66, 2.88, 4.394], bu: [36, 44, 45, 33, 28, 25], mu: [2, 8, 13, 1, 26, 20], w: 'http://pgtathaskovo.com'};
s[519] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Александър Паскалев', b: [3.588, 3.4, 3.48, 3.24, 2.87, 3.24], m: [3.59, 3.461, 3.57, 3.4, 4.893, 4.78], bu: [144, 129, 101, 77, 109, 63], mu: [133, 102, 73, 19, 95, 49], w: 'http://pgthas.com'};
s[520] = {l: 'ПМГ', n: 'ПМГ Акад. Боян Петканчин', b: [5.169, 4.8, 5.21, 5.13, 4.83, 4.84], m: [5.227, 4.876, 4.97, 4.95, 4.381, 4.58], bu: [127, 119, 127, 127, 126, 129], mu: [128, 119, 127, 127, 126, 135], w: 'http://pmg-haskovo.org'};
s[521] = {l: 'СпУ Ст. Караджа', n: 'Спортно у-ще Стефан Караджа', b: [3.14, 3.03, 3.04, 3.12, 2.62, 2.27], m: [3.438, 3.239, 3.32, 3.18, 3.371, 4.24], bu: [38, 44, 22, 29, 19, 15], mu: [37, 44, 19, 31, 14, 12], w: 'http://sportno-haskovo.com'};
s[522] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [3.77, 3.57, 3.66, 3.72, 3.08, 2.97], m: [4.47, 4.095, 4.14, 4.25, 3.118, 3.153], bu: [2, 16, 22, 22, 21, 13], mu: [2, 14, 21, 23, 20, 13], w: 'http://soulevski-hs.com'};
s[523] = {l: 'СУ П. Хилендарски', n: 'СУ Св. Паисий Хилендарски', b: [3.94, 3.63, 3.51, 3.49, 3.54, 2.0], m: [4.221, 3.707, 3.78, 3.48, 3.08, 5.22], bu: [14, 30, 12, 16, 13, 1], mu: [13, 31, 13, 17, 12, 1], w: 'http://sou-paisiy.com'};
s[524] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска гимназия Атанас Буров', b: [4.251, 3.97, 4.0, 3.69, 3.55, 3.48], m: [4.35, 4.163, 3.97, 4.17, 5.28, 5.25], bu: [150, 127, 138, 117, 124, 133], mu: [85, 76, 45, 24, 124, 125], w: 'http://fsghs.org'};

// Шумен - индексация
si['Шумен'] = {n: [525, 537], p: null};
// Шумен - държавни училища
s[525] = {l: 'Духовно училище', n: 'Духовно училище Нювваб', b: [3.947, 3.59, 3.56, 3.67, 2.51, 2.63], m: [3.846, 4.01, 3.97, 4.14, 2.832, 2.617], bu: [18, 21, 21, 28, 22, 26], mu: [19, 21, 21, 27, 22, 26], w: 'http://nuvvab.net'};
s[526] = {l: 'ЕГ Н. Вапцаров', n: 'ЕГ Никола Йонков Вапцаров', b: [5.007, 4.79, 4.96, 4.86, 4.53, 4.13], m: [5.433, 4.794, 5.2, 5.0, 4.833, 4.426], bu: [150, 143, 116, 117, 129, 148], mu: [150, 143, 116, 117, 129, 149], w: 'http://peg-shumen.bg'};
s[527] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [4.176, 3.92, 4.08, 3.97, 3.59, 3.49], m: [4.165, 4.052, 4.18, 4.12, 4.86, 4.93], bu: [125, 140, 121, 138, 95, 103], mu: [112, 128, 119, 137, 93, 99], w: 'http://pgishumen.bg'};
s[528] = {l: 'ПГ по механот.', n: 'ПГ по механот., електр., телеком. и транспорт', b: [3.471, 3.48, 3.33, 3.5, 2.69, 2.77], m: [3.606, 3.462, 3.57, 3.85, 3.733, 4.03], bu: [82, 70, 63, 59, 60, 91], mu: [90, 67, 64, 47, 57, 76], w: 'http://pgmett.shumen.icon.bg'};
s[529] = {l: 'ПГ по облекло', n: 'ПГ по облекло, хранене и химични технологии', b: [3.553, 3.35, 3.53, 3.64, 2.68, 2.67], m: [3.645, 3.434, 3.64, 3.55, 4.532, 4.031], bu: [51, 43, 73, 47, 41, 59], mu: [46, 22, 51, 18, 39, 56], w: 'http://pgohht-zlatarov.com'};
s[530] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.156, 3.04, 3.03, 3.14, 2.4, 2.29], m: [3.448, 3.35, 3.35, 3.5, 4.72, 4.38], bu: [34, 38, 31, 20, 29, 33], mu: [29, 36, 24, 21, 25, 17], w: 'http://pgssht.weebly.com'};
s[531] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и геодезия', b: [3.471, 3.37, 3.38, 3.23, 3.08, 2.71], m: [3.618, 3.616, 3.66, 3.63, 4.663, 4.596], bu: [101, 91, 77, 81, 52, 59], mu: [81, 75, 54, 58, 45, 49], w: 'http://www.stroitech.ro-ni.net'};
s[532] = {l: 'ППМГ', n: 'ППМГ Нанчо Попович', b: [4.904, 4.82, 5.1, 4.8, 4.82, 4.84], m: [5.461, 4.959, 5.18, 5.09, 4.343, 4.747], bu: [127, 129, 129, 128, 131, 127], mu: [127, 129, 129, 128, 131, 128], w: 'http://ppmgshumen.bg'};
s[533] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [3.66, 3.2, 3.62, 3.35, 3.36, 3.09], m: [4.111, 3.779, 3.96, 4.25, 2.951, 3.166], bu: [38, 37, 35, 12, 29, 17], mu: [36, 36, 32, 9, 26, 17], w: 'http://souvl.com'};
s[534] = {l: 'СУ Йоан Екзарх', n: 'СУ Йоан Екзарх Български', b: [4.305, 4.28, 4.51, 4.28, 4.14, 4.04], m: [4.509, 4.237, 4.43, 4.48, 3.752, 4.165], bu: [68, 73, 59, 97, 63, 57], mu: [68, 73, 60, 97, 63, 58], w: 'http://suyeb.com'};
s[535] = {l: 'СУ Панайот Волов', n: 'СУ Панайот Волов', b: [4.279, 3.86, 4.09, 3.66, 4.22, 3.5], m: [4.432, 3.957, 4.25, 4.07, 3.714, 3.81], bu: [60, 60, 64, 51, 37, 65], mu: [60, 60, 64, 51, 38, 68], w: 'http://volov.iservice.bg'};
s[536] = {l: 'СУ С. Доброплодни', n: 'СУ Сава Доброплодни', b: [4.418, 4.3, 4.34, 4.75, 4.24, 4.29], m: [4.835, 4.552, 4.43, 4.82, 4.712, 4.758], bu: [99, 85, 89, 90, 91, 75], mu: [99, 86, 89, 90, 91, 75], w: 'http://suizku.com'};
s[537] = {l: 'СУ Трайко Симеонов', n: 'СУ Трайко Симеонов', b: [3.496, 3.29, 3.29, 3.38, 2.14, 2.4], m: [3.655, 3.735, 3.71, 4.27, 2.3, 2.47], bu: [10, 18, 8, 8, 10, 7], mu: [12, 18, 8, 7, 8, 7], w: 'http://school-ts.com'};

// Ямбол - индексация
si['Ямбол'] = {n: [538, 549], p: null};
// Ямбол - държавни училища
s[538] = {l: 'Гимназия по строит.', n: 'Гимназия по строителство и архитектура', b: [3.28, 3.33, 3.37, 3.5, 3.07, 3.9], m: [2.964, 2.917, 4.08, 3.61, 4.61, 4.94], bu: [57, 38, 19, 20, 25, 49], mu: [19, 13, 4, 12, 23, 47], w: null};
s[539] = {l: 'ЕГ В. Карагьозов', n: 'ЕГ Васил Карагьозов', b: [4.737, 4.45, 4.81, 4.79, 4.51, 4.39], m: [5.169, 4.513, 4.9, 5.11, 4.307, 4.542], bu: [68, 72, 47, 43, 68, 54], mu: [68, 72, 47, 43, 68, 55], w: null};
s[540] = {l: 'ПГ Васил Левски', n: 'ПГ Васил Левски', b: [4.506, 4.54, 4.78, 4.73, 4.37, 4.23], m: [4.975, 4.732, 4.86, 4.84, 4.269, 4.015], bu: [107, 89, 97, 78, 93, 101], mu: [109, 89, 97, 78, 93, 101], w: null};
s[541] = {l: 'ПГ по земеделие', n: 'ПГ по земеделие Христо Ботев', b: [3.01, 2.94, 2.85, 3.01, 2.2, 3.24], m: [2.791, 2.746, 2.82, 3.09, 4.31, 4.606], bu: [51, 44, 37, 34, 19, 7], mu: [10, 6, 2, 5, 19, 6], w: null};
s[542] = {l: 'ПГ по икономика', n: 'ПГ по икономика Георги Стойков Раковски', b: [4.382, 3.8, 3.98, 3.97, 3.43, 3.52], m: [4.962, 4.454, 4.58, 4.82, 4.8, 4.94], bu: [125, 96, 93, 74, 63, 49], mu: [21, 21, 13, 3, 63, 42], w: null};
s[543] = {l: 'ПГ по лека пром.', n: 'ПГ по лека пром., екология и хим. технологии', b: [3.049, 2.99, 3.74, 3.35, 2.37, 2.3], m: [2.98, 2.61, null, null, 4.4, 3.694], bu: [35, 46, 17, 31, 15, 31], mu: [2, 4, null, null, 25, 36], w: null};
s[544] = {l: 'ПГ по подемна техн.', n: 'ПГ по подемна, строителна и транспортна техника', b: [2.939, 2.75, 2.87, 2.85, 2.9, 3.04], m: [2.923, 2.592, 2.37, 2.7, 4.55, 4.063], bu: [71, 51, 38, 51, 12, 13], mu: [13, 5, 1, 1, 10, 19], w: null};
s[545] = {l: 'ПГ по хранит. техн.', n: 'ПГ по хранителни технологии и туризъм', b: [3.56, 3.44, 3.39, 3.31, 3.38, 2.82], m: [3.623, 2.97, 3.03, 2.98, 4.483, 4.455], bu: [38, 44, 38, 27, 24, 19], mu: [3, 1, 1, 2, 23, 20], w: null};
s[546] = {l: 'ПМГ', n: 'ПМГ Атанас Радев', b: [5.197, 4.91, 5.08, 4.89, 4.78, 4.6], m: [5.542, 5.203, 5.19, 5.03, 4.503, 4.581], bu: [90, 91, 85, 87, 82, 96], mu: [90, 91, 85, 87, 82, 98], w: null};
s[547] = {l: 'Спортно у-ще', n: 'Спортно у-ще Пиер дьо Кубертен', b: [3.69, 3.49, 3.87, 3.87, 3.67, 2.66], m: [3.271, 3.718, 2.68, 5.92, 4.7, 3.95], bu: [12, 15, 13, 11, 8, 8], mu: [12, 5, 2, 1, 6, 8], w: null};
s[548] = {l: 'СУ Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.062, 3.71, 3.98, 3.86, 3.15, 3.3], m: [3.965, 3.942, 4.28, 4.07, 3.598, 3.397], bu: [38, 58, 47, 59, 41, 39], mu: [40, 59, 47, 57, 37, 34], w: null};
s[549] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия Иван Райнов', b: [3.696, 3.57, 3.62, 3.59, 3.17, 3.26], m: [3.918, 3.607, 4.18, 3.6, 3.85, 3.979], bu: [90, 76, 56, 89, 43, 42], mu: [34, 20, 8, 9, 40, 43], w: null};

// Айтос - индексация
si['Айтос'] = {n: [550, 552], p: null};
// Айтос - държавни училища
s[550] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.098, 2.91, 2.9, 2.88, 2.44, 2.36], m: [3.26, 3.341, 3.36, 3.3, 4.38, 3.42], bu: [116, 65, 41, 49, 45, 47], mu: [91, 51, 28, 38, 27, 30], w: null};
s[551] = {l: 'СУ Н. Вапцаров', n: 'СУ Никола Вапцаров', b: [3.937, 3.71, 3.69, 3.76, 3.67, 3.48], m: [4.288, 4.116, 4.05, 4.17, 4.294, 3.751], bu: [57, 52, 50, 48, 53, 77], mu: [59, 53, 51, 47, 53, 70], w: null};
s[552] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.363, 4.11, 4.21, 4.22, 3.95, 3.84], m: [4.854, 4.399, 4.43, 4.55, 4.157, 3.967], bu: [77, 67, 69, 77, 74, 57], mu: [73, 68, 68, 75, 74, 55], w: null};

// Асеновград - индексация
si['Асеновград'] = {n: [553, 557], p: null};
// Асеновград - държавни училища
s[553] = {l: 'ПГ Иван Асен II', n: 'ПГ Цар Иван Асен II', b: [3.7, 3.34, 3.38, 3.46, 3.12, 2.96], m: [3.581, 3.456, 3.39, 3.71, 4.71, 4.77], bu: [87, 103, 86, 84, 69, 104], mu: [87, 108, 86, 76, 58, 86], w: null};
s[554] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хранително-вкусови технологии', b: [3.46, 3.29, 3.52, 3.21, 2.57, 2.51], m: [3.102, 3.206, 3.44, 3.24, 3.78, 3.59], bu: [66, 72, 43, 27, 23, 27], mu: [20, 47, 16, 27, 22, 26], w: null};
s[555] = {l: 'ПГ Св. П. Евтимий', n: 'ПГ Св. Патриарх Евтимий', b: [3.256, 2.99, 3.07, 2.66, 2.28, 2.41], m: [3.003, 2.84, 2.62, 2.94, 2.96, 2.988], bu: [16, 35, 27, 13, 13, 11], mu: [3, 2, 2, 6, 14, 10], w: null};
s[556] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.448, 4.2, 4.15, 4.23, 4.07, 3.68], m: [4.448, 4.329, 4.37, 4.34, 3.666, 3.68], bu: [112, 99, 115, 119, 93, 100], mu: [111, 99, 115, 119, 93, 108], w: null};
s[557] = {l: 'СУ Княз Борис И', n: 'СУ Св. Княз Борис I', b: [4.614, 4.73, 4.47, 4.73, 4.36, 4.06], m: [4.664, 4.431, 4.58, 5.1, 4.103, 4.118], bu: [61, 68, 70, 43, 69, 78], mu: [61, 68, 70, 43, 69, 78], w: null};

// Балчик - индексация
si['Балчик'] = {n: [558, 558], p: null};
// Балчик - държавни училища
s[558] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [3.946, 3.82, 4.0, 4.21, 3.38, 3.63], m: [4.662, 4.17, 4.15, 4.37, 3.348, 3.217], bu: [45, 48, 37, 38, 31, 43], mu: [31, 34, 38, 37, 31, 45], w: null};

// Банкя - индексация
si['Банкя'] = {n: [559, 560], p: null};
// Банкя - държавни училища
s[559] = {l: '78 СУ', n: '78 СУ Христо Смирненски', b: [3.809, 3.66, 3.64, 3.83, 3.51, 3.15], m: [4.008, 3.787, 3.73, 4.28, 3.217, 3.22], bu: [35, 30, 31, 19, 31, 15], mu: [36, 29, 31, 18, 30, 15], w: 'http://78su.net'};
s[560] = {l: 'ПГТ - Банкя', n: 'ПГ по туризъм А. Константинов', b: [3.771, 3.54, 3.65, 3.71, 3.13, 3.12], m: [4.083, 3.767, 4.3, 4.38, 4.374, 4.801], bu: [137, 121, 83, 91, 78, 86], mu: [115, 64, 24, 9, 75, 73], w: 'http://pgtbankya.com'};

// Берковица - индексация
si['Берковица'] = {n: [561, 562], p: null};
// Берковица - държавни училища
s[561] = {l: 'Лесотехн. ПГ', n: 'Лесотехническа ПГ', b: [3.814, 3.82, 3.82, 3.74, 2.88, 3.14], m: [3.68, 4.001, 3.75, 4.21, 2.902, 4.126], bu: [27, 33, 33, 28, 26, 31], mu: [31, 36, 31, 24, 27, 33], w: null};
s[562] = {l: 'ПГ Иван Панов', n: 'ПГ Д-р Иван Панов', b: [4.588, 4.11, 4.46, 3.9, 3.93, 4.13], m: [4.632, 4.317, 4.35, 4.35, 4.082, 3.479], bu: [31, 26, 27, 43, 30, 21], mu: [24, 22, 25, 29, 27, 20], w: null};

// Ботевград - индексация
si['Ботевград'] = {n: [563, 565], p: null};
// Ботевград - държавни училища
s[563] = {l: 'ПГ по техника', n: 'ПГ по техника и мениджмънт', b: [3.415, 3.21, 3.29, 3.17, 2.51, 2.64], m: [3.513, 3.27, 3.37, 3.32, 3.482, 4.227], bu: [70, 67, 70, 54, 75, 66], mu: [63, 48, 56, 19, 54, 45], w: null};
s[564] = {l: 'ППМГ', n: 'ППМГ Акад. проф. д-р Асен Златаров', b: [4.622, 4.37, 4.66, 4.68, 4.56, 4.04], m: [4.833, 4.502, 4.71, 4.84, 4.8, 4.149], bu: [86, 89, 90, 79, 93, 98], mu: [86, 88, 90, 79, 93, 99], w: null};
s[565] = {l: 'Техническа ПГ', n: 'Техническа ПГ Стамен Панчев', b: [3.187, 3.05, 3.03, 3.14, 2.12, 3.0], m: [2.575, 2.69, 3.76, 3.28, 3.37, 4.74], bu: [27, 32, 33, 22, 28, 1], mu: [4, 2, 2, 7, 17, 1], w: null};

// Велинград - индексация
si['Велинград'] = {n: [566, 570], p: null};
// Велинград - държавни училища
s[566] = {l: 'НПГ по горско стоп.', n: 'Национална ПГ по горско стопанство', b: [3.8, 3.47, 3.73, 3.62, 3.42, 3.18], m: [3.955, 3.997, 3.8, 3.86, 3.55, 4.092], bu: [65, 40, 48, 38, 38, 39], mu: [49, 27, 26, 6, 37, 40], w: null};
s[567] = {l: 'ОУ Неофит Рилски', n: 'ОУ Неофит Рилски', b: [2.993, 2.87, 2.8, 3.31, 2.44, 2.3], m: [3.128, 3.058, 3.06, null, 3.917, 3.878], bu: [94, 70, 54, 49, 38, 44], mu: [67, 59, 44, null, 28, 27], w: null};
s[568] = {l: 'ПГ по иконом. и тур.', n: 'ПГ по икономика и туризъм', b: [3.906, 3.42, 3.61, 3.61, 3.48, 3.41], m: [2.98, 3.258, 3.94, 3.66, 4.206, 4.443], bu: [124, 113, 110, 85, 58, 80], mu: [18, 31, 9, 9, 57, 74], w: null};
s[569] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [4.779, 4.92, 4.73, 4.81, 4.49, 4.08], m: [5.104, 4.751, 5.05, 5.2, 4.432, 4.436], bu: [54, 43, 41, 42, 34, 48], mu: [54, 43, 41, 42, 33, 49], w: null};
s[570] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.606, 4.64, 4.87, 4.7, 4.76, 4.31], m: [4.62, 4.311, 4.62, 4.79, 4.484, 4.25], bu: [73, 63, 58, 68, 75, 60], mu: [73, 64, 58, 69, 75, 61], w: null};

// Горна Оряховица - индексация
si['Горна Оряховица'] = {n: [571, 577], p: null};
// Горна Оряховица - държавни училища
s[571] = {l: 'ПГ по електрот. и електрон.', n: 'ПГ по електротехника и електроника', b: [4.151, 3.88, 4.1, 3.9, 3.55, 3.58], m: [4.467, 4.17, 4.57, 4.61, 4.474, 4.77], bu: [87, 88, 74, 77, 74, 95], mu: [79, 73, 68, 66, 73, 93], w: null};
s[572] = {l: 'ПГ по ЖП транспорт', n: 'ПГ по железопътен транспорт', b: [3.404, 3.1, 3.12, 3.2, 2.73, 2.46], m: [3.138, 3.02, 2.76, 3.85, 3.01, 2.9], bu: [10, 19, 8, 13, 16, 10], mu: [12, 14, 2, 2, 15, 6], w: null};
s[573] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост и икономика', b: [4.011, 3.64, 3.97, 3.65, 3.09, 2.97], m: [2.923, 3.196, null, 3.94, 4.551, 5.36], bu: [100, 72, 78, 72, 55, 53], mu: [3, 3, null, 2, 53, 35], w: null};
s[574] = {l: 'ПГ по хранит. техн.', n: 'ПГ по хранителни технологии', b: [3.218, 3.1, 3.13, 2.94, 2.27, 2.73], m: [3.197, 3.152, 3.1, 2.92, 4.696, 4.84], bu: [61, 51, 27, 29, 28, 12], mu: [62, 60, 29, 25, 27, 20], w: null};
s[575] = {l: 'ПТГ В. Левски', n: 'ПТГ Васил Левски', b: [3.441, 3.36, 2.99, 3.07, 2.54, 2.58], m: [3.505, 3.498, 3.16, 3.21, 3.06, 3.15], bu: [17, 20, 15, 8, 12, 20], mu: [17, 20, 15, 6, 14, 15], w: null};
s[576] = {l: 'СУ В. Грънчаров', n: 'СУ Вичо Грънчаров', b: [4.174, 4.46, 4.62, 4.38, 4.12, 3.42], m: [4.582, 4.745, 4.93, 4.72, 3.959, 3.225], bu: [24, 31, 16, 26, 23, 22], mu: [24, 32, 16, 26, 23, 21], w: null};
s[577] = {l: 'СУ Г. Измирлиев', n: 'СУ Георги Измирлиев', b: [4.51, 4.24, 4.55, 4.56, 4.18, 3.89], m: [4.843, 4.246, 4.61, 4.9, 4.108, 3.979], bu: [42, 49, 27, 46, 47, 52], mu: [43, 48, 27, 46, 47, 51], w: null};

// Гоце Делчев - индексация
si['Гоце Делчев'] = {n: [578, 580], p: null};
// Гоце Делчев - държавни училища
s[578] = {l: 'Неврокопска ПГ', n: 'Неврокопска ПГ Димитър Талев', b: [3.972, 3.93, 4.07, 4.09, 3.74, 3.68], m: [3.871, 3.514, 4.59, 4.07, 4.76, 4.986], bu: [163, 158, 140, 142, 148, 170], mu: [26, 43, 3, 17, 141, 164], w: null};
s[579] = {l: 'ПГ по механизация', n: 'ПГ по мхан. на селското стоп.', b: [3.197, 3.02, 3.23, 3.25, 2.52, 3.8], m: [3.31, 3.057, 4.06, 2.68, 4.32, 5.437], bu: [45, 38, 34, 78, 37, 35], mu: [23, 4, 2, 4, 34, 35], w: null};
s[580] = {l: 'ПМГ Яне Сандански', n: 'ПМГ Яне Сандански', b: [4.897, 4.77, 5.06, 4.75, 4.48, 4.55], m: [5.031, 5.003, 5.18, 4.98, 4.273, 4.542], bu: [148, 145, 143, 107, 127, 131], mu: [148, 146, 143, 107, 127, 140], w: null};

// Димитровград - индексация
si['Димитровград'] = {n: [581, 584], p: null};
// Димитровград - държавни училища
s[581] = {l: 'ЕГ И. Богоров', n: 'Профилирана ЕГ Д-р Иван Богоров', b: [4.406, 4.46, 4.54, 4.44, 4.22, 4.03], m: [4.895, 4.588, 4.78, 4.85, 4.351, 3.86], bu: [74, 54, 72, 54, 76, 66], mu: [74, 54, 71, 54, 76, 68], w: null};
s[582] = {l: 'ПГ А. Златаров', n: 'ПГ Проф. д-р Асен Златаров', b: [3.484, 3.3, 3.33, 3.33, 2.61, 2.9], m: [3.446, 3.325, 3.37, 3.29, 3.645, 4.18], bu: [50, 40, 43, 31, 33, 31], mu: [38, 33, 16, 17, 20, 35], w: null};
s[583] = {l: 'ПМГЗИЧЕ', n: 'ПМГ със ЗИЧЕ Иван Вазов', b: [4.601, 4.67, 4.98, 4.64, 4.2, 4.32], m: [5.131, 4.947, 5.1, 4.93, 4.079, 4.349], bu: [67, 72, 70, 68, 94, 95], mu: [68, 72, 70, 68, 94, 95], w: null};
s[584] = {l: 'СУ Л. Каравелов', n: 'СУ Любен Каравелов', b: [3.832, 3.44, 3.48, 3.3, 2.77, 3.06], m: [4.046, 3.409, 3.66, 3.69, 2.636, 3.325], bu: [44, 67, 48, 50, 30, 50], mu: [42, 72, 48, 48, 21, 45], w: null};

// Дупница - индексация
si['Дупница'] = {n: [585, 590], p: null};
// Дупница - държавни училища
s[585] = {l: 'ПГ по облекло', n: 'ПГ по облекло и стоп. упр.', b: [3.745, 3.31, 3.67, 3.36, 2.93, 3.08], m: [3.623, 3.536, 3.88, 3.57, 3.91, 4.82], bu: [49, 52, 48, 38, 28, 41], mu: [48, 52, 49, 34, 27, 37], w: null};
s[586] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.212, 3.14, 2.74, 3.13, 2.38, 2.37], m: [3.291, 2.974, 2.99, 3.32, 3.68, 3.82], bu: [16, 17, 13, 11, 9, 8], mu: [14, 14, 13, 4, 6, 7], w: null};
s[587] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хранително-вкусови технологии', b: [3.992, 3.55, 3.59, 3.67, 2.92, 2.68], m: [4.091, 3.78, 3.86, 3.82, 4.35, 4.408], bu: [49, 47, 40, 37, 26, 46], mu: [39, 41, 23, 24, 25, 47], w: null};
s[588] = {l: 'ПГ С. Королоьов', n: 'ПГ Акад. Сергей П. Корольов', b: [3.921, 3.39, 3.48, 3.34, 3.05, 2.77], m: [3.876, 3.471, 3.49, 3.59, 4.166, 4.248], bu: [83, 75, 50, 58, 23, 56], mu: [78, 52, 43, 43, 23, 46], w: null};
s[589] = {l: 'ПГ Христо Ботев', n: 'ПГ Христо Ботев', b: [4.951, 4.55, 4.64, 4.79, 4.3, 4.33], m: [4.958, 4.478, 4.65, 4.88, 4.097, 4.169], bu: [110, 136, 118, 124, 122, 135], mu: [110, 140, 117, 123, 123, 134], w: null};
s[590] = {l: 'СЕУ П. Хилендарски', n: 'СЕУ Св. Паисий Хилендарски', b: [4.843, 4.49, 4.57, 4.6, 4.27, 4.35], m: [4.834, 4.67, 4.97, 4.99, 4.564, 4.823], bu: [50, 45, 25, 51, 43, 48], mu: [49, 45, 25, 51, 43, 48], w: null};

// Ихтиман - индексация
si['Ихтиман'] = {n: [591, 592], p: null};
// Ихтиман - държавни училища
s[591] = {l: 'ПГ Васил Левски', n: 'ПГ Васил Левски', b: [2.911, 2.71, 2.69, 2.72, 2.1, 2.05], m: [2.939, 2.868, 2.78, 2.98, 2.72, 3.5], bu: [47, 36, 43, 30, 39, 28], mu: [42, 26, 9, 3, 29, 16], w: null};
s[592] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.482, 4.07, 3.82, 3.87, 3.67, 3.19], m: [4.578, 4.436, 3.68, 4.38, 3.663, 3.972], bu: [28, 44, 39, 54, 58, 48], mu: [32, 42, 42, 48, 50, 46], w: null};

// Каварна - индексация
si['Каварна'] = {n: [593, 594], p: null};
// Каварна - държавни училища
s[593] = {l: 'Земеделска гимн.', n: 'Професионална земеделска гимназия', b: [3.363, 3.25, 3.17, 3.13, 2.95, 2.4], m: [4.357, 2.639, null, 4.89, 4.221, 4.265], bu: [25, 26, 12, 22, 20, 22], mu: [4, 2, null, 2, 17, 14], w: null};
s[594] = {l: 'СУ Стефан Караджа', n: 'СУ Стефан Караджа', b: [4.345, 3.93, 4.3, 3.84, 3.9, 3.7], m: [4.77, 3.997, 4.17, 4.0, 3.85, 3.847], bu: [64, 51, 33, 38, 39, 47], mu: [64, 52, 37, 38, 36, 49], w: null};

// Казанлък - индексация
si['Казанлък'] = {n: [595, 602], p: null};
// Казанлък - държавни училища
s[595] = {l: 'НУПИД А. Узунов', n: 'НУ по пласт. изк. и дизайн', b: [4.073, 4.37, 4.3, 4.2, 4.09, 4.09], m: [null, null, null, null, 5.15, 5.09], bu: [52, 43, 45, 50, 42, 46], mu: [null, null, null, null, 42, 46], w: null};
s[596] = {l: 'ПГ Иван Хаджиенов', n: 'ПГ Иван Хаджиенов', b: [3.819, 3.54, 3.73, 3.7, 3.62, 3.19], m: [3.825, 3.464, 3.65, 3.79, 4.556, 3.395], bu: [91, 75, 85, 71, 64, 89], mu: [94, 79, 91, 78, 63, 89], w: null};
s[597] = {l: 'ПГ П. Стайнов', n: 'ПГ Акад. Петко Стайнов', b: [3.245, 3.4, 3.14, 3.15, 3.02, 2.76], m: [3.598, 3.493, 3.17, 3.31, 2.796, 4.713], bu: [17, 7, 9, 11, 5, 3], mu: [6, 6, 4, 6, 3, 3], w: null};
s[598] = {l: 'ПГ по лека пром.', n: 'ПГ по лека пром. и туризъм', b: [3.825, 3.8, 3.67, 3.55, 3.42, 2.97], m: [3.962, 3.771, 3.71, 3.54, 4.282, 4.34], bu: [77, 67, 85, 65, 58, 45], mu: [55, 35, 60, 53, 55, 34], w: null};
s[599] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт и мениджмънт', b: [3.657, 3.48, 3.55, 3.42, 3.07, 2.6], m: [3.768, 3.753, 3.66, 3.61, 4.09, 4.68], bu: [91, 89, 74, 81, 32, 43], mu: [76, 56, 49, 47, 32, 25], w: null};
s[600] = {l: 'ППМГ', n: 'ППМГ Никола Обрешков', b: [5.13, 4.8, 5.18, 4.87, 4.93, 4.76], m: [5.45, 5.037, 5.25, 5.07, 4.439, 3.73], bu: [103, 103, 103, 101, 97, 103], mu: [103, 103, 103, 101, 96, 109], w: null};
s[601] = {l: 'ПХГ Кирил и Методий', n: 'ПХГ Св. Св. Кирил и Методий', b: [4.481, 4.05, 4.55, 4.17, 3.97, 3.88], m: [4.579, 4.415, 4.59, 4.48, 4.031, 4.079], bu: [75, 62, 77, 62, 44, 48], mu: [76, 63, 77, 62, 39, 44], w: null};
s[602] = {l: 'СУ Антим I', n: 'СУ Екзарх Антим I', b: [4.532, 4.37, 4.37, 4.32, 4.32, 4.26], m: [4.697, 4.459, 4.55, 4.5, 4.441, 4.248], bu: [97, 76, 67, 87, 98, 80], mu: [97, 76, 67, 87, 98, 79], w: null};

// Карлово - индексация
si['Карлово'] = {n: [603, 606], p: null};
// Карлово - държавни училища
s[603] = {l: 'ПГ Евл. и Хр. Георгиеви', n: 'ПГ Евлогий и Христо Георгиеви', b: [3.26, 3.06, 2.9, 3.04, 2.7, 2.13], m: [3.234, 2.968, 2.96, 3.13, 2.43, 3.739], bu: [73, 40, 30, 25, 15, 16], mu: [71, 40, 22, 21, 12, 12], w: null};
s[604] = {l: 'ПГ по жп транспорт', n: 'ПГ по жп транспорт', b: [3.229, 3.16, 3.08, 3.24, 2.71, 2.5], m: [3.196, 3.154, 3.09, 3.22, 4.56, 3.913], bu: [62, 64, 54, 63, 33, 40], mu: [42, 29, 36, 18, 24, 30], w: null};
s[605] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [5.173, 4.97, 5.06, 4.84, 4.69, 4.68], m: [5.408, 4.911, 5.16, 5.03, 4.472, 4.507], bu: [76, 67, 73, 89, 71, 75], mu: [76, 67, 73, 90, 71, 80], w: null};
s[606] = {l: 'СУ Хр. Проданов', n: 'СУ Христо Проданов', b: [4.329, 4.09, 3.97, 3.94, 3.83, 3.48], m: [4.519, 3.815, 4.02, 4.22, 3.698, 3.717], bu: [95, 85, 66, 82, 67, 78], mu: [98, 89, 66, 82, 67, 77], w: null};

// Карнобат - индексация
si['Карнобат'] = {n: [607, 609], p: null};
// Карнобат - държавни училища
s[607] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.435, 3.05, 3.15, 3.03, 2.27, 2.52], m: [3.88, 3.676, 3.58, 2.94, 4.22, 3.919], bu: [63, 52, 33, 42, 46, 51], mu: [60, 40, 21, 5, 31, 42], w: null};
s[608] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [5.153, 4.67, 4.16, 4.31, 4.03, 3.97], m: [5.091, 4.938, 4.4, 4.61, 3.968, 4.362], bu: [49, 71, 61, 52, 48, 54], mu: [49, 70, 61, 51, 47, 51], w: null};
s[609] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.198, 4.05, 4.01, 3.81, 3.61, 3.93], m: [4.495, 4.449, 4.14, 4.02, 3.519, 4.212], bu: [73, 57, 56, 69, 63, 54], mu: [72, 56, 57, 70, 62, 53], w: null};

// Козлодуй - индексация
si['Козлодуй'] = {n: [610, 612], p: null};
// Козлодуй - държавни училища
s[610] = {l: 'ПГ по ядрена енерг.', n: 'ПГ по ядрена енерг.', b: [3.828, 3.57, 3.67, 3.32, 3.05, 2.99], m: [4.099, 3.864, 3.33, 3.52, 3.49, 3.691], bu: [59, 71, 32, 77, 55, 56], mu: [20, 20, 8, 11, 51, 53], w: null};
s[611] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [5.299, 5.22, 4.74, 5.01, 4.79, 4.43], m: [5.294, 4.99, 4.73, 4.9, 4.823, 4.612], bu: [55, 53, 45, 51, 46, 41], mu: [55, 53, 45, 51, 46, 41], w: null};
s[612] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.272, 4.13, 4.08, 4.04, 3.9, 3.65], m: [4.249, 4.335, 4.28, 4.31, 4.146, 3.704], bu: [42, 50, 43, 44, 31, 45], mu: [42, 50, 43, 44, 29, 44], w: null};

// Костинброд - индексация
si['Костинброд'] = {n: [613, 614], p: null};
// Костинброд - държавни училища
s[613] = {l: 'ПГ по вет. мед.', n: 'ПГ по ветеринарна медицина', b: [3.77, 3.44, 3.45, 3.36, 2.75, 3.12], m: [4.041, 3.635, 3.75, 3.88, 3.85, 4.847], bu: [41, 39, 44, 37, 38, 51], mu: [25, 19, 24, 17, 34, 38], w: null};
s[614] = {l: 'СУ Петър Берон', n: 'СУ Д-р Петър Перон', b: [4.212, 4.12, 4.17, 4.37, 3.72, 3.69], m: [4.483, 4.391, 4.4, 4.64, 4.086, 3.876], bu: [19, 25, 18, 20, 35, 20], mu: [19, 25, 18, 19, 34, 21], w: null};

// Лом - индексация
si['Лом'] = {n: [615, 619], p: null};
// Лом - държавни училища
s[615] = {l: 'ПГ Найден Геров', n: 'ПГ Найден Геров', b: [4.514, 4.37, 4.66, 4.53, 4.23, 4.05], m: [4.958, 4.492, 5.0, 4.59, 3.665, 3.216], bu: [62, 55, 42, 37, 43, 42], mu: [62, 55, 41, 37, 43, 48], w: null};
s[616] = {l: 'ПГ по произв. техн.', n: 'ПГ по произв. технологии', b: [3.81, 3.48, 3.93, 3.57, 3.73, 3.74], m: [3.698, 3.378, 3.79, 3.43, 4.325, 5.054], bu: [46, 50, 45, 43, 12, 26], mu: [47, 53, 46, 45, 14, 27], w: null};
s[617] = {l: 'ПГ по хранене', n: 'ПГ по хранене и земеделие', b: [3.468, 3.14, 3.36, 3.42, 3.06, 2.97], m: [3.477, 3.061, 2.94, 2.97, 4.07, 4.14], bu: [45, 37, 25, 40, 24, 20], mu: [18, 10, 6, 11, 20, 16], w: null};
s[618] = {l: 'СУ Д. Маринов', n: 'СУ Димитър Маринов', b: [4.114, 3.93, 4.43, 4.48, 4.39, 3.48], m: [4.32, 4.347, 4.52, 4.83, 4.762, 4.206], bu: [37, 33, 35, 29, 20, 24], mu: [38, 33, 35, 29, 20, 25], w: null};
s[619] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [3.637, 3.36, 3.5, 3.27, 2.97, 2.55], m: [3.641, 3.59, 3.46, 3.26, 4.11, 2.806], bu: [8, 2, 5, 4, 4, 3], mu: [7, 2, 5, 4, 4, 3], w: null};

// Луковит - индексация
si['Луковит'] = {n: [620, 621], p: null};
// Луковит - държавни училища
s[620] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.541, 3.46, 3.61, 3.45, 3.43, 2.95], m: [3.553, 3.044, 2.87, 3.66, 4.216, 4.492], bu: [63, 68, 28, 33, 40, 48], mu: [23, 17, 7, 5, 40, 39], w: null};
s[621] = {l: 'СУ А. Константинов', n: 'СУ Алеко Константинов', b: [3.677, 3.53, 4.09, 3.59, 2.48, 2.67], m: [3.741, 3.347, 3.83, 3.62, 2.403, 2.315], bu: [37, 46, 48, 49, 27, 41], mu: [38, 47, 54, 54, 22, 32], w: null};

// Несебър - индексация
si['Несебър'] = {n: [622, 623], p: null};
// Несебър - държавни училища
s[622] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [3.319, 3.15, 3.06, 3.1, 2.85, 2.48], m: [3.398, 3.37, 3.11, 3.27, 4.059, 3.299], bu: [69, 70, 73, 80, 65, 46], mu: [47, 53, 22, 15, 57, 41], w: null};
s[623] = {l: 'СУ Л. Каравелов', n: 'СУ Любен Каравелов', b: [4.423, 4.48, 4.19, 4.05, 4.3, 3.46], m: [5.249, 4.377, 4.66, 4.8, 4.555, 3.985], bu: [29, 34, 50, 42, 49, 52], mu: [30, 34, 50, 42, 49, 51], w: null};

// Нова Загора - индексация
si['Нова Загора'] = {n: [624, 627], p: null};
// Нова Загора - държавни училища
s[624] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.693, 3.23, 3.16, 3.09, 2.26, 2.09], m: [4.093, 3.465, 3.26, 3.73, 4.108, 4.11], bu: [23, 29, 29, 36, 31, 22], mu: [25, 27, 10, 1, 24, 14], w: null};
s[625] = {l: 'ПГ по техника', n: 'ПГ по техника и технологии', b: [3.736, 3.39, 3.74, 3.44, 2.86, 2.93], m: [4.205, 3.77, 4.29, 4.15, 3.5, 4.188], bu: [26, 44, 53, 15, 42, 33], mu: [31, 34, 56, 13, 42, 23], w: null};
s[626] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [4.376, 3.84, null, 3.49, 2.71, 2.0], m: [4.54, 4.04, null, 3.44, 2.0, 2.0], bu: [24, 7, null, 13, 5, 4], mu: [26, 7, null, 13, 4, 4], w: null};
s[627] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.513, 4.38, 4.77, 4.46, 4.2, 4.07], m: [5.319, 4.68, 5.18, 4.67, 4.619, 4.246], bu: [63, 61, 52, 80, 70, 67], mu: [63, 61, 52, 80, 70, 67], w: null};

// Нови Искър - индексация
si['Нови Искър'] = {n: [628, 628], p: null};
// Нови Искър - държавни училища
s[628] = {l: '170 СУ', n: '170 СУ Васил Левски', b: [3.814, 4.02, 4.03, 4.13, 3.85, 3.76], m: [3.877, 3.849, 3.95, 4.34, 3.781, 3.564], bu: [35, 44, 39, 38, 29, 38], mu: [35, 44, 41, 38, 29, 36], w: 'http://170su.com'};

// Нови пазар - индексация
si['Нови пазар'] = {n: [629, 632], p: null};
// Нови пазар - държавни училища
s[629] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.254, 2.93, 3.0, 2.65, 2.13, 2.07], m: [3.481, 3.26, 3.42, 2.78, 3.77, 3.569], bu: [11, 15, 15, 10, 11, 16], mu: [8, 17, 14, 12, 6, 10], w: null};
s[630] = {l: 'ПГ по хим. техн.', n: 'ПГ по химични технологии', b: [3.389, 2.99, 3.19, 3.21, 2.06, 2.29], m: [3.64, 3.197, 3.24, 3.15, 2.0, 3.93], bu: [21, 26, 12, 9, 17, 12], mu: [20, 25, 12, 10, 16, 18], w: null};
s[631] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [3.746, 3.75, 3.68, 3.96, 3.32, 2.91], m: [3.995, 4.04, 3.88, 4.14, 3.663, 3.167], bu: [35, 43, 36, 41, 52, 38], mu: [33, 43, 35, 40, 52, 34], w: null};
s[632] = {l: 'СУ Хан Исперих', n: 'СУ Хан Исперих', b: [4.132, 3.69, 3.49, 3.49, 3.0, 3.7], m: [4.385, 4.162, 3.98, 3.75, 3.215, 4.313], bu: [23, 23, 18, 25, 32, 26], mu: [23, 23, 18, 25, 32, 24], w: null};

// Панагюрище - индексация
si['Панагюрище'] = {n: [633, 634], p: null};
// Панагюрище - държавни училища
s[633] = {l: 'ПГ по индустр. техн.', n: 'ПГ по индустриални техн.', b: [3.748, 3.69, 3.73, 3.53, 2.8, 2.9], m: [3.796, 3.685, 3.57, 3.63, 4.419, 5.014], bu: [78, 84, 65, 71, 30, 68], mu: [39, 31, 21, 17, 25, 59], w: null};
s[634] = {l: 'СУ Нешо Бончев', n: 'СУ Нешо Бончев', b: [5.159, 4.79, 4.98, 5.12, 4.6, 4.48], m: [5.304, 4.882, 5.26, 5.27, 4.132, 3.93], bu: [53, 65, 40, 45, 65, 47], mu: [53, 64, 40, 45, 65, 49], w: null};

// Петрич - индексация
si['Петрич'] = {n: [635, 639], p: null};
// Петрич - държавни училища
s[635] = {l: 'ПГ П. К. Яворов', n: 'ПГ Пейо К. Яворов', b: [4.585, 4.38, 4.71, 4.45, 4.27, 4.18], m: [4.683, 4.414, 4.73, 4.56, 4.729, 4.072], bu: [128, 112, 124, 127, 122, 129], mu: [132, 112, 123, 129, 121, 130], w: null};
s[636] = {l: 'ПГ по икон. и туризъм', n: 'ПГ по икономика и туризъм', b: [3.885, 3.61, 3.88, 3.59, 3.3, 3.2], m: [3.631, 3.29, 3.6, 3.78, 5.03, 5.13], bu: [134, 104, 95, 100, 107, 120], mu: [51, 28, 20, 15, 100, 99], w: null};
s[637] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.202, 3.24, 3.06, 3.34, 2.73, 2.45], m: [3.201, 3.36, 3.38, 3.25, 3.82, 4.19], bu: [84, 57, 47, 43, 40, 36], mu: [70, 46, 38, 39, 32, 22], w: null};
s[638] = {l: 'СУ А. Попов', n: 'СУ Антон Попов', b: [3.302, 2.81, 3.39, 2.89, null, 2.1], m: [3.882, 2.65, 3.45, 2.49, null, 2.0], bu: [14, 7, 10, 3, null, 11], mu: [15, 5, 9, 3, null, 6], w: null};
s[639] = {l: 'СУ Н. Вапцаров', n: 'СУ Никола Вапцаров', b: [4.453, 4.28, 4.43, 4.79, 3.97, 4.17], m: [4.847, 4.631, 4.61, 4.74, 4.746, 4.621], bu: [22, 26, 26, 26, 44, 52], mu: [23, 26, 26, 26, 43, 52], w: null};

// Пещера - индексация
si['Пещера'] = {n: [640, 641], p: null};
// Пещера - държавни училища
s[640] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хран.-вк. технологии', b: [3.73, 3.16, 3.24, 3.37, 2.77, 2.92], m: [4.117, 3.12, 3.4, 3.41, 4.88, 4.934], bu: [29, 27, 26, 20, 26, 36], mu: [7, 21, 12, 15, 17, 32], w: null};
s[641] = {l: 'СУ Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.153, 4.07, 3.79, 3.86, 3.43, 4.12], m: [4.086, 4.366, 4.15, 4.59, 3.398, 4.552], bu: [20, 16, 20, 17, 14, 22], mu: [20, 16, 20, 17, 13, 21], w: null};

// Поморие - индексация
si['Поморие'] = {n: [642, 643], p: null};
// Поморие - държавни училища
s[642] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [3.332, 3.17, 3.32, 3.27, 2.51, 2.58], m: [3.553, 3.428, 3.47, 3.12, 4.96, 4.92], bu: [37, 60, 61, 54, 21, 23], mu: [33, 58, 61, 29, 17, 19], w: null};
s[643] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [3.92, 3.97, 4.38, 4.23, 4.18, 3.88], m: [4.024, 3.918, 4.8, 4.5, 4.272, 3.778], bu: [18, 16, 23, 26, 25, 24], mu: [19, 17, 24, 26, 25, 24], w: null};

// Попово - индексация
si['Попово'] = {n: [644, 646], p: null};
// Попово - държавни училища
s[644] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.721, 3.33, 3.58, 3.62, 2.71, 3.0], m: [4.577, 3.32, null, 5.07, 4.799, 5.065], bu: [99, 76, 92, 81, 67, 86], mu: [9, 3, null, 1, 62, 72], w: null};
s[645] = {l: 'ПГ по техника', n: 'ПГ по техника', b: [3.492, 3.47, 3.45, 3.34, 3.66, 3.43], m: [null, 4.605, null, null, 5.27, 5.63], bu: [14, 21, 30, 13, 11, 33], mu: [null, 2, null, null, 26, 31], w: null};
s[646] = {l: 'ПГ Христо Ботев', n: 'ПГ Христо Ботев', b: [4.634, 4.26, 4.51, 4.73, 4.47, 4.58], m: [5.25, 4.812, 5.26, 5.27, 5.14, 4.979], bu: [70, 67, 44, 74, 54, 52], mu: [70, 67, 45, 73, 54, 53], w: null};

// Правец - индексация
si['Правец'] = {n: [647, 648], p: null};
// Правец - държавни училища
s[647] = {l: 'ГПЧЕ', n: 'ГПЧЕ Алеко Константинов', b: [4.707, 4.29, 4.5, 4.03, 4.13, 3.98], m: [5.11, 4.565, 4.97, 4.6, 4.066, 4.225], bu: [99, 94, 72, 64, 56, 74], mu: [89, 82, 60, 51, 54, 74], w: null};
s[648] = {l: 'НПГ по КТС', n: 'НПГ по КТС', b: [4.536, 4.13, 4.42, 4.28, 4.26, 4.11], m: [5.195, 4.209, 4.91, 4.73, 4.9, 4.87], bu: [114, 119, 142, 125, 131, 142], mu: [30, 78, 62, 56, 131, 142], w: null};

// Провадия - индексация
si['Провадия'] = {n: [649, 651], p: null};
// Провадия - държавни училища
s[649] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.148, 3.04, 3.02, 3.28, 2.46, 2.3], m: [3.119, 2.695, 2.88, 2.67, 3.576, 3.339], bu: [89, 72, 97, 62, 39, 56], mu: [22, 9, 12, 10, 33, 45], w: null};
s[650] = {l: 'ПГ по хотелиерство', n: 'ПГ по хотелиерство', b: [3.311, 3.09, 3.08, 3.15, 2.4, 2.23], m: [3.252, 2.395, null, 3.69, 2.79, 2.52], bu: [29, 32, 29, 34, 36, 29], mu: [4, 2, null, 4, 28, 12], w: null};
s[651] = {l: 'СУ Д. Благоев', n: 'СУ Димитър Благоев', b: [4.506, 4.17, 4.15, 4.33, 3.91, 4.07], m: [4.467, 4.208, 4.52, 4.64, 3.993, 4.163], bu: [46, 44, 49, 49, 44, 53], mu: [46, 44, 49, 48, 43, 54], w: null};

// Първомай - индексация
si['Първомай'] = {n: [652, 653], p: null};
// Първомай - държавни училища
s[652] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.872, 3.71, 3.6, 3.43, 3.01, 3.09], m: [3.622, 3.612, 3.45, 3.01, 4.68, 4.888], bu: [83, 65, 47, 56, 44, 52], mu: [68, 30, 22, 10, 44, 46], w: null};
s[653] = {l: 'СУ Асен Златаров', n: 'СУ Асен Златаров', b: [4.983, 4.67, 4.72, 4.76, 4.1, 3.86], m: [4.803, 4.607, 5.04, 4.88, 4.174, 3.67], bu: [39, 37, 24, 21, 48, 60], mu: [39, 37, 24, 21, 48, 61], w: null};

// Раднево - индексация
si['Раднево'] = {n: [654, 655], p: null};
// Раднево - държавни училища
s[654] = {l: 'ПГ Иван Рилски', n: 'ПГ Св. Иван Рилски', b: [3.239, 3.07, 3.32, 3.22, 2.63, 2.49], m: [3.399, 2.978, 3.0, 4.09, 5.33, 4.192], bu: [82, 84, 78, 80, 44, 45], mu: [60, 24, 7, 5, 34, 25], w: null};
s[655] = {l: 'СУ Гео Милев', n: 'СУ Гео Милев', b: [4.273, 4.33, 4.05, 4.05, 3.99, 3.59], m: [4.19, 3.845, 4.22, 4.46, 4.191, 3.849], bu: [41, 24, 24, 23, 41, 37], mu: [44, 25, 26, 25, 40, 37], w: null};

// Радомир - индексация
si['Радомир'] = {n: [656, 658], p: null};
// Радомир - държавни училища
s[656] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.108, 3.04, 3.14, 2.97, 2.62, 2.75], m: [3.287, 3.32, 3.43, 2.93, 4.41, 4.245], bu: [23, 17, 26, 24, 11, 13], mu: [28, 11, 13, 11, 8, 11], w: null};
s[657] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.831, 4.3, 4.56, 4.35, 4.04, 3.57], m: [4.928, 4.442, 4.73, 4.78, 4.313, 3.95], bu: [25, 23, 37, 28, 40, 31], mu: [25, 23, 37, 28, 40, 31], w: null};
s[658] = {l: 'Техническа ПГ', n: 'Техническа ПГ Никола Вапцаров', b: [3.712, 3.67, 3.53, 3.62, 3.11, 2.91], m: [3.925, 3.518, 3.43, 3.34, 4.45, 4.41], bu: [57, 49, 31, 28, 24, 20], mu: [38, 51, 33, 30, 20, 18], w: null};

// Разлог - индексация
si['Разлог'] = {n: [659, 662], p: null};
// Разлог - държавни училища
s[659] = {l: 'ПГ по механ. на с. стоп.', n: 'ПГ по механ. на селското стоп.', b: [3.149, 2.74, 3.3, 3.35, 2.68, 2.54], m: [2.995, 3.22, 3.08, null, 4.24, 3.68], bu: [55, 54, 47, 39, 25, 39], mu: [6, 3, 1, null, 22, 40], w: null};
s[660] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.65, 3.1, 3.85, 3.92, 3.36, 3.52], m: [4.404, 2.4, null, null, 5.34, 5.19], bu: [65, 22, 43, 53, 42, 57], mu: [7, 1, null, null, 41, 43], w: null};
s[661] = {l: 'Разложка ПГ', n: 'Разложка ПГ', b: [4.094, 4.28, 4.17, 4.07, 3.59, 3.53], m: [3.533, 3.056, 4.39, 5.05, 5.26, 5.26], bu: [76, 66, 44, 53, 46, 56], mu: [10, 3, 6, 4, 47, 49], w: null};
s[662] = {l: 'СУ бр. Каназиреви', n: 'СУ братя Каназиреви', b: [5.094, 4.96, 4.89, 4.89, 4.61, 4.68], m: [5.391, 4.791, 5.25, 5.24, 4.73, 4.663], bu: [61, 59, 49, 44, 53, 65], mu: [60, 59, 49, 43, 53, 66], w: null};

// Раковски - индексация
si['Раковски'] = {n: [663, 663], p: null};
// Раковски - държавни училища
s[663] = {l: 'ПГ Петър Парчевич', n: 'ПГ Петър Парчевич', b: [3.618, 3.17, 3.26, 3.2, 2.35, 2.17], m: [3.555, 3.635, 3.37, 3.69, 2.55, 3.697], bu: [50, 50, 57, 57, 50, 29], mu: [11, 28, 25, 27, 41, 17], w: null};

// Самоков - индексация
si['Самоков'] = {n: [664, 668], p: null};
// Самоков - държавни училища
s[664] = {l: 'ПГ К. Фотинов', n: 'ПГ Константин Фотинов', b: [4.973, 4.72, 4.72, 4.85, 4.6, 4.51], m: [5.072, 4.835, 5.01, 5.19, 4.568, 4.525], bu: [59, 58, 70, 46, 50, 58], mu: [59, 57, 70, 46, 47, 58], w: null};
s[665] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [4.0, 3.22, 3.45, 3.14, 2.6, 2.87], m: [4.008, 3.41, 3.6, 3.46, 3.75, 4.737], bu: [28, 17, 17, 22, 6, 23], mu: [28, 21, 17, 22, 4, 19], w: null};
s[666] = {l: 'ПТГ Н. Вапцаров', n: 'ПТГ Никола Вапцаров', b: [4.31, 4.16, 4.19, 4.38, 3.94, 3.72], m: [4.256, 4.27, 4.38, 4.63, 4.55, 4.37], bu: [94, 77, 76, 56, 58, 70], mu: [96, 78, 76, 58, 56, 70], w: null};
s[667] = {l: 'СпУ Никола Велчев', n: 'Спортно у-ще Никола Велчев', b: [3.385, 3.3, 3.07, 3.82, 3.34, 3.15], m: [3.95, 4.76, 3.97, 4.61, 4.6, 5.54], bu: [21, 19, 12, 16, 14, 15], mu: [15, 4, 5, 5, 13, 13], w: null};
s[668] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [4.212, 4.16, 3.91, 4.08, 3.86, 3.72], m: [4.378, 4.25, 3.67, 4.47, 3.759, 3.91], bu: [53, 44, 27, 43, 28, 49], mu: [54, 46, 27, 42, 28, 48], w: null};

// Сандански - индексация
si['Сандански'] = {n: [669, 673], p: null};
// Сандански - държавни училища
s[669] = {l: 'Вечерна гимн.', n: 'Вечерна профилирана гимназия', b: [3.035, 3.03, 3.03, 2.93, 2.43, 2.32], m: [3.276, 3.11, 3.17, 3.16, null, 2.741], bu: [15, 14, 15, 18, 7, 11], mu: [19, 12, 15, 15, null, 7], w: null};
s[670] = {l: 'Земеделска гимн.', n: 'Земеделска професионална гимназия', b: [4.145, 3.98, 3.98, 4.2, 4.13, 3.88], m: [4.717, 3.887, 4.11, 4.0, 5.013, 4.526], bu: [114, 114, 122, 130, 132, 141], mu: [56, 63, 101, 38, 131, 131], w: null};
s[671] = {l: 'ПГ Яне Сандански', n: 'ПГ Яне Сандански', b: [4.394, 4.15, 4.47, 4.31, 3.95, 3.84], m: [4.679, 4.244, 4.49, 4.38, 4.107, 3.654], bu: [137, 122, 105, 115, 80, 106], mu: [140, 124, 112, 119, 77, 113], w: null};
s[672] = {l: 'Спортно у-ще', n: 'Спортно училище', b: [3.474, 3.43, 3.54, 3.64, 2.35, 2.85], m: [3.196, 3.458, 2.8, null, 4.2, 4.57], bu: [20, 18, 14, 14, 10, 18], mu: [3, 8, 2, null, 10, 14], w: null};
s[673] = {l: 'Техническа гимн.', n: 'Професионална техническа гимназия', b: [2.73, 2.81, 3.06, 3.28, 2.8, 2.22], m: [3.29, 2.769, 3.15, 3.32, 2.98, 2.95], bu: [1, 23, 10, 19, 12, 14], mu: [1, 12, 8, 15, 11, 11], w: null};

// Свиленград - индексация
si['Свиленград'] = {n: [674, 675], p: null};
// Свиленград - държавни училища
s[674] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.804, 3.61, 3.74, 3.83, 3.37, 3.51], m: [3.321, 4.146, 3.56, null, 5.39, 5.09], bu: [68, 80, 59, 44, 37, 49], mu: [6, 13, 6, null, 34, 44], w: null};
s[675] = {l: 'СУ Петър Берон', n: 'СУ Д-р Петър Перон', b: [4.759, 4.26, 4.54, 4.39, 4.1, 4.44], m: [5.098, 4.686, 4.78, 4.86, 4.421, 4.588], bu: [63, 51, 55, 58, 56, 52], mu: [62, 51, 55, 58, 56, 50], w: null};

// Свищов - индексация
si['Свищов'] = {n: [676, 680], p: null};
// Свищов - държавни училища
s[676] = {l: 'ПГ Ал. Константинов', n: 'Свищовска ПГ Алеко Константинов', b: [3.541, 3.33, 3.19, 3.53, 2.82, 3.03], m: [3.28, 3.213, 2.68, 3.45, 4.508, 4.386], bu: [68, 62, 52, 38, 26, 50], mu: [13, 19, 7, 6, 25, 45], w: null};
s[677] = {l: 'СУ Д. Благоев', n: 'СУ Димитър Благоев', b: [4.723, 4.21, 4.28, 4.19, 3.78, 3.89], m: [5.014, 4.285, 4.86, 4.84, 3.529, 4.408], bu: [22, 40, 29, 43, 65, 59], mu: [24, 40, 29, 43, 65, 63], w: null};
s[678] = {l: 'СУ Н. Катранов', n: 'СУ Николай Катранов', b: [5.081, 5.06, 4.8, 4.71, 4.45, 4.44], m: [5.451, 5.174, 5.21, 5.23, 4.669, 4.364], bu: [49, 51, 37, 23, 52, 51], mu: [49, 51, 37, 23, 52, 50], w: null};
s[679] = {l: 'СУ Цв. Радославов', n: 'СУ Цветан Радославов', b: [3.828, 3.55, 3.78, 3.53, 3.76, 3.53], m: [4.163, 4.071, 4.38, 3.67, 3.325, 3.162], bu: [16, 28, 13, 14, 18, 14], mu: [19, 27, 14, 14, 17, 14], w: null};
s[680] = {l: 'Търговска гимн.', n: 'ПДТГ Димитър Хадживасилев', b: [4.049, 4.0, 4.06, 4.08, 3.67, 3.5], m: [4.021, 4.193, 4.16, 3.6, 5.65, 5.34], bu: [57, 68, 57, 47, 28, 20], mu: [27, 42, 20, 2, 28, 17], w: null};

// Своге - индексация
si['Своге'] = {n: [681, 682], p: null};
// Своге - държавни училища
s[681] = {l: 'ПГ Велизар Пеев', n: 'ПГ Велизар Пеев', b: [4.181, 4.29, 4.06, 4.15, 4.08, 3.91], m: [4.052, 4.12, 4.89, 3.96, 4.97, 5.34], bu: [109, 106, 77, 95, 66, 92], mu: [55, 33, 10, 5, 62, 92], w: null};
s[682] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [4.642, 4.64, 4.6, 4.27, 4.53, 4.25], m: [4.825, 5.079, 4.93, 4.4, 4.501, 3.9], bu: [20, 16, 17, 24, 24, 11], mu: [20, 15, 17, 22, 23, 11], w: null};

// Севлиево - индексация
si['Севлиево'] = {n: [683, 685], p: null};
// Севлиево - държавни училища
s[683] = {l: 'ПГ Марин Попов', n: 'ПГ Марин Попов', b: [3.154, 3.11, 2.84, 3.09, 2.43, 2.22], m: [3.214, 2.9, 2.83, 3.14, 3.31, 2.6], bu: [25, 20, 14, 12, 16, 15], mu: [33, 23, 15, 13, 14, 11], w: null};
s[684] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.821, 3.43, 3.85, 3.66, 3.33, 3.11], m: [3.993, 3.716, 3.95, 4.02, 4.21, 4.28], bu: [76, 69, 79, 71, 65, 86], mu: [77, 69, 79, 70, 65, 81], w: null};
s[685] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [4.748, 4.66, 4.77, 4.65, 4.26, 4.39], m: [4.975, 4.656, 4.91, 4.85, 4.065, 4.363], bu: [77, 60, 61, 55, 63, 71], mu: [77, 60, 61, 55, 63, 72], w: null};

// Стамболийски - индексация
si['Стамболийски'] = {n: [686, 686], p: null};
// Стамболийски - държавни училища
s[686] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [3.089, 3.69, 3.19, 3.38, 3.01, 2.72], m: [2.961, 3.986, 3.2, 3.27, 3.728, 3.437], bu: [10, 16, 9, 12, 22, 9], mu: [8, 15, 10, 12, 18, 8], w: null};

// Троян - индексация
si['Троян'] = {n: [687, 690], p: null};
// Троян - държавни училища
s[687] = {l: 'НУПИ Венко Колев', n: 'НУПИ Проф. Венко Колев', b: [4.752, 4.06, 4.19, 3.97, 3.9, 3.93], m: [null, null, null, null, 4.83, 4.27], bu: [13, 25, 14, 21, 21, 20], mu: [null, null, null, null, 21, 20], w: null};
s[688] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.621, 3.14, 3.18, 3.14, 2.78, 2.57], m: [4.1, 3.731, 4.36, 4.06, 4.09, 4.61], bu: [65, 42, 36, 32, 38, 26], mu: [30, 14, 7, 5, 36, 23], w: null};
s[689] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [4.954, 4.61, 5.1, 4.52, 4.31, 4.25], m: [5.305, 4.97, 5.23, 4.96, 4.696, 4.781], bu: [101, 97, 69, 87, 68, 75], mu: [92, 86, 62, 72, 68, 75], w: null};
s[690] = {l: 'СУ Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.622, 4.34, 4.35, 4.37, 4.31, 3.71], m: [4.853, 4.564, 4.51, 4.4, 4.347, 4.516], bu: [49, 78, 33, 37, 34, 43], mu: [49, 78, 33, 37, 34, 43], w: null};

// Харманли - индексация
si['Харманли'] = {n: [691, 692], p: null};
// Харманли - държавни училища
s[691] = {l: 'ПГ по електропром.', n: 'ПГ по електропромишленост', b: [3.116, 3.2, 3.32, 3.3, 2.3, 2.51], m: [3.265, 3.5, 5.4, 2.64, 3.956, 4.26], bu: [57, 27, 18, 17, 28, 23], mu: [41, 19, 2, 6, 20, 16], w: null};
s[692] = {l: 'СУ Неофит Рилски', n: 'СУ Неофит Рилски', b: [4.319, 4.17, 4.23, 3.84, 3.49, 3.47], m: [4.852, 4.471, 5.05, 4.26, 3.441, 3.781], bu: [70, 76, 78, 68, 63, 53], mu: [70, 74, 77, 67, 58, 49], w: null};

// Червен бряг - индексация
si['Червен бряг'] = {n: [693, 696], p: null};
// Червен бряг - държавни училища
s[693] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.325, 3.29, 3.3, 3.28, 3.12, 2.9], m: [3.314, 3.473, 3.58, 3.43, 4.17, 3.989], bu: [53, 43, 35, 38, 26, 44], mu: [14, 15, 6, 5, 25, 34], w: null};
s[694] = {l: 'ПГ по хран. техн.', n: 'ПГ по хранителни технологии', b: [3.227, 3.17, 3.04, 3.27, 2.79, 2.59], m: [3.157, 3.054, 2.88, 3.36, 3.75, 4.44], bu: [24, 18, 19, 25, 22, 18], mu: [23, 9, 8, 10, 19, 14], w: null};
s[695] = {l: 'СУ Петър Берон', n: 'СУ Д-р Петър Перон', b: [4.13, 4.43, 4.3, 5.04, 4.37, 3.94], m: [4.462, 4.446, 4.39, 5.03, 4.157, 4.082], bu: [27, 35, 26, 25, 49, 34], mu: [27, 35, 26, 25, 49, 34], w: null};
s[696] = {l: 'Търговска гимн.', n: 'Търговска гимназия', b: [4.5, 4.04, 3.87, 3.98, 3.71, 3.47], m: [4.561, 3.713, 3.71, 3.94, 4.43, 4.46], bu: [31, 35, 46, 34, 17, 16], mu: [24, 19, 43, 28, 17, 13], w: null};

// Чирпан - индексация
si['Чирпан'] = {n: [697, 698], p: null};
// Чирпан - държавни училища
s[697] = {l: 'ПГ по селско стоп.', n: 'ПГ по селско стопанство', b: [3.462, 3.35, 3.42, 3.28, 3.16, 3.15], m: [4.898, 4.118, 4.13, 4.03, 4.543, 4.58], bu: [77, 66, 46, 36, 45, 40], mu: [33, 15, 6, 6, 45, 38], w: null};
s[698] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [4.588, 4.54, 4.37, 4.12, 4.25, 4.23], m: [5.093, 5.32, 4.72, 4.57, 4.351, 4.517], bu: [66, 57, 43, 54, 52, 52], mu: [65, 59, 43, 53, 51, 49], w: null};

