// https://data.egov.bg/data/view/066b4b04-d81d-444e-a61c-8ca0516079e4

let si = [];
let s = [];

// София - индексация
si['София'] = {n: [1, 126], p: [127, 149]};
// София - държавни училища
s[1] = {l: '1 АЕГ', n: 'Първа английска ЕГ', b: [5.469, 5.37, 5.44, 5.36], m: [5.837, null, 5.62, 5.61], bu: [218, 214, 222, 210], mu: [218, null, 222, 210]};
s[2] = {l: '1 СУ', n: '1 СУ Пенчо Славейков', b: [4.483, 4.47, 4.54, 4.36], m: [4.805, null, 4.46, 4.64], bu: [124, 106, 73, 87], mu: [124, null, 73, 86]};
s[3] = {l: '2 АЕГ', n: 'Втора английска ЕГ', b: [5.309, 5.33, 5.38, 5.31], m: [5.717, null, 5.55, 5.52], bu: [211, 220, 208, 201], mu: [211, null, 208, 201]};
s[4] = {l: '2 СУ', n: '2 СУ Акад. Емилиян Станев', b: [4.561, 4.46, 4.48, 4.45], m: [4.911, null, 4.82, 4.82], bu: [99, 95, 93, 94], mu: [99, null, 92, 95]};
s[5] = {l: '3 СУ', n: '3 СУ Марин Дринов', b: [3.412, 3.56, 3.39, 3.41], m: [3.785, null, 3.81, 3.93], bu: [12, 25, 22, 27], mu: [12, null, 24, 25]};
s[6] = {l: '5 СУ', n: '5 вечерно СУ Пеньо Пенев', b: [4.032, 3.96, 3.77, 3.87], m: [4.206, null, 3.79, 4.1], bu: [34, 25, 19, 24], mu: [35, null, 19, 25]};
s[7] = {l: '7 СУ', n: '7 СУ Св. Седмочисленици', b: [4.727, 4.69, 4.7, 4.6], m: [5.432, null, 5.1, 4.97], bu: [125, 124, 138, 130], mu: [100, null, 139, 121]};
s[8] = {l: '9 ФЕГ', n: '9 Френска ЕГ Алфонс дьо Ламартин', b: [5.324, 5.28, 5.45, 5.26], m: [5.409, null, 5.33, 5.22], bu: [202, 193, 196, 202], mu: [202, null, 196, 203]};
s[9] = {l: '10 СУ', n: '10 СУ Теодор Траянов', b: [3.933, 3.62, 3.86, 3.76], m: [3.946, null, 3.9, 3.86], bu: [22, 15, 13, 15], mu: [22, null, 13, 14]};
s[10] = {l: '12 СУ', n: '12 СУ Цар Иван Асен II', b: [4.519, 4.55, 4.48, 4.55], m: [4.974, null, 4.66, 4.73], bu: [67, 84, 75, 68], mu: [67, null, 75, 67]};
s[11] = {l: '14 СУ', n: '14 СУ Проф. Д-р Асен Златаров', b: [4.09, 3.85, 3.8, null], m: [4.136, null, 4.0, null], bu: [19, 12, 24, null], mu: [19, null, 24, null]};
s[12] = {l: '15 СУ', n: '15 СУ Адам Мицкевич', b: [3.923, 3.7, 3.46, 3.43], m: [4.035, null, 3.61, 3.54], bu: [21, 20, 21, 14], mu: [21, null, 22, 15]};
s[13] = {l: '18 СУ', n: '18 СУ Уилям Гладстон', b: [5.201, 5.13, 5.17, 5.05], m: [5.414, null, 5.15, 5.13], bu: [218, 201, 208, 217], mu: [218, null, 209, 217]};
s[14] = {l: '19 СУ', n: '19 СУ Елин Пелин', b: [4.35, 4.45, 4.57, 4.57], m: [4.697, null, 4.67, 4.82], bu: [62, 48, 65, 71], mu: [60, null, 66, 71]};
s[15] = {l: '21 СУ', n: '21 СУ Христо Ботев', b: [4.387, 4.35, 4.34, 4.6], m: [5.167, null, 4.63, 4.97], bu: [43, 43, 33, 45], mu: [44, null, 33, 44]};
s[16] = {l: '22 СУ', n: '22 СЕУ Георги С. Раковски', b: [5.109, 5.16, 5.21, 5.17], m: [5.425, null, 5.25, 5.25], bu: [169, 162, 153, 161], mu: [170, null, 153, 161]};
s[17] = {l: '23 СУ', n: '23 СУ Фредерик Жолио-Кюри', b: [4.137, 4.3, 4.28, 4.08], m: [4.565, null, 4.53, 4.38], bu: [87, 119, 70, 76], mu: [87, null, 70, 76]};
s[18] = {l: '24 СУ', n: '24 СУ Пейо К. Яворов', b: [3.144, 2.49, 3.18, 3.21], m: [3.307, null, 3.29, 3.18], bu: [17, 5, 14, 19], mu: [17, null, 14, 17]};
s[19] = {l: '26 СУ', n: '26 СУ Йордан Йовков', b: [4.015, 3.49, 4.01, 4.02], m: [4.25, null, 4.45, 4.24], bu: [16, 7, 23, 12], mu: [15, null, 23, 13]};
s[20] = {l: '28 СУ', n: '28 СУ Алеко Константинов', b: [3.953, 3.88, 3.72, 3.6], m: [3.942, null, 4.09, 3.83], bu: [21, 26, 18, 17], mu: [21, null, 17, 19]};
s[21] = {l: '29 СУ', n: '29 СУ Кузман Шапкарев', b: [3.7, 3.46, 3.6, 3.54], m: [3.6, null, 3.68, 3.68], bu: [38, 34, 36, 33], mu: [38, null, 36, 35]};
s[22] = {l: '30 СУ', n: '30 СУ Братя Миладинови', b: [5.112, 4.92, 4.78, 4.78], m: [5.021, null, 4.91, 4.83], bu: [66, 65, 50, 60], mu: [67, null, 50, 61]};
s[23] = {l: '31 СУ', n: '31 СУ Иван Вазов', b: [5.25, 5.19, 5.2, 5.12], m: [5.539, null, 5.23, 5.23], bu: [150, 156, 162, 151], mu: [150, null, 162, 151]};
s[24] = {l: '32 СУ', n: '32 СУ Св. Климент Охридски', b: [5.254, 5.02, 5.19, 5.25], m: [5.653, null, 5.25, 5.56], bu: [158, 158, 157, 162], mu: [158, null, 157, 162]};
s[25] = {l: '33 ЕГ', n: '33 ЕГ Света София', b: [4.413, 4.39, 4.6, 4.67], m: [4.693, null, 4.54, 4.93], bu: [102, 103, 55, 57], mu: [105, null, 55, 57]};
s[26] = {l: '35 СУ', n: '35 СЕУ Добри Войников', b: [5.276, 5.34, 5.42, 5.31], m: [5.125, null, 5.06, 4.97], bu: [130, 121, 127, 121], mu: [130, null, 127, 121]};
s[27] = {l: '36 СУ', n: '36 СУ Максим Горки', b: [4.237, 4.22, 4.03, 4.08], m: [4.709, null, 4.3, 4.37], bu: [23, 30, 37, 33], mu: [23, null, 37, 33]};
s[28] = {l: '37 СУ', n: '37 СУ Райна Княгиня', b: [3.613, 3.12, 3.45, 3.11], m: [3.612, null, 3.77, 3.33], bu: [19, 19, 19, 14], mu: [18, null, 20, 14]};
s[29] = {l: '39 СУ', n: '39 СУ Петър Динеков', b: [3.915, 3.74, 4.59, 3.64], m: [4.554, null, 4.9, 3.39], bu: [34, 18, 15, 1], mu: [34, null, 15, 1]};
s[30] = {l: '40 СУ', n: '40 СУ Луи Пастьор', b: [3.636, 3.98, 3.8, 4.03], m: [3.795, null, 3.61, 3.94], bu: [18, 22, 10, 13], mu: [18, null, 10, 13]};
s[31] = {l: '44 СУ', n: '44 СУ Неофит Бозвели', b: [4.405, 4.39, 4.22, 4.51], m: [4.405, null, 4.09, 4.54], bu: [26, 26, 17, 18], mu: [26, null, 18, 18]};
s[32] = {l: '47 СУ', n: '47 СУ Христо Г. Данов', b: [3.879, 3.5, 3.77, 3.67], m: [4.068, null, 3.87, 3.95], bu: [27, 27, 29, 32], mu: [28, null, 30, 35]};
s[33] = {l: '51 СУ', n: '51 СУ Елисавета Багряна', b: [4.452, 4.42, 4.8, 4.58], m: [4.822, null, 5.02, 4.97], bu: [81, 81, 85, 91], mu: [81, null, 85, 90]};
s[34] = {l: '54 СУ', n: '54 СУ Св. Иван Рилски', b: [4.424, 4.54, 4.37, 4.28], m: [4.897, null, 4.55, 4.53], bu: [44, 35, 21, 79], mu: [44, null, 21, 79]};
s[35] = {l: '56 СУ', n: '56 СУ Проф. Константин Иречек', b: [4.19, 4.24, 4.29, 4.61], m: [4.323, null, 4.3, 4.76], bu: [38, 35, 33, 26], mu: [37, null, 34, 25]};
s[36] = {l: '66 СУ', n: '66 СУ Филип Станиславов', b: [3.471, 3.23, 3.31, 3.31], m: [3.453, null, 3.42, 3.31], bu: [9, 14, 12, 16], mu: [10, null, 12, 17]};
s[37] = {l: '68 СУ', n: '68 СУ Акад. Никола Обрешков', b: [3.769, 3.72, 3.4, 3.43], m: [3.728, null, 3.69, 3.46], bu: [29, 22, 18, 18], mu: [29, null, 18, 18]};
s[38] = {l: '69 СУ', n: '69 СУ Димитър Маринов', b: [2.935, 3.29, 3.97, null], m: [3.035, null, 4.35, null], bu: [2, 3, 11, null], mu: [2, null, 10, null]};
s[39] = {l: '71 СУ', n: '71 СУ Пейо Яворов', b: [3.785, 4.07, 3.95, 3.5], m: [3.826, null, 4.12, 3.86], bu: [22, 13, 11, 21], mu: [22, null, 11, 19]};
s[40] = {l: '73 СУ', n: '73 СУ Владислав Граматик', b: [5.585, 5.6, 5.63, 5.58], m: [5.623, null, 5.54, 5.24], bu: [126, 154, 123, 153], mu: [126, null, 122, 153]};
s[41] = {l: '74 СУ', n: '74 СУ Гоце Делчев', b: [4.097, 3.68, 3.82, 3.76], m: [4.086, null, 4.18, 3.88], bu: [30, 40, 42, 30], mu: [29, null, 42, 29]};
s[42] = {l: '78 СУ', n: '78 СУ Христо Смирненски', b: [3.809, 3.66, 3.64, 3.83], m: [4.008, null, 3.73, 4.28], bu: [35, 30, 31, 19], mu: [36, null, 31, 18]};
s[43] = {l: '79 СУ', n: '79 СУ Индира Ганди', b: [4.204, 3.74, 3.65, 4.11], m: [4.213, null, 4.04, 4.38], bu: [28, 22, 28, 25], mu: [28, null, 27, 25]};
s[44] = {l: '81 СУ', n: '81 СУ Виктор Юго', b: [4.286, 4.2, 4.08, 4.33], m: [4.848, null, 4.16, 4.53], bu: [17, 21, 34, 43], mu: [17, null, 34, 44]};
s[45] = {l: '85 СУ', n: '85 СУ Отец Паисий', b: [3.593, 3.66, 3.11, 3.33], m: [3.798, null, 3.34, 3.65], bu: [20, 11, 16, 22], mu: [19, null, 16, 18]};
s[46] = {l: '88 СУ', n: '88 СУ Димитър Попниколов', b: [4.157, 4.48, 4.33, 3.97], m: [4.659, null, 4.57, 4.45], bu: [39, 40, 46, 36], mu: [40, null, 46, 36]};
s[47] = {l: '90 СУ', n: '90 СУ Ген. Хосе де Сан Мартин', b: [4.173, 3.92, 3.64, 3.99], m: [4.127, null, 3.88, 3.85], bu: [32, 11, 19, 14], mu: [32, null, 19, 14]};
s[48] = {l: '91 НЕГ', n: '91 немска ЕГ', b: [5.624, 5.64, 5.7, 5.63], m: [5.782, null, 5.75, 5.63], bu: [190, 186, 192, 187], mu: [174, null, 167, 167]};
s[49] = {l: '93 СУ', n: '93 СУ Ал. Теодоров - Балан', b: [3.848, 3.38, 3.56, 3.69], m: [3.797, null, 3.64, 3.96], bu: [34, 18, 15, 18], mu: [36, null, 18, 18]};
s[50] = {l: '94 СУ', n: '94 СУ Д. Страшимиров', b: [3.25, 3.11, 3.09, 3.24], m: [3.057, null, 3.23, 3.52], bu: [22, 25, 29, 33], mu: [16, null, 16, 23]};
s[51] = {l: '95 СУ', n: '95 СУ Проф. Иван Шишманов', b: [3.931, 3.87, 3.91, 4.01], m: [4.098, null, 3.99, 4.36], bu: [32, 31, 49, 49], mu: [32, null, 50, 49]};
s[52] = {l: '96 СУ', n: '96 СУ Лев Николаевич Толстой', b: [4.58, 4.47, 4.41, 4.31], m: [4.513, null, 4.52, 4.35], bu: [22, 20, 42, 45], mu: [23, null, 42, 46]};
s[53] = {l: '97 СУ', n: '97 СУ Братя Миладинови', b: [3.957, 3.9, 3.97, 3.76], m: [3.924, null, 4.13, 4.38], bu: [55, 44, 50, 38], mu: [57, null, 51, 38]};
s[54] = {l: '101 СУ', n: '101 СУ Бачо Киро', b: [3.815, 3.97, 4.15, 3.93], m: [3.948, null, 4.23, 4.33], bu: [49, 39, 44, 41], mu: [46, null, 44, 41]};
s[55] = {l: '105 СУ', n: '105 СУ Атанас Далчев', b: [4.42, 4.35, 4.16, 4.23], m: [4.65, null, 4.4, 4.41], bu: [44, 64, 54, 63], mu: [44, null, 55, 63]};
s[56] = {l: '108 СУ', n: '108 СУ Никола Беловеждов', b: [4.178, 3.93, 3.95, 3.89], m: [4.537, null, 4.0, 4.06], bu: [20, 33, 44, 18], mu: [20, null, 44, 18]};
s[57] = {l: '113 СУ', n: '113 СУ Сава Филаретов', b: [3.37, 3.01, 2.76, 3.16], m: [3.301, null, 2.84, 2.99], bu: [14, 11, 2, 6], mu: [11, null, 1, 6]};
s[58] = {l: '117 СУ', n: '117 СУ Св. Св. Кирил и Методий', b: [3.897, 3.87, 3.75, 3.58], m: [4.155, null, 3.79, 3.84], bu: [9, 13, 20, 22], mu: [10, null, 20, 21]};
s[59] = {l: '118 СУ', n: '118 СУ Акад. Людмил Стоянов', b: [4.109, 3.92, 4.26, 4.01], m: [4.494, null, 4.19, 4.59], bu: [24, 23, 14, 24], mu: [24, null, 14, 24]};
s[60] = {l: '119 СУ', n: '119 СУ Акад. Михаил Арнаудов', b: [4.501, 4.45, 4.59, 4.58], m: [4.908, null, 4.84, 4.87], bu: [75, 94, 92, 93], mu: [75, null, 92, 93]};
s[61] = {l: '121 СУ', n: '121 СУ Георги Измирлиев', b: [3.514, 3.59, 3.77, 3.49], m: [3.856, null, 4.1, 4.01], bu: [24, 22, 16, 18], mu: [23, null, 16, 17]};
s[62] = {l: '123 СУ', n: '123 СУ Стефан Стамболов', b: [3.214, 3.47, 3.44, 3.26], m: [3.287, null, 3.34, 3.26], bu: [17, 10, 9, 16], mu: [15, null, 7, 17]};
s[63] = {l: '127 СУ', n: '127 СУ Иван Николаевич Денкоглу', b: [4.818, 4.79, 4.97, 4.74], m: [5.228, null, 5.01, 4.84], bu: [141, 131, 132, 131], mu: [143, null, 132, 131]};
s[64] = {l: '128 СУ', n: '128 СУ Алберт Айнщайн', b: [4.309, 3.89, 3.97, 4.02], m: [4.584, null, 4.23, 4.34], bu: [23, 67, 42, 50], mu: [23, null, 42, 51]};
s[65] = {l: '130 СУ', n: '130 СУ Стефан Караджа', b: [3.767, 3.5, 3.52, 3.41], m: [3.88, null, 3.52, 3.58], bu: [17, 9, 16, 13], mu: [17, null, 16, 13]};
s[66] = {l: '131 СУ', n: '131 СУ Климент Аркад. Тимирязев', b: [3.942, 4.12, 3.92, 3.9], m: [3.94, null, 3.85, 4.02], bu: [14, 17, 15, 19], mu: [12, null, 15, 17]};
s[67] = {l: '132 СУ', n: '132 СУ Ваня Войнова', b: [3.906, 3.57, 4.06, 3.95], m: [4.012, null, 4.19, 4.24], bu: [83, 42, 51, 62], mu: [78, null, 51, 63]};
s[68] = {l: '133 СУ', n: '133 СУ Александър Сергеевич Пушкин', b: [5.296, 5.21, 5.34, 5.25], m: [5.449, null, 5.27, 5.22], bu: [100, 107, 105, 105], mu: [100, null, 105, 105]};
s[69] = {l: '134 СУ', n: '134 СУ Димчо Дебелянов', b: [4.867, 4.86, 4.9, 4.84], m: [5.307, null, 5.14, 5.37], bu: [77, 75, 75, 78], mu: [77, null, 76, 78]};
s[70] = {l: '135 СУ', n: '135 СУ Ян Амос Коменски', b: [3.906, 3.77, 4.11, 4.14], m: [3.973, null, 4.26, 4.23], bu: [18, 12, 21, 19], mu: [18, null, 20, 18]};
s[71] = {l: '137 СУ', n: '137 СУ Ангел Кънчев', b: [4.391, 4.05, 4.23, 4.39], m: [4.918, null, 4.45, 4.85], bu: [80, 65, 70, 42], mu: [81, null, 71, 42]};
s[72] = {l: '138 СУ', n: '138 СУ Проф. Васил Златарски', b: [4.575, 4.58, 4.47, 4.37], m: [4.949, null, 4.55, 4.43], bu: [99, 93, 92, 103], mu: [97, null, 93, 104]};
s[73] = {l: '140 СУ', n: '140 СУ Иван Богоров', b: [3.276, 3.52, 3.64, 3.56], m: [3.344, null, 3.7, 3.74], bu: [11, 30, 31, 30], mu: [13, null, 31, 28]};
s[74] = {l: '144 СУ', n: '144 СУ Народни будители', b: [4.127, 4.12, 4.3, 4.1], m: [4.077, null, 4.21, 4.23], bu: [59, 70, 45, 67], mu: [63, null, 45, 68]};
s[75] = {l: '149 СУ', n: '149 СУ Иван Хаджийски', b: [3.731, 3.59, 3.82, 3.42], m: [4.14, null, 3.66, 3.35], bu: [15, 25, 15, 19], mu: [12, null, 16, 20]};
s[76] = {l: '157 СУ', n: '157 СУ Сесар Вайехо', b: [5.133, 4.95, 5.07, 4.88], m: [4.998, null, 4.94, 4.87], bu: [107, 110, 98, 95], mu: [108, null, 98, 95]};
s[77] = {l: '164 СУ', n: '164 СУ Мигел де Сервантес', b: [5.605, 5.54, 5.56, 5.62], m: [5.538, null, 5.55, 5.67], bu: [138, 135, 138, 149], mu: [138, null, 138, 149]};
s[78] = {l: '170 СУ', n: '170 СУ Васил Левски', b: [3.814, 4.02, 4.03, 4.13], m: [3.877, null, 3.95, 4.34], bu: [35, 44, 39, 38], mu: [35, null, 41, 38]};
s[79] = {l: '192 СУ', n: '192 СУ Христо Ботев', b: [3.894, 3.45, 3.81, 3.48], m: [4.283, null, 4.32, 4.22], bu: [18, 23, 12, 12], mu: [18, null, 12, 12]};
s[80] = {l: '203 ЕГ', n: '203 Профилирана ЕГ Свети Методий', b: [4.304, 4.07, 4.26, 4.05], m: [4.835, null, 4.47, 4.3], bu: [87, 55, 23, 20], mu: [86, null, 26, 21]};
s[81] = {l: 'Гимн. по хлебни техн.', n: 'Софийска гимназия по хлебни/сладкарски технологии', b: [3.663, 3.5, 3.67, 3.35], m: [3.926, null, 3.71, 3.44], bu: [57, 45, 48, 27], mu: [53, null, 38, 23]};
s[82] = {l: 'Гимназия за приложни изкуства', n: 'Гимназия за приложни изкуства Св. Лука', b: [4.457, 4.34, 4.6, 4.52], m: [3.732, null, 4.85, 4.95], bu: [90, 92, 91, 98], mu: [5, null, 46, 38]};
s[83] = {l: 'Гимназия по строит., арх. и геод.', n: 'Гимназия по строителство, архитектура и геодезия', b: [4.881, 4.79, 4.88, 4.94], m: [4.93, null, 4.45, 4.79], bu: [181, 173, 178, 178], mu: [179, null, 169, 168]};
s[84] = {l: 'Духовна семинария', n: 'Софийска духовна семинария', b: [3.773, 3.66, 3.89, 4.03], m: [3.768, null, 3.95, 4.67], bu: [11, 13, 9, 9], mu: [11, null, 10, 9]};
s[85] = {l: 'Луи Брайл', n: 'Специално училище за ученици с нарушено зрение Луи Брайл', b: [4.647, 4.92, 5.6, 5.31], m: [4.412, null, 5.71, 4.58], bu: [4, 6, 2, 3], mu: [4, null, 2, 3]};
s[86] = {l: 'Национално СУ', n: 'Национално СУ София', b: [4.037, 3.96, 4.04, 3.7], m: [4.24, null, 4.24, 4.27], bu: [49, 36, 37, 29], mu: [51, null, 37, 29]};
s[87] = {l: 'НГДЕК', n: 'Национална гимназия за древни езици и култури', b: [5.426, 5.18, 5.3, 5.36], m: [5.454, null, 5.23, 5.24], bu: [94, 93, 73, 70], mu: [94, null, 73, 70]};
s[88] = {l: 'НМУ', n: 'Национално музикално училище', b: [4.621, 4.48, 4.62, 4.74], m: [4.993, null, 4.64, 5.07], bu: [71, 68, 68, 62], mu: [22, null, 31, 32]};
s[89] = {l: 'НПМГ', n: 'НПМГ Акад. Любомир Чакалов', b: [5.143, 5.19, 5.28, 5.17], m: [5.537, null, 5.49, 5.4], bu: [235, 237, 234, 237], mu: [234, null, 234, 238]};
s[90] = {l: 'НУКК', n: 'НУКК (Италиански лицей)', b: [5.062, 4.92, 5.2, 5.17], m: [5.562, null, 5.38, 5.22], bu: [54, 51, 49, 50], mu: [54, null, 49, 50]};
s[91] = {l: 'ПГ за изобр. изкуства', n: 'ПГ за изобразителни изкуства', b: [4.19, 3.92, 4.28, 4.34], m: [3.45, null, null, 4.18], bu: [29, 22, 26, 29], mu: [1, null, null, 2]};
s[92] = {l: 'ПГ Княгиня Евдокия', n: 'Софийска ПГ Княгиня Евдокия', b: [3.772, 3.51, 3.52, 3.45], m: [3.952, null, 3.44, 3.81], bu: [48, 61, 42, 39], mu: [13, null, 11, 3]};
s[93] = {l: 'ПГ по аудио, видео и телек.', n: 'ПГ по аудио, видое и телекомуникация', b: [3.926, 3.72, 3.97, 3.79], m: [4.365, null, 4.12, 4.12], bu: [147, 135, 98, 123], mu: [142, null, 92, 77]};
s[94] = {l: 'ПГ по дизайн', n: 'ПГ по дизайн Елисавета Вазова', b: [4.233, 3.93, 4.21, 4.19], m: [4.415, null, 4.03, 4.82], bu: [56, 82, 62, 50], mu: [10, null, 25, 5]};
s[95] = {l: 'ПГ по екол. и биот.', n: 'ПГ по екология и биотехнологии', b: [4.262, 4.26, 4.29, 4.21], m: [4.418, null, 4.43, 4.09], bu: [64, 46, 49, 50], mu: [63, null, 48, 36]};
s[96] = {l: 'ПГ по електроника', n: 'ПГ по електроника Джон Атанасов', b: [4.483, 4.4, 4.58, 4.58], m: [4.972, null, 4.85, 4.67], bu: [193, 205, 186, 225], mu: [192, null, 187, 223]};
s[97] = {l: 'ПГ по електрот. и авт.', n: 'ПГ по електротехника и автоматика', b: [4.079, 4.04, 4.18, 4.09], m: [4.627, null, 4.58, 4.52], bu: [115, 124, 134, 132], mu: [113, null, 102, 75]};
s[98] = {l: 'ПГ по жел. трансп.', n: 'ПГ по железопътен транспорт', b: [3.298, 3.3, 3.2, null], m: [3.087, null, 3.35, null], bu: [28, 30, 15, null], mu: [21, null, 6, null]};
s[99] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.504, 3.3, 3.23, 3.47], m: [3.628, null, 3.38, 3.87], bu: [77, 51, 29, 46], mu: [79, null, 31, 46]};
s[100] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [4.077, 4.06, 3.87, 4.02], m: [4.455, null, 4.58, 3.62], bu: [40, 51, 42, 42], mu: [19, null, 5, 9]};
s[101] = {l: 'ПГ по под/стр/тр. техн.', n: 'ПГ по подемна, строителна и транспортна техника', b: [3.433, 3.34, 3.09, 3.18], m: [3.496, null, 2.8, 3.82], bu: [43, 54, 27, 32], mu: [43, null, 6, 8]};
s[102] = {l: 'ПГ по полигр. и фотогр.', n: 'ПГ по полиграфия и фотография', b: [4.771, 4.57, 4.36, 4.57], m: [null, null, null, 3.14], bu: [126, 111, 108, 135], mu: [null, null, null, 1]};
s[103] = {l: 'ПГ по прец. техн. и опт.', n: 'ПГ по прецизна техника и оптика', b: [4.432, 4.25, 4.52, 4.42], m: [4.861, null, 4.56, 4.65], bu: [226, 200, 195, 181], mu: [183, null, 177, 166]};
s[104] = {l: 'ПГ по с. стоп.', n: 'ПГ по селско стопанство', b: [3.106, 2.67, 2.92, 3.12], m: [2.76, null, 2.57, 3.67], bu: [3, 5, 6, 13], mu: [3, null, 1, 2]};
s[105] = {l: 'ПГ по текстил', n: 'ПГ по текстилни и кожени изделия', b: [2.91, 2.87, 2.72, 3.08], m: [3.092, null, 2.85, 3.26], bu: [21, 20, 17, 13], mu: [21, null, 4, 2]};
s[106] = {l: 'ПГ по телекомуникации', n: 'ПГ по телекомуникации', b: [4.151, 4.23, 4.33, 4.25], m: [4.921, null, 4.66, 4.67], bu: [126, 142, 157, 181], mu: [123, null, 149, 165]};
s[107] = {l: 'ПГ по трансп. и енерг.', n: 'ПГ по транспорт и енергетика', b: [3.948, 3.71, 3.81, 3.6], m: [4.107, null, 3.99, 3.87], bu: [143, 154, 114, 126], mu: [102, null, 84, 72]};
s[108] = {l: 'ПГ по трансп. Макгахан', n: 'ПГ по транспорт Макгахан', b: [3.387, 3.32, 3.49, 3.54], m: [3.529, null, 3.72, 3.68], bu: [87, 59, 62, 52], mu: [84, null, 50, 48]};
s[109] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.525, 3.42, 3.37, 3.36], m: [3.721, null, 3.56, 3.67], bu: [26, 51, 40, 41], mu: [28, null, 34, 35]};
s[110] = {l: 'ПГ по туризъм', n: 'Софийска ПГ по туризъм', b: [4.499, 4.34, 4.26, 4.22], m: [4.58, null, 4.57, 4.7], bu: [171, 178, 167, 174], mu: [61, null, 40, 39]};
s[111] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хранително-вкусови технологии', b: [3.624, 3.49, 3.34, 3.56], m: [3.9, null, 3.68, 3.92], bu: [44, 40, 41, 60], mu: [40, null, 16, 20]};
s[112] = {l: 'ПГТ - Банкя', n: 'ПГ по туризъм А. Константинов', b: [3.771, 3.54, 3.65, 3.71], m: [4.083, null, 4.3, 4.38], bu: [137, 121, 83, 91], mu: [115, null, 24, 9]};
s[113] = {l: 'Румънска гимназия', n: 'Румънска гимназия Михай Еминеску', b: [3.962, 4.42, 4.71, 4.72], m: [4.248, null, 4.68, 4.82], bu: [15, 16, 24, 26], mu: [15, null, 24, 26]};
s[114] = {l: 'СМГ', n: 'СМГ Паисий Хилендарски', b: [5.517, 5.44, 5.48, 5.42], m: [5.828, null, 5.74, 5.68], bu: [186, 170, 165, 169], mu: [186, null, 165, 169]};
s[115] = {l: 'Сменно-вечерна гимназия', n: 'IV сменно-вечерна гимназия', b: [3.763, 3.79, 3.84, 3.76], m: [3.946, null, 3.98, 3.91], bu: [90, 78, 72, 96], mu: [89, null, 73, 97]};
s[116] = {l: 'Сп. у-ще В. Левски', n: '166 спортно у-ще Васил Левски', b: [3.761, 3.46, 3.85, 3.69], m: [4.436, null, 3.84, 4.29], bu: [85, 80, 83, 91], mu: [16, null, 28, 9]};
s[117] = {l: 'Сп. у-ще ген. В. Стойчев', n: 'Спортно у-ще ген. Владимир Стойчев', b: [3.859, 3.72, 3.88, 3.77], m: [4.091, null, 4.2, 4.12], bu: [87, 105, 98, 99], mu: [74, null, 47, 53]};
s[118] = {l: 'Сп. у-ще Неофит Рилски', n: '153 спортно у-ще Неофит Рилски', b: [3.478, 3.36, 3.55, 3.4], m: [null, null, 3.15, 3.69], bu: [25, 42, 51, 50], mu: [null, null, 2, 6]};
s[119] = {l: 'Сп. у-ще Св. Наум', n: '57 спортно училище Св. Наум Охридски', b: [3.549, 3.34, 3.49, 3.5], m: [4.014, null, 3.67, 4.03], bu: [81, 68, 80, 75], mu: [20, null, 37, 18]};
s[120] = {l: 'СУ Св. Иван Рилски', n: 'СУ Св. Иван Рилски', b: [null, 3.24, 3.36, 3.57], m: [null, null, 3.29, 3.42], bu: [null, 3, 4, 2], mu: [null, null, 3, 2]};
s[121] = {l: 'ТУЕС', n: 'ТУЕС към Технически Университет', b: [4.916, 4.9, 5.06, 5.11], m: [5.604, null, 5.27, 5.22], bu: [96, 98, 98, 92], mu: [97, null, 98, 91]};
s[122] = {l: 'Търговско-банкова гимназия', n: 'Търговско-банкова гимназия', b: [5.026, 4.82, 5.0, 4.87], m: [5.258, null, 5.0, 4.85], bu: [255, 251, 236, 256], mu: [168, null, 74, 70]};
s[123] = {l: 'У-ще за изящни изкуства', n: 'Училище за изящни изкуства', b: [4.491, 4.55, 4.62, 4.64], m: [5.93, null, 4.88, 4.03], bu: [51, 54, 51, 53], mu: [1, null, 2, 5]};
s[124] = {l: 'У-ще за танцово изкуство', n: 'Училище за танцово изкуство', b: [4.154, 4.14, 4.37, 4.45], m: [3.396, null, null, null], bu: [59, 62, 57, 65], mu: [3, null, null, null]};
s[125] = {l: 'У-ще за ученици с увр. слух', n: 'Специално училище за ученици с увреден слух', b: [3.048, 2.78, null, 2.35], m: [2.64, null, null, null], bu: [10, 5, null, 4], mu: [1, null, null, null]};
s[126] = {l: 'Финансово-стопанска гимназия', n: 'Финансово-стопанска гимназия', b: [5.108, 5.09, 5.05, 4.85], m: [5.351, null, 4.97, 4.94], bu: [176, 185, 196, 207], mu: [159, null, 174, 150]};
// София - частни училища
s[127] = {l: 'Абрахам Линкълн', n: 'ЧСУ с чуждоезиков профил Абрахам Линкълн', b: [null, null, 4.67, null], m: [null, null, 5.49, null], bu: [null, null, 3, null], mu: [null, null, 3, null]};
s[128] = {l: 'Американски колеж', n: 'Американски колеж', b: [5.546, 5.51, 5.59, 5.52], m: [5.934, null, 5.74, 5.67], bu: [141, 151, 154, 161], mu: [141, null, 154, 162]};
s[129] = {l: 'Банкер', n: 'ЧПГ Банкер', b: [4.867, 4.71, 4.64, 4.63], m: [null, null, null, null], bu: [11, 6, 13, 12], mu: [null, null, null, null]};
s[130] = {l: 'Банково дело', n: 'ЧПГ по банково дело търговия и финанси', b: [4.187, 4.07, 4.07, null], m: [5.018, null, 4.46, null], bu: [11, 9, 7, null], mu: [11, null, 2, null]};
s[131] = {l: 'Британика', n: 'ЧСЕУ Британика', b: [4.431, 4.77, 4.51, 4.74], m: [5.038, null, 5.27, 4.78], bu: [16, 19, 15, 13], mu: [16, null, 15, 13]};
s[132] = {l: 'В. Златарски', n: 'ЧЕГ Проф. д-р В. Златарски', b: [5.003, 5.18, 5.09, 4.91], m: [5.82, null, 5.64, 5.54], bu: [45, 49, 44, 41], mu: [45, null, 44, 41]};
s[133] = {l: 'Веда', n: 'ЧСУ с немски език Веда', b: [5.045, 5.01, 4.7, 5.15], m: [5.637, null, 5.16, 5.42], bu: [11, 14, 8, 11], mu: [11, null, 8, 11]};
s[134] = {l: 'Дорис Тенеди', n: 'ЧЕСУ Дорис Тенеди', b: [5.341, 5.46, 5.3, 5.15], m: [5.726, null, 5.73, 5.44], bu: [36, 31, 22, 27], mu: [36, null, 22, 27]};
s[135] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [4.659, 4.54, 4.62, 4.48], m: [5.383, null, 4.93, 4.87], bu: [46, 48, 23, 30], mu: [46, null, 23, 30]};
s[136] = {l: 'Езиков свят', n: 'ЧПГ с чуждоезиково обучение Езиков свят', b: [4.284, 4.15, 4.01, 4.63], m: [5.317, null, 4.21, 4.96], bu: [9, 11, 7, 14], mu: [9, null, 7, 14]};
s[137] = {l: 'Ерих Кестнер', n: 'ЧНГ Ерих Кестнер', b: [5.249, 5.25, 5.39, 5.1], m: [5.507, null, 5.46, 5.33], bu: [18, 14, 10, 15], mu: [18, null, 10, 15]};
s[138] = {l: 'Иван Апостолов', n: 'ЧЕГ Проф. Иван Апостолов', b: [4.902, 5.12, 4.89, 5.14], m: [5.838, null, 5.54, 5.67], bu: [31, 32, 37, 38], mu: [31, null, 38, 38]};
s[139] = {l: 'Икономика, туризъм и информатика', n: 'ЧПГ по икономика, туризъм и информатика', b: [4.09, 3.85, 3.91, 3.66], m: [4.061, null, null, null], bu: [8, 7, 10, 12], mu: [8, null, null, null]};
s[140] = {l: 'Меридиан 22', n: 'ЧПГ Меридиан 22', b: [5.167, 5.13, 5.37, 5.04], m: [5.6, null, 5.61, 5.46], bu: [14, 17, 10, 24], mu: [14, null, 10, 24]};
s[141] = {l: 'Обр. технологии', n: 'ЧПГ Образователни технологии', b: [4.561, 4.25, 4.59, 4.44], m: [5.383, null, 4.71, 4.89], bu: [30, 18, 45, 39], mu: [30, null, 45, 39]};
s[142] = {l: 'Орфей', n: 'ЧСУ Орфей', b: [3.965, 3.78, 3.74, 4.13], m: [4.672, null, 4.84, 4.75], bu: [4, 10, 6, 4], mu: [5, null, 5, 4]};
s[143] = {l: 'ПЧАГ', n: 'Първа частна английска гимназия', b: [4.523, 4.53, 4.49, 4.37], m: [5.465, null, 5.17, 5.06], bu: [26, 30, 16, 28], mu: [26, null, 15, 28]};
s[144] = {l: 'ПЧМГ', n: 'Първа Частна Математическа Гимназия', b: [null, 5.41, 5.55, 5.45], m: [null, null, 5.78, 5.78], bu: [null, 23, 18, 14], mu: [null, null, 18, 14]};
s[145] = {l: 'Рьорих', n: 'ЧСУ Рьорих', b: [4.14, null, 4.47, 4.06], m: [4.86, null, 4.55, 4.41], bu: [9, null, 9, 5], mu: [9, null, 9, 5]};
s[146] = {l: 'Св. Георги', n: 'ЧСУ Свети Георги', b: [null, null, null, 4.45], m: [null, null, null, 5.86], bu: [null, null, null, 3], mu: [null, null, null, 3]};
s[147] = {l: 'Св. Наум', n: 'ЧПСУ Свети Наум', b: [4.636, 4.35, 4.55, 3.73], m: [5.46, null, 4.61, 3.26], bu: [3, 7, 4, 3], mu: [3, null, 5, 3]};
s[148] = {l: 'Увекинд', n: 'ЧСУ Увекинд', b: [4.826, 4.8, 5.15, 4.83], m: [5.65, null, 5.65, 5.63], bu: [20, 9, 21, 12], mu: [20, null, 21, 12]};
s[149] = {l: 'Цар Симеон Велики', n: 'ЧСУ Цар Симеон Велики', b: [null, 4.28, 3.81, 5.21], m: [null, null, 4.61, 5.27], bu: [null, 4, 1, 6], mu: [null, null, 1, 6]};

// Пловдив - индексация
si['Пловдив'] = {n: [301, 341], p: [342, 345]};
// Пловдив - държавни училища
s[301] = {l: 'Духовна семинария', n: 'Пловдивска духовна семинария', b: [4.09, 3.69, 4.17, 3.8], m: [3.952, null, 3.73, 3.45], bu: [11, 10, 8, 9], mu: [11, null, 11, 10]};
s[302] = {l: 'ЕГ Иван Вазов', n: 'ЕГ Иван Вазов', b: [5.512, 5.34, 5.4, 5.3], m: [5.382, null, 5.2, 5.18], bu: [221, 239, 237, 235], mu: [222, null, 237, 235]};
s[303] = {l: 'ЕГ Пловдив', n: 'ЕГ Пловдив', b: [5.6, 5.5, 5.43, 5.34], m: [5.846, null, 5.62, 5.47], bu: [288, 265, 266, 270], mu: [288, null, 266, 270]};
s[304] = {l: 'МГ Акад. Кирил Попов', n: 'МГ Акад. Кирил Попов', b: [5.274, 5.24, 5.26, 5.18], m: [5.337, null, 5.25, 5.17], bu: [214, 205, 212, 212], mu: [209, null, 210, 209]};
s[305] = {l: 'НУМТИ', n: 'НУМТИ Добрин Петков', b: [4.772, 4.58, 4.58, 4.57], m: [4.915, null, 4.73, 4.37], bu: [38, 37, 26, 26], mu: [11, null, 9, 2]};
s[306] = {l: 'ПГ по арх., строит. и геод.', n: 'ПГ по архитектура строителство и геодезия', b: [4.486, 4.18, 4.27, 4.25], m: [4.399, null, 4.2, 4.2], bu: [201, 181, 188, 190], mu: [161, null, 170, 166]};
s[307] = {l: 'ПГ по битова техника', n: 'ПГ по битова техника', b: [3.849, 3.69, 3.64, 3.65], m: [4.235, null, 3.99, 4.03], bu: [91, 91, 78, 81], mu: [89, null, 66, 70]};
s[308] = {l: 'ПГ по вътр. арх. и дърв.', n: 'ПГ по вътрешна архитектура и дървообработване', b: [3.601, 3.28, 3.56, 3.53], m: [3.412, null, 3.43, 3.79], bu: [45, 40, 41, 24], mu: [14, null, 12, 8]};
s[309] = {l: 'ПГ по електрот. и електрон.', n: 'ПГ по електротехника и електроника', b: [4.415, 4.01, 4.02, 4.31], m: [4.67, null, 4.31, 4.44], bu: [187, 183, 169, 202], mu: [160, null, 151, 180]};
s[310] = {l: 'ПГ по кожени изедлия', n: 'ПГ по кожени изделия и текстил Д-р Иван Богоров', b: [2.946, 2.68, 2.72, 3.47], m: [3.193, null, 3.29, 3.52], bu: [13, 10, 15, 14], mu: [13, null, 10, 10]};
s[311] = {l: 'ПГ по машиностроене', n: 'ПГ по машиностроене', b: [3.026, 2.99, 3.12, 3.05], m: [2.752, null, 2.84, 3.01], bu: [33, 29, 29, 21], mu: [4, null, 1, 4]};
s[312] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [3.765, 3.56, 3.62, 3.65], m: [4.035, null, 3.8, 4.0], bu: [106, 102, 89, 93], mu: [107, null, 77, 47]};
s[313] = {l: 'ПГ по облекло', n: 'ПГ по облекло Ана Май', b: [3.675, 3.58, 3.56, 3.81], m: [3.31, null, 3.49, 3.75], bu: [68, 81, 41, 47], mu: [2, null, 4, 12]};
s[314] = {l: 'ПГ по строит. техн.', n: 'ПГ по строителни технологии Пеньо Пенев', b: [3.114, 3.07, 2.97, null], m: [2.997, null, 3.05, null], bu: [29, 29, 17, null], mu: [29, null, 17, null]};
s[315] = {l: 'ПГ по трансп. и стр. техн.', n: 'ПГ по транспорт и строителни технологии', b: [3.493, 3.21, 3.16, 3.2], m: [3.446, null, 3.33, 3.33], bu: [106, 86, 86, 77], mu: [28, null, 88, 75]};
s[316] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Проф д-р Асен Златаров', b: [4.29, 4.08, 4.17, 4.04], m: [4.242, null, 4.12, 4.04], bu: [183, 158, 177, 146], mu: [167, null, 81, 45]};
s[317] = {l: 'ПГ по хр. техн. и техника', n: 'ПГ по хранителни технологии и техника', b: [4.007, 3.86, 4.05, 4.02], m: [4.105, null, 4.16, 3.8], bu: [139, 131, 104, 130], mu: [68, null, 30, 34]};
s[318] = {l: 'Сп. у-ще Васил Левски', n: 'Спортно училище Васил Левски', b: [3.907, 3.74, 3.82, 3.74], m: [4.341, null, 4.23, 4.92], bu: [92, 65, 78, 70], mu: [26, null, 15, 10]};
s[319] = {l: 'СУ Братя Миладинови', n: 'СУ Братя Миладинови', b: [3.342, 3.34, 3.17, 3.45], m: [3.589, null, 3.47, 3.48], bu: [28, 38, 27, 26], mu: [30, null, 25, 25]};
s[320] = {l: 'СУ Димитър Матевски', n: 'СУ Димитър Матевски', b: [3.704, 3.82, 3.81, 3.71], m: [3.79, null, 3.65, 3.95], bu: [16, 19, 12, 21], mu: [15, null, 14, 23]};
s[321] = {l: 'СУ К. Величков', n: 'СУ Константин Величков', b: [4.246, 4.02, 3.97, 3.93], m: [3.691, null, 4.24, 3.95], bu: [16, 27, 31, 16], mu: [16, null, 30, 17]};
s[322] = {l: 'СУ Любен Каравелов', n: 'СУ Любен Каравелов', b: [3.892, 4.16, 3.73, 4.27], m: [3.728, null, 3.7, 3.96], bu: [23, 20, 13, 18], mu: [24, null, 13, 18]};
s[323] = {l: 'СУ Найден Геров', n: 'СУ Найден Геров', b: [3.13, 3.01, 2.73, 3.19], m: [3.398, null, 2.97, 3.4], bu: [16, 21, 18, 20], mu: [15, null, 13, 17]};
s[324] = {l: 'СУ Никола Вапцаров', n: 'СУ Никола Вапцаров', b: [3.502, 3.39, 3.2, 3.56], m: [3.686, null, 3.1, 3.7], bu: [5, 17, 17, 18], mu: [6, null, 17, 18]};
s[325] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [4.048, 3.83, 3.91, 3.86], m: [4.192, null, 3.99, 4.15], bu: [68, 99, 59, 73], mu: [66, null, 61, 72]};
s[326] = {l: 'СУ Св. К. Кирил Философ', n: 'СУ Св. К. Кирил Философ', b: [4.372, 4.12, 3.96, 3.79], m: [4.247, null, 4.24, 4.14], bu: [20, 27, 25, 21], mu: [20, null, 26, 23]};
s[327] = {l: 'СУ Св. Климент Охридски', n: 'СУ Св. Климент Охридски', b: [4.15, 4.13, 4.01, 4.2], m: [4.702, null, 4.25, 4.26], bu: [51, 55, 69, 75], mu: [51, null, 68, 73]};
s[328] = {l: 'СУ Св. П. Хилендарски', n: 'СУ Св. П. Хилендарски', b: [4.389, 4.24, 4.22, 4.45], m: [4.709, null, 4.32, 4.62], bu: [94, 101, 92, 102], mu: [94, null, 92, 101]};
s[329] = {l: 'СУ Св. Патриарх Евтимий', n: 'СУ Св. Патриарх Евтимий', b: [4.839, 4.69, 4.94, 4.64], m: [4.902, null, 4.75, 4.69], bu: [114, 113, 115, 114], mu: [115, null, 115, 114]};
s[330] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.137, 3.69, 4.11, 3.7], m: [4.099, null, 4.16, 3.95], bu: [58, 63, 46, 33], mu: [58, null, 46, 33]};
s[331] = {l: 'СУ Св. Седмочисленици', n: 'СУ Св. Седмочисленици', b: [3.719, 3.53, 3.64, 3.52], m: [3.814, null, 3.65, 3.83], bu: [23, 24, 20, 20], mu: [24, null, 23, 20]};
s[332] = {l: 'СУ Св. Софроний Врачански', n: 'СУ Св. Софроний Врачански', b: [4.01, 4.18, 4.27, 4.44], m: [3.9, null, 4.64, 4.32], bu: [1, 25, 13, 16], mu: [1, null, 13, 17]};
s[333] = {l: 'СУ Христо Г. Данов', n: 'СУ Христо Груев Данов', b: [4.117, 3.64, 3.68, 3.72], m: [3.91, null, 3.96, 3.84], bu: [16, 11, 16, 14], mu: [16, null, 16, 15]};
s[334] = {l: 'СУ Цар Симеон Велики', n: 'СУ Цар Симеон Велики', b: [4.507, null, 3.9, 3.56], m: [4.872, null, 4.36, 4.01], bu: [27, null, 38, 23], mu: [27, null, 37, 23]};
s[335] = {l: 'СУ Черноризец Храбър', n: 'СУ Черноризец Храбър', b: [4.525, 4.33, 4.32, 4.23], m: [4.363, null, 4.44, 4.61], bu: [42, 35, 32, 36], mu: [43, null, 32, 36]};
s[336] = {l: 'Сценични и екранни изкуства', n: 'Гимназия за сценични и екранни изкуства', b: [4.227, 4.26, 4.36, 4.08], m: [null, null, 5.01, 3.39], bu: [42, 44, 50, 36], mu: [null, null, 3, 3]};
s[337] = {l: 'Търговска гимназия', n: 'Търговска гимназия - Пловдив', b: [5.418, 4.99, 5.24, 5.08], m: [5.401, null, 5.29, 5.14], bu: [202, 219, 203, 215], mu: [88, null, 94, 120]};
s[338] = {l: 'У-ще за ученици с увр. слух', n: 'Специално училище за ученици с увреден слух', b: [3.15, 2.74, null, 3.31], m: [null, null, null, null], bu: [4, 5, null, 1], mu: [null, null, null, null]};
s[339] = {l: 'Френска ЕГ', n: 'Френска ЕГ Антоан дьо Сент - Екзюпери', b: [5.089, 4.95, 4.97, 4.74], m: [5.113, null, 4.89, 4.92], bu: [208, 214, 199, 200], mu: [208, null, 199, 198]};
s[340] = {l: 'Художествена гимназия', n: 'Художествена гимназия Цанко Лавренов', b: [4.671, 4.44, 4.6, 4.39], m: [null, null, null, null], bu: [47, 47, 41, 59], mu: [null, null, null, null]};
s[341] = {l: 'Хуманитарна гимназия', n: 'Хуманитарна гимназия Св. Св. Кирил и Методий', b: [5.128, 5.09, 5.11, 5.08], m: [5.183, null, 5.01, 5.12], bu: [198, 180, 188, 181], mu: [198, null, 188, 181]};
// Пловдив - частни училища
s[342] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [4.171, 4.94, 4.62, 4.52], m: [4.585, null, 5.11, 4.51], bu: [9, 12, 18, 11], mu: [9, null, 18, 11]};
s[343] = {l: 'Икономика и управление', n: 'ЧПГ по икономика и управление', b: [4.018, 4.28, 4.4, 3.69], m: [4.753, null, 5.19, 4.49], bu: [9, 5, 4, 7], mu: [3, null, 2, 3]};
s[344] = {l: 'Класик', n: 'ЧПГ Класик', b: [4.438, 4.72, 4.18, 4.25], m: [4.993, null, 4.73, 4.41], bu: [17, 15, 17, 17], mu: [16, null, 17, 19]};
s[345] = {l: 'Стоян Сариев', n: 'ЧЕГ Стоян Сариев', b: [4.89, 4.37, 4.16, 4.39], m: [5.192, null, 5.17, 4.92], bu: [16, 15, 6, 11], mu: [16, null, 6, 11]};

// Варна - индексация
si['Варна'] = {n: [401, 428], p: [429, 433]};
// Варна - държавни училища
s[401] = {l: '1 ЕГ', n: '1 ЕГ ', b: [5.499, 5.34, 5.39, 5.58], m: [5.848, null, 5.63, 5.63], bu: [239, 236, 237, 227], mu: [238, null, 237, 227]};
s[402] = {l: '3 ПМГ', n: '3 ПМГ Акад. Методий Попов', b: [4.831, 4.63, 4.79, 4.94], m: [5.119, null, 4.78, 4.96], bu: [140, 135, 134, 134], mu: [140, null, 134, 134]};
s[403] = {l: '4 ЕГ', n: '4 ЕГ Фредерик Жолио - Кюри', b: [5.303, 5.13, 5.12, 5.15], m: [5.353, null, 5.18, 5.22], bu: [194, 200, 211, 216], mu: [194, null, 211, 216]};
s[404] = {l: '7 СУ', n: '7 СУ Найден Геров', b: [4.12, 3.75, 3.75, 4.02], m: [4.342, null, 4.09, 4.4], bu: [72, 76, 69, 47], mu: [72, null, 69, 49]};
s[405] = {l: 'Варненска морска гимназия', n: 'Варненска морска гимназия', b: [3.777, 3.54, 3.7, 3.75], m: [3.968, null, 4.08, 4.09], bu: [85, 112, 86, 35], mu: [57, null, 62, 15]};
s[406] = {l: 'Варненска търг. гимназия', n: 'Варненска търговска гимназия', b: [4.792, 4.49, 4.75, 4.57], m: [4.848, null, 4.65, 4.51], bu: [162, 127, 122, 134], mu: [83, null, 98, 100]};
s[407] = {l: 'ГПЧЕ Йоан Екзарх', n: 'ГПЧЕ Йоан Екзарх', b: [5.457, 5.38, 5.39, 5.4], m: [5.51, null, 5.41, 5.32], bu: [180, 184, 179, 180], mu: [180, null, 179, 180]};
s[408] = {l: 'МГ Д-р Петър Берон', n: 'МГ Д-р Петър Берон', b: [5.29, 5.14, 5.29, 5.37], m: [5.533, null, 5.53, 5.43], bu: [222, 203, 210, 202], mu: [221, null, 210, 202]};
s[409] = {l: 'НУИ Добри Христов', n: 'НУИ Добри Христов', b: [4.44, 4.43, 4.61, 4.27], m: [4.832, null, 4.64, 4.51], bu: [68, 54, 61, 63], mu: [17, null, 8, 18]};
s[410] = {l: 'ПГ по горско стопанство', n: 'ПГ по горско стопанство и дървообр.', b: [3.503, 3.31, 3.18, 3.31], m: [3.559, null, 3.3, 2.81], bu: [85, 76, 52, 48], mu: [30, null, 11, 5]};
s[411] = {l: 'ПГ по електротехника', n: 'ПГ по електротехника', b: [4.014, 3.79, 3.81, 3.81], m: [3.99, null, 4.17, 4.16], bu: [118, 100, 118, 105], mu: [84, null, 90, 87]};
s[412] = {l: 'ПГ по икономика', n: 'ПГ по икономика Д-р Иван Богоров', b: [4.374, 4.17, 4.38, 4.08], m: [4.385, null, 4.13, 4.31], bu: [160, 149, 136, 131], mu: [130, null, 56, 74]};
s[413] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство архитектура и геодезия', b: [3.948, 3.78, 3.77, 3.57], m: [3.719, null, 3.69, 3.67], bu: [73, 96, 70, 48], mu: [70, null, 38, 20]};
s[414] = {l: 'ПГ по текстил и моден дизайн', n: 'ПГ по текстил и моден дизайн', b: [3.681, 3.63, 3.65, 3.51], m: [3.695, null, 3.87, 3.89], bu: [67, 75, 36, 24], mu: [19, null, 12, 9]};
s[415] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [4.414, 4.27, 4.27, 4.25], m: [4.832, null, 4.84, 4.74], bu: [157, 182, 161, 175], mu: [50, null, 20, 22]};
s[416] = {l: 'ПГ по хим. и хр.-вк. техн.', n: 'ПГ по химични и хранително-вкусови технологии', b: [3.7, 3.83, 3.69, 3.52], m: [3.856, null, 3.99, 3.67], bu: [49, 24, 20, 23], mu: [49, null, 18, 23]};
s[417] = {l: 'Проф. техн. гимназия', n: 'Професионална техническа гимназия', b: [3.844, 3.72, 3.71, 3.67], m: [4.099, null, 4.04, 4.02], bu: [149, 161, 144, 139], mu: [67, null, 48, 18]};
s[418] = {l: 'Сп. у-ще Г. Бенковски', n: 'Спортно у-ще Г. Бенковски', b: [3.718, 3.69, 3.74, 3.69], m: [4.413, null, 3.93, 4.78], bu: [82, 58, 63, 69], mu: [21, null, 11, 12]};
s[419] = {l: 'Спец. у-ще за уч. с нар. зр.', n: 'Специално у-ще за ученици с нарушено зрение', b: [4.176, null, 4.12, null], m: [4.16, null, 4.47, null], bu: [9, null, 8, null], mu: [9, null, 8, null]};
s[420] = {l: 'СУ Ал. С. Пушкин', n: 'СУ Ал. С. Пушкин', b: [4.76, 4.77, 4.66, 4.91], m: [4.96, null, 4.73, 5.0], bu: [122, 127, 120, 128], mu: [120, null, 120, 128]};
s[421] = {l: 'СУ Гео Милев', n: 'СУ Гео Милев', b: [4.156, 4.03, 4.12, 4.09], m: [4.603, null, 4.45, 4.44], bu: [41, 49, 30, 19], mu: [42, null, 32, 19]};
s[422] = {l: 'СУ Д. Дебелянов', n: 'СУ Димчо Дебелянов', b: [4.041, null, 4.11, 4.41], m: [4.105, null, 4.13, 4.41], bu: [39, null, 27, 46], mu: [40, null, 26, 44]};
s[423] = {l: 'СУ Елин Пелин', n: 'СУ Елин Пелин', b: [3.708, 3.63, 3.24, 3.33], m: [3.921, null, 3.44, 3.54], bu: [11, 3, 10, 10], mu: [11, null, 9, 10]};
s[424] = {l: 'СУ за хуман. науки и изк.', n: 'СУ за хуманитарни науки и изкуства', b: [4.634, 4.65, 4.6, 4.63], m: [4.723, null, 4.64, 4.68], bu: [224, 187, 233, 207], mu: [225, null, 234, 206]};
s[425] = {l: 'СУ Л. Каравелов', n: 'СУ Л. Каравелов', b: [3.744, 3.55, 3.52, 3.68], m: [3.681, null, 3.48, 3.7], bu: [35, 27, 35, 27], mu: [34, null, 36, 26]};
s[426] = {l: 'СУ Неофит Бозавели', n: 'СУ Неофит Бозавели', b: [3.494, 3.2, 3.2, 3.39], m: [3.638, null, 3.27, 3.65], bu: [64, 43, 45, 41], mu: [65, null, 42, 44]};
s[427] = {l: 'СУ Пейо К. Яворов', n: 'СУ Пейо К. Яворов', b: [3.799, 3.78, 3.79, 3.7], m: [3.95, null, 3.5, 4.24], bu: [18, 22, 11, 22], mu: [16, null, 11, 22]};
s[428] = {l: 'СУ Св. Климент Охридски', n: 'СУ Св. Климент Охридски', b: [4.592, 4.39, 4.29, 4.28], m: [4.887, null, 4.9, 4.73], bu: [43, 47, 43, 49], mu: [45, null, 43, 49]};
// Варна - частни училища
s[429] = {l: 'А. Екзюпери', n: 'ЧПГ Антоан дьо Сент-Екзюпери', b: [4.856, 4.57, 4.66, 4.6], m: [5.469, null, 5.17, 5.04], bu: [13, 9, 13, 16], mu: [13, null, 13, 16]};
s[430] = {l: 'Джордж Байрон', n: 'ЧЕГ Джордж Байрон', b: [4.46, 4.09, 4.25, 4.14], m: [4.915, null, 5.08, 4.49], bu: [26, 20, 16, 11], mu: [26, null, 16, 11]};
s[431] = {l: 'Мария Монтесори', n: 'ЧСУ Мария Монтесори', b: [null, null, null, 4.87], m: [null, null, null, 5.14], bu: [null, null, null, 2], mu: [null, null, null, 2]};
s[432] = {l: 'Мечтатели', n: 'ЧСУ Мечтатели', b: [null, null, 3.95, null], m: [null, null, 3.11, null], bu: [null, null, 1, null], mu: [null, null, 1, null]};
s[433] = {l: 'Търговска гимназия', n: 'Частна Търговска Гимназия Конто Трейд', b: [4.08, 4.23, 3.98, 4.18], m: [4.254, null, 4.34, 4.32], bu: [5, 10, 6, 5], mu: [5, null, 7, 5]};

// Бургас - индексация
si['Бургас'] = {n: [501, 528], p: [529, 529]};
// Бургас - държавни училища
s[501] = {l: 'Английска ЕГ', n: 'Английска ЕГ Гео Милев', b: [5.224, 5.06, 5.06, 4.97], m: [5.775, null, 5.32, 5.43], bu: [167, 163, 163, 165], mu: [167, null, 163, 165]};
s[502] = {l: 'Вечерно СУ', n: 'Вечерно СУ Захари Стоянов', b: [3.575, 3.2, 3.37, 3.28], m: [3.524, null, 3.44, 3.49], bu: [37, 32, 37, 47], mu: [39, null, 37, 46]};
s[503] = {l: 'НЕГ Гьоте', n: 'Немска езикова гимназия Гьоте', b: [5.449, 5.28, 5.45, 5.36], m: [5.646, null, 5.57, 5.37], bu: [161, 159, 148, 156], mu: [161, null, 148, 156]};
s[504] = {l: 'НУМСИ', n: 'НУМСИ Проф. Панчо Владигеров', b: [4.747, 4.52, 4.65, 4.49], m: [4.978, null, 4.78, 4.54], bu: [28, 48, 49, 51], mu: [5, null, 18, 31]};
s[505] = {l: 'ПГ за романски езици', n: 'ПГ за романски езици', b: [5.022, 4.88, 4.93, 4.89], m: [5.095, null, 4.98, 5.13], bu: [176, 177, 172, 178], mu: [176, null, 172, 179]};
s[506] = {l: 'ПГ за чужди езици', n: 'ПГ за чужди езици Васил Левски', b: [4.712, 4.68, 4.78, 4.75], m: [5.111, null, 4.8, 4.81], bu: [158, 156, 149, 151], mu: [159, null, 148, 151]};
s[507] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване', b: [3.125, 3.09, 3.27, 3.24], m: [3.367, null, 3.53, 3.19], bu: [17, 25, 12, 14], mu: [18, null, 9, 13]};
s[508] = {l: 'ПГ по ел. и ел.', n: 'ПГ по електротехника и електроника', b: [3.843, 3.82, 3.72, 3.71], m: [4.195, null, 4.0, 4.29], bu: [128, 105, 64, 72], mu: [130, null, 57, 62]};
s[509] = {l: 'ПГ по м. кораб. и риб.', n: 'ПГ по морско корабоплаване и риболов', b: [3.662, 3.64, null, 3.25], m: [3.928, null, 3.53, null], bu: [15, 19, null, 23], mu: [15, null, 1, null]};
s[510] = {l: 'ПГ по мех. и електр.', n: 'ПГ по механоелектротехника и електроника', b: [4.247, 3.89, 4.02, 3.88], m: [4.234, null, 4.21, 4.17], bu: [180, 192, 153, 122], mu: [175, null, 141, 99]};
s[511] = {l: 'ПГ по сград. и инст.', n: 'ПГ по сградостроителство и инсталации', b: [3.04, 2.87, 2.72, 2.96], m: [3.037, null, 3.08, 2.92], bu: [14, 20, 19, 20], mu: [10, null, 12, 22]};
s[512] = {l: 'ПГ по стр., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [4.295, 4.14, 4.19, 4.16], m: [4.432, null, 4.18, 4.23], bu: [158, 150, 142, 154], mu: [147, null, 142, 148]};
s[513] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.258, 3.13, 2.93, 2.98], m: [3.437, null, 3.02, 3.14], bu: [74, 73, 27, 52], mu: [68, null, 28, 50]};
s[514] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [4.114, 3.98, 3.88, 3.99], m: [3.94, null, 4.11, 4.4], bu: [201, 213, 218, 148], mu: [199, null, 80, 42]};
s[515] = {l: 'ПГ по хим. техн.', n: 'ПГ по химични технологии', b: [3.902, 3.71, 3.9, 3.68], m: [4.07, null, 3.89, 3.7], bu: [145, 145, 101, 125], mu: [107, null, 58, 60]};
s[516] = {l: 'ППМГ', n: 'ППМГ Акад. Никола Обрешков', b: [5.489, 5.24, 5.33, 5.29], m: [5.766, null, 5.65, 5.51], bu: [157, 150, 158, 153], mu: [157, null, 158, 153]};
s[517] = {l: 'Проф. техн. гимназия', n: 'Професионална техническа гимназия', b: [3.46, 3.19, 3.06, 3.15], m: [2.99, null, 2.82, 3.67], bu: [9, 14, 24, 18], mu: [4, null, 4, 1]};
s[518] = {l: 'Спортно у-ще Ю. Гагарин', n: 'Спортно у-ще Юрий Гагарин', b: [3.456, 3.24, 3.43, 3.59], m: [2.911, null, 3.66, 3.92], bu: [50, 48, 39, 45], mu: [6, null, 17, 10]};
s[519] = {l: 'СУ Димчо Дебелянов', n: 'СУ Димчо Дебелянов', b: [3.766, 3.71, 3.45, 3.53], m: [4.103, null, 3.86, 3.89], bu: [19, 15, 17, 15], mu: [19, null, 16, 14]};
s[520] = {l: 'СУ Добри Чинтулов', n: 'СУ Добри Чинтулов', b: [3.517, 3.19, 3.34, 3.42], m: [3.699, null, 3.56, 3.6], bu: [26, 23, 22, 20], mu: [26, null, 22, 19]};
s[521] = {l: 'СУ Еп. К. Преславски', n: 'СУ Еп. К. Преславски', b: [3.885, 3.71, 3.72, 3.99], m: [4.115, null, 4.12, 4.05], bu: [47, 38, 23, 56], mu: [47, null, 21, 57]};
s[522] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [3.486, 3.16, 3.5, 3.21], m: [3.557, null, 3.79, 3.38], bu: [28, 3, 20, 16], mu: [27, null, 19, 17]};
s[523] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.186, 3.14, 3.62, 3.26], m: [3.448, null, 3.96, 3.22], bu: [6, 9, 8, 8], mu: [6, null, 8, 8]};
s[524] = {l: 'СУ Конст. Петканов', n: 'СУ Константин Петканов', b: [3.367, 3.12, 3.4, 2.84], m: [3.545, null, 3.43, 2.31], bu: [10, 4, 18, 1], mu: [10, null, 20, 1]};
s[525] = {l: 'СУ Петко Росен', n: 'СУ Петко Росен', b: [3.32, 3.08, 3.16, 3.29], m: [3.065, null, 3.22, 3.69], bu: [19, 20, 20, 21], mu: [4, null, 3, 4]};
s[526] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.192, 3.97, 3.79, 3.74], m: [4.668, null, 3.95, 4.35], bu: [87, 77, 43, 88], mu: [87, null, 43, 90]};
s[527] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [2.961, 2.97, 4.01, null], m: [2.854, null, 3.69, 2.73], bu: [6, 2, 2, null], mu: [5, null, 2, 2]};
s[528] = {l: 'Търговска гимназия', n: 'Търговска гимназия', b: [4.99, 4.74, 4.92, 4.77], m: [5.112, null, 4.9, 4.82], bu: [149, 152, 155, 152], mu: [135, null, 134, 102]};
// Бургас - частни училища
s[529] = {l: 'Британика', n: 'ЧПГ Британика', b: [4.309, 4.27, 4.68, 4.88], m: [4.895, null, 4.66, 4.28], bu: [12, 15, 8, 3], mu: [12, null, 8, 4]};

// Благоевград - индексация
si['Благоевград'] = {n: [601, 611], p: [612, 612]};
// Благоевград - държавни училища
s[601] = {l: 'ЕГ Акад. Л. Стоянов', n: 'ЕГ Акад. Людмил Стоянов', b: [5.259, 5.23, 5.4, 5.24], m: [5.433, null, 5.42, 5.4], bu: [150, 162, 155, 158], mu: [149, null, 155, 158]};
s[602] = {l: 'ПГ Ичко Бойчев', n: 'ПГ Ичко Бойчев', b: [3.353, 3.23, 3.15, 3.31], m: [3.61, null, 3.15, 3.32], bu: [53, 74, 30, 51], mu: [37, null, 34, 32]};
s[603] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [4.62, 4.36, 4.46, 4.46], m: [4.59, null, 4.16, 4.56], bu: [144, 150, 116, 130], mu: [23, null, 38, 47]};
s[604] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и геодезия', b: [4.137, 3.76, 3.74, 3.84], m: [3.943, null, 3.87, 4.01], bu: [63, 70, 70, 75], mu: [38, null, 64, 67]};
s[605] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм и лека промишленост', b: [3.464, 3.37, 3.27, 3.39], m: [3.21, null, 3.11, null], bu: [27, 37, 23, 30], mu: [2, null, 1, null]};
s[606] = {l: 'ПМГ Акад. С. Корольов', n: 'ПМГ Акад. Сергей Корольов', b: [5.225, 5.07, 5.02, 5.06], m: [5.559, null, 5.19, 5.22], bu: [151, 162, 160, 158], mu: [151, null, 160, 158]};
s[607] = {l: 'СУ Г. Измирлиев', n: '5 СУ Георги Измирлиев', b: [3.563, 3.65, 3.48, 3.6], m: [3.914, null, 3.83, 3.87], bu: [24, 30, 22, 20], mu: [25, null, 21, 20]};
s[608] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [null, null, 2.81, 2.04], m: [null, null, 3.14, 3.06], bu: [null, null, 1, 1], mu: [null, null, 1, 1]};
s[609] = {l: 'СУ К. Шапкарев', n: '7 СУ Кузман Шапкарев', b: [null, 3.71, 3.88, null], m: [null, null, 3.95, 2.44], bu: [null, 23, 16, null], mu: [null, null, 17, 1]};
s[610] = {l: 'СУИЧЕ', n: 'СУИЧЕ Св. Кл. Охридски', b: [4.208, 4.12, 4.02, 3.71], m: [4.439, null, 4.08, 4.07], bu: [52, 21, 39, 43], mu: [52, null, 39, 43]};
s[611] = {l: 'Хуманитарна гимн.', n: 'Национална хуманитарна гимназия', b: [4.521, 4.29, 4.43, 4.59], m: [4.43, null, 4.48, 4.66], bu: [91, 109, 101, 103], mu: [93, null, 103, 102]};
// Благоевград - частни училища
s[612] = {l: 'Димитър и Йоан', n: 'ЧСУ Димитър и Йоан', b: [3.406, 3.43, null, null], m: [3.363, null, null, null], bu: [6, 9, null, null], mu: [9, null, null, null]};

// Велико Търново - индексация
si['Велико Търново'] = {n: [701, 713], p: [714, 714]};
// Велико Търново - държавни училища
s[701] = {l: 'ЕГ', n: 'ЕГ. Проф. д-р Асен Златаров', b: [5.131, 5.0, 5.23, 4.99], m: [5.358, null, 5.16, 5.2], bu: [145, 143, 144, 152], mu: [145, null, 145, 153]};
s[702] = {l: 'ПГ по електроника', n: 'ПГ по електроника', b: [3.597, 3.36, 3.32, 3.46], m: [3.858, null, 3.41, 3.8], bu: [41, 34, 43, 31], mu: [39, null, 38, 31]};
s[703] = {l: 'ПГ по икономика', n: 'Старопрестолна ПГ по икономика', b: [4.51, 4.21, 4.39, 3.99], m: [4.437, null, 4.36, 4.66], bu: [75, 68, 53, 43], mu: [23, null, 23, 16]};
s[704] = {l: 'ПГ по моден дизайн', n: 'ПГ по моден дизайн', b: [3.491, 3.16, 3.49, 3.59], m: [null, null, 3.52, null], bu: [17, 24, 15, 6], mu: [null, null, 2, null]};
s[705] = {l: 'ПГ по строителство', n: 'ПГ по строителство архитектура и геодезия', b: [4.059, 3.87, 4.15, 4.06], m: [3.979, null, 4.06, 4.56], bu: [84, 96, 100, 86], mu: [63, null, 61, 19]};
s[706] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [3.982, 3.74, 4.11, 3.88], m: [3.939, null, 3.83, 3.89], bu: [75, 115, 88, 93], mu: [60, null, 52, 38]};
s[707] = {l: 'ПМГ В. Друмев', n: 'ПМГ Васил Друмев', b: [5.208, 5.11, 5.22, 5.03], m: [5.431, null, 5.3, 5.27], bu: [147, 133, 151, 157], mu: [146, null, 151, 157]};
s[708] = {l: 'Спортно у-ще', n: 'Спортно училище Героги Живков', b: [3.888, 3.54, 3.82, 3.79], m: [3.777, null, null, 4.35], bu: [38, 34, 31, 38], mu: [8, null, null, 1]};
s[709] = {l: 'СУ В. Благоева', n: 'СУ Вела Благоева', b: [3.653, 3.7, 4.29, 3.97], m: [3.505, null, 4.12, 4.6], bu: [17, 20, 26, 18], mu: [18, null, 27, 19]};
s[710] = {l: 'СУ В. Комаров', n: 'СУ Владимир Комаров', b: [3.563, 3.52, 3.62, 3.14], m: [3.569, null, 3.51, 3.24], bu: [16, 10, 11, 1], mu: [18, null, 11, 3]};
s[711] = {l: 'СУ Г. Раковски', n: 'СУ Георги Раковски', b: [3.224, 3.11, null, null], m: [3.466, null, 4.07, null], bu: [5, 3, null, null], mu: [5, null, 1, null]};
s[712] = {l: 'СУ Е. Станев', n: 'СУ Емилиян Станев', b: [4.563, 4.25, 4.55, 4.24], m: [4.918, null, 4.7, 4.74], bu: [78, 54, 67, 75], mu: [78, null, 67, 75]};
s[713] = {l: 'Хуманитарна гимн.', n: 'Профилирана Хуманитарна гимназия', b: [null, 4.13, 4.15, 3.52], m: [null, null, 4.08, null], bu: [null, 7, 10, 12], mu: [null, null, 9, null]};
// Велико Търново - частни училища
s[714] = {l: 'АК-Арукс', n: 'ЧПГ АК-Аркус', b: [4.985, 5.16, 5.49, 5.25], m: [5.541, null, 5.53, 5.34], bu: [37, 29, 27, 23], mu: [37, null, 27, 23]};

// Видин - индексация
si['Видин'] = {n: [801, 808], p: null};
// Видин - държавни училища
s[801] = {l: 'ГПЧЕ', n: 'ГПЧЕ Йордан Радичков', b: [5.115, 4.85, 5.07, 4.75], m: [5.396, null, 5.13, 5.28], bu: [95, 94, 97, 85], mu: [95, null, 97, 85]};
s[802] = {l: 'ПГ А. Златаров', n: 'ПГ Проф. д-р Асен Златаров', b: [4.118, 4.14, 4.3, 4.22], m: [4.154, null, 4.18, 3.99], bu: [119, 79, 88, 76], mu: [90, null, 66, 58]};
s[803] = {l: 'ПГТ', n: 'ПГТ Михалаки Георгиев', b: [3.512, 3.44, 3.49, 3.58], m: [3.585, null, 4.27, 3.79], bu: [69, 62, 64, 63], mu: [38, null, 9, 5]};
s[804] = {l: 'ППМГ', n: 'ППМГ Екзарх Антим I', b: [4.625, 4.53, 4.79, 4.56], m: [4.764, null, 4.78, 4.6], bu: [82, 101, 99, 76], mu: [82, null, 102, 75]};
s[805] = {l: 'ПТГ', n: 'ПТГ Васил Левски', b: [3.241, 3.57, 2.97, 3.2], m: [3.54, null, 2.53, null], bu: [9, 10, 14, 6], mu: [3, null, 1, null]};
s[806] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [3.748, 4.21, 4.12, 4.41], m: [3.818, null, 4.36, 4.38], bu: [13, 15, 19, 10], mu: [13, null, 19, 10]};
s[807] = {l: 'СУ П. Славейков', n: 'СУ Петко Рачов Славейков', b: [4.388, 3.56, 3.73, 3.7], m: [4.475, null, 3.91, 3.72], bu: [20, 16, 24, 17], mu: [20, null, 24, 16]};
s[808] = {l: 'СУ Цар Симеон', n: 'СУ Цар Симеон Велики', b: [4.772, 4.57, 4.24, 4.47], m: [4.905, null, 4.48, 4.67], bu: [71, 71, 49, 57], mu: [70, null, 50, 57]};

// Враца - индексация
si['Враца'] = {n: [901, 912], p: null};
// Враца - държавни училища
s[901] = {l: 'ЕГ', n: 'Профилирана ЕГ Йоан Екзарх', b: [4.952, 4.32, 4.65, 4.69], m: [5.161, null, 5.02, 5.19], bu: [84, 86, 46, 50], mu: [84, null, 46, 50]};
s[902] = {l: 'ПГ Д. Хаджитошин', n: 'ПГ Димитраки Хаджитошин', b: [3.26, 3.05, 3.22, 3.36], m: [2.786, null, 3.39, 3.66], bu: [17, 6, 16, 15], mu: [8, null, 15, 13]};
s[903] = {l: 'ПГ по търговия', n: 'ПГ по търговия и ресторантьорство', b: [3.611, 3.64, 3.43, 3.48], m: [3.637, null, 3.64, 3.55], bu: [77, 61, 62, 68], mu: [10, null, 10, 14]};
s[904] = {l: 'ППМГ', n: 'ППМГ Акад. Иван Ценов', b: [5.141, 4.82, 4.93, 5.01], m: [5.303, null, 5.09, 5.13], bu: [173, 177, 164, 151], mu: [173, null, 164, 151]};
s[905] = {l: 'Спортно у-ще', n: 'Спортно у-ще Св. Климент Охридски', b: [3.691, 3.19, 3.56, 3.42], m: [3.805, null, 3.74, 3.84], bu: [32, 15, 41, 37], mu: [34, null, 40, 34]};
s[906] = {l: 'СУ Васил Кънчов', n: 'СУ Васил Кънчов', b: [4.048, 3.98, 4.55, 4.04], m: [3.949, null, 4.32, 4.46], bu: [49, 39, 47, 51], mu: [47, null, 47, 39]};
s[907] = {l: 'СУ Козма Тричков', n: 'СУ Козма Тричков', b: [4.253, 3.91, 4.14, 4.02], m: [4.241, null, 4.55, 4.48], bu: [53, 50, 51, 50], mu: [53, null, 51, 48]};
s[908] = {l: 'СУ Мито Орозов', n: 'СУ Мито Орозов', b: [null, 4.4, 3.02, 3.09], m: [null, null, 3.38, 3.59], bu: [null, 2, 2, 3], mu: [null, null, 2, 3]};
s[909] = {l: 'СУ Никола Войводов', n: 'СУ Никола Войводов', b: [4.292, 3.93, 3.93, 4.23], m: [4.123, null, 4.05, 4.48], bu: [29, 26, 23, 21], mu: [28, null, 23, 21]};
s[910] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [4.077, 3.91, 3.84, 4.18], m: [4.169, null, 3.85, 4.2], bu: [47, 40, 29, 26], mu: [49, null, 29, 26]};
s[911] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.768, 4.53, 4.77, 4.68], m: [5.06, null, 5.08, 5.2], bu: [96, 99, 74, 74], mu: [96, null, 75, 74]};
s[912] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [3.561, 3.41, 3.64, 3.49], m: [3.753, null, 4.24, 4.01], bu: [57, 74, 60, 59], mu: [58, null, 23, 17]};

// Габрово - индексация
si['Габрово'] = {n: [1001, 1006], p: null};
// Габрово - държавни училища
s[1001] = {l: 'Априловска гимн.', n: 'Национална априловска гимназия', b: [5.12, 5.04, 5.29, 5.05], m: [5.437, null, 5.35, 5.25], bu: [114, 122, 125, 126], mu: [114, null, 125, 126]};
s[1002] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Пенчо Семов', b: [3.99, 3.76, 3.97, 3.79], m: [3.894, null, 4.0, 4.23], bu: [79, 72, 71, 87], mu: [54, null, 21, 43]};
s[1003] = {l: 'ПМГ', n: 'ПМГ Акад. Иван Гюзелев', b: [4.782, 4.81, 5.16, 4.97], m: [5.2, null, 5.27, 5.14], bu: [93, 101, 104, 102], mu: [92, null, 104, 102]};
s[1004] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [3.731, 3.49, 4.05, 3.43], m: [3.815, null, 4.19, 3.69], bu: [37, 27, 13, 22], mu: [22, null, 13, 20]};
s[1005] = {l: 'СУ Райчо Каролев', n: 'СУ Райчо Каролев', b: [3.871, 3.18, 3.73, 3.46], m: [3.894, null, 3.62, 3.69], bu: [24, 12, 16, 23], mu: [24, null, 16, 22]};
s[1006] = {l: 'Техническа гимн.', n: 'Професионална техническа гимназия', b: [4.002, 3.71, 3.79, 3.83], m: [4.304, null, 4.07, 4.24], bu: [108, 100, 100, 112], mu: [100, null, 92, 91]};

// Добрич - индексация
si['Добрич'] = {n: [1101, 1114], p: [1115, 1116]};
// Добрич - държавни училища
s[1101] = {l: 'ЕГ Гео Милев', n: 'ЕГ Гео Милев', b: [5.119, 5.27, 5.26, 5.11], m: [5.399, null, 5.45, 5.26], bu: [147, 146, 143, 128], mu: [147, null, 143, 129]};
s[1102] = {l: 'ПГ по агр. стоп.', n: 'Професионална гимназия по аграрно стопанство', b: [3.27, 3.24, 3.34, 3.25], m: [3.544, null, 5.45, 2.97], bu: [26, 38, 29, 32], mu: [7, null, 2, 1]};
s[1103] = {l: 'ПГ по вет. медицина', n: 'ПГ по ветеринарна медицина', b: [3.873, 3.58, 3.66, 3.84], m: [3.998, null, 4.05, 3.95], bu: [21, 22, 26, 23], mu: [21, null, 21, 23]};
s[1104] = {l: 'ПГ по техника', n: 'ПГ по техника и строителство', b: [3.558, 3.31, 3.22, 3.24], m: [6.0, null, 2.84, 3.07], bu: [19, 16, 22, 10], mu: [1, null, 1, 2]};
s[1105] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт, обслужване и лека промишленост', b: [3.314, 3.1, 3.14, 3.0], m: [3.2, null, null, 2.62], bu: [22, 23, 22, 54], mu: [1, null, null, 1]};
s[1106] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм П. К. Яворов', b: [3.86, 3.5, 3.63, 3.49], m: [3.39, null, null, null], bu: [85, 82, 84, 82], mu: [1, null, null, null]};
s[1107] = {l: 'ПМГ Иван Вазов', n: 'ПМГ Иван Вазов', b: [4.526, 4.37, 4.68, 4.47], m: [4.928, null, 4.9, 4.88], bu: [74, 55, 47, 74], mu: [75, null, 48, 74]};
s[1108] = {l: 'Спортно у-ще', n: 'Спортно у-ще Георги Раковски', b: [3.11, 3.32, 3.23, 3.25], m: [3.21, null, 3.29, 3.54], bu: [21, 16, 17, 19], mu: [19, null, 14, 2]};
s[1109] = {l: 'СУ Димитър Талев', n: 'СУ Димитър Талев', b: [4.17, 4.08, 3.92, 4.18], m: [4.74, null, 4.23, 4.53], bu: [36, 23, 36, 42], mu: [37, null, 36, 42]};
s[1110] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.193, 4.1, 4.26, 4.48], m: [4.554, null, 4.57, 4.98], bu: [50, 51, 54, 25], mu: [51, null, 54, 25]};
s[1111] = {l: 'СУ Любен Каравелов', n: 'СУ Любен Каравелов', b: [3.846, 4.13, 4.08, 3.61], m: [3.886, null, 4.2, 4.12], bu: [32, 15, 18, 19], mu: [31, null, 18, 19]};
s[1112] = {l: 'СУ Петко Славейков', n: 'СУ Петко Славейков', b: [4.116, 4.41, 4.64, 4.19], m: [4.771, null, 4.82, 4.81], bu: [14, 30, 17, 23], mu: [14, null, 19, 21]};
s[1113] = {l: 'СУ Св. Климент Охридски', n: 'СУ Св. Климент Охридски', b: [4.511, 4.46, 4.41, 4.9], m: [4.688, null, 4.44, 4.82], bu: [49, 39, 59, 42], mu: [49, null, 59, 42]};
s[1114] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска гимназия', b: [4.356, 4.15, 4.32, 4.2], m: [4.711, null, 4.3, 4.53], bu: [111, 114, 92, 77], mu: [104, null, 69, 36]};
// Добрич - частни училища
s[1115] = {l: 'Леонардо да Винчи', n: 'ЧСУ Леонардо да Винчи', b: [null, 4.43, 4.55, 4.76], m: [null, null, 4.48, 4.94], bu: [null, 10, 5, 6], mu: [null, null, 5, 6]};
s[1116] = {l: 'Туризъм и предприемачество', n: 'ЧПГ по туризъм и предприемачество', b: [5.079, 5.07, 4.96, 5.15], m: [5.514, null, 4.63, 5.26], bu: [14, 14, 5, 8], mu: [14, null, 5, 8]};

// Кърджали - индексация
si['Кърджали'] = {n: [1201, 1212], p: null};
// Кърджали - държавни училища
s[1201] = {l: 'ЕГ', n: 'ЕГ Христо Ботев', b: [5.057, 4.91, 5.09, 5.03], m: [5.275, null, 5.08, 4.92], bu: [179, 181, 166, 176], mu: [179, null, 165, 176]};
s[1202] = {l: 'ПГ В. Левски', n: 'ПГ Васил Левски', b: [3.103, 2.69, 2.84, 3.0], m: [null, null, null, null], bu: [17, 10, 6, 8], mu: [null, null, null, null]};
s[1203] = {l: 'ПГ по електр.', n: 'ПГ по електротехника и електроника', b: [3.477, 3.2, 3.24, 3.38], m: [3.401, null, 3.53, 3.59], bu: [50, 50, 29, 40], mu: [54, null, 28, 43]};
s[1204] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [3.531, 3.44, 3.56, 3.99], m: [3.533, null, 3.14, 4.19], bu: [131, 129, 104, 117], mu: [70, null, 13, 11]};
s[1205] = {l: 'ПГ по облекло', n: 'ПГ по облекло и дизайн', b: [2.885, 2.98, 2.57, 2.69], m: [2.685, null, null, null], bu: [17, 15, 9, 6], mu: [2, null, null, null]};
s[1206] = {l: 'ПГ по с/г стоп.', n: 'ПГ по селско и горско стопанство', b: [3.072, 2.78, 2.76, 2.85], m: [3.081, null, 2.83, 2.79], bu: [38, 33, 29, 32], mu: [21, null, 6, 3]};
s[1207] = {l: 'ПГ по строит.', n: 'ПГ по строителство', b: [2.981, 3.13, 3.25, 3.12], m: [3.168, null, 3.33, 2.9], bu: [18, 28, 22, 21], mu: [13, null, 17, 10]};
s[1208] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [3.322, 3.13, 3.02, 3.09], m: [3.504, null, 2.38, 4.41], bu: [81, 83, 71, 59], mu: [53, null, 3, 1]};
s[1209] = {l: 'СУ В. Димитров', n: 'СУ Владимир Димитров - Майстора', b: [null, 3.63, 3.8, 3.08], m: [null, null, 4.01, null], bu: [null, 13, 8, 1], mu: [null, null, 8, null]};
s[1210] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.389, 3.19, 3.19, 3.33], m: [3.705, null, 3.65, 3.76], bu: [46, 49, 50, 29], mu: [43, null, 51, 27]};
s[1211] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [4.142, 3.86, 3.96, 4.09], m: [4.401, null, 4.13, 4.48], bu: [80, 76, 77, 75], mu: [80, null, 76, 74]};
s[1212] = {l: 'СУ П. Славейков', n: 'СУ Петко Славейков', b: [4.528, 4.34, 4.7, 4.94], m: [4.845, null, 4.74, 5.05], bu: [90, 93, 93, 78], mu: [88, null, 93, 78]};

// Кюстендил - индексация
si['Кюстендил'] = {n: [1301, 1308], p: null};
// Кюстендил - държавни училища
s[1301] = {l: 'ЕГ', n: 'ЕГ Д-р Петър Берон', b: [4.766, 4.54, 4.86, 4.5], m: [5.106, null, 5.09, 4.95], bu: [73, 75, 77, 57], mu: [74, null, 77, 57]};
s[1302] = {l: 'ПГ по икономика', n: 'ПГ по икономика и мениджмънт', b: [4.368, 3.95, 3.92, 3.84], m: [4.106, null, 3.74, 3.92], bu: [122, 117, 110, 88], mu: [127, null, 110, 82]};
s[1303] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост', b: [2.915, 2.94, 2.77, 2.67], m: [2.582, null, 3.01, 3.06], bu: [11, 7, 17, 9], mu: [8, null, 4, 2]};
s[1304] = {l: 'ПГ по с. стоп.', n: 'ПГ по селско стопанство', b: [2.92, 2.7, null, 2.92], m: [null, null, null, 2.94], bu: [2, 1, null, 5], mu: [null, null, null, 2]};
s[1305] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Н. Вапцаров', b: [3.517, 3.44, 3.36, 3.48], m: [3.593, null, 3.41, 3.61], bu: [59, 29, 37, 28], mu: [61, null, 39, 29]};
s[1306] = {l: 'ПМГ', n: 'ПМГ Проф. Емануил Иванов', b: [5.039, 4.68, 5.01, 4.76], m: [5.403, null, 5.08, 5.08], bu: [75, 101, 99, 95], mu: [75, null, 99, 95]};
s[1307] = {l: 'Спортно у-ще', n: 'Спортно у-ще Васил Левски', b: [3.052, 2.93, 2.88, 2.98], m: [3.257, null, 3.16, 3.2], bu: [32, 26, 19, 21], mu: [20, null, 4, 1]};
s[1308] = {l: 'Техн. гимназия', n: 'Професионална техническа гимназия', b: [3.223, 2.89, 2.72, 2.96], m: [3.213, null, 2.6, 3.11], bu: [25, 21, 22, 19], mu: [23, null, 24, 14]};

// Ловеч - индексация
si['Ловеч'] = {n: [1401, 1408], p: null};
// Ловеч - държавни училища
s[1401] = {l: 'ЕГ', n: 'Профилирана ЕГ Екзарх Йосиф I', b: [5.368, 5.23, 5.39, 5.29], m: [5.621, null, 5.19, 5.19], bu: [175, 177, 180, 178], mu: [175, null, 180, 178]};
s[1402] = {l: 'ПГ по вет. медицина', n: 'Национална ПГ по ветеринарна медицина', b: [3.824, 3.43, 3.73, 3.67], m: [4.119, null, 3.96, 3.98], bu: [42, 47, 59, 55], mu: [26, null, 24, 16]};
s[1403] = {l: 'ПГ по икономика', n: 'ПГ по икономика, търговия и услуги', b: [4.063, 3.68, 3.8, 3.73], m: [3.985, null, 3.54, 3.29], bu: [76, 44, 33, 36], mu: [76, null, 35, 36]};
s[1404] = {l: 'ПГ по механ.', n: 'ПГ по механоелектротехника', b: [3.709, 3.42, 3.49, 3.51], m: [4.11, null, 3.54, 3.76], bu: [57, 77, 63, 41], mu: [32, null, 45, 23]};
s[1405] = {l: 'ППМГ', n: 'ППМГ', b: [4.621, 4.33, 4.49, 4.34], m: [4.851, null, 4.34, 4.5], bu: [112, 103, 98, 101], mu: [112, null, 99, 102]};
s[1406] = {l: 'СУ Димитър Митев', n: 'СУ Димитър Митев', b: [null, null, 2.96, 3.0], m: [null, null, null, 2.95], bu: [null, null, 5, 2], mu: [null, null, null, 1]};
s[1407] = {l: 'СУ Св. Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.575, 3.89, 3.96, 3.86], m: [4.46, null, 3.93, 4.2], bu: [23, 14, 14, 11], mu: [24, null, 16, 12]};
s[1408] = {l: 'СУ Тодор Кирков', n: 'СУ Тодор Кирков', b: [3.737, 3.43, 3.29, 3.51], m: [3.705, null, 3.15, 3.99], bu: [21, 22, 18, 21], mu: [21, null, 19, 22]};

// Монтана - индексация
si['Монтана'] = {n: [1501, 1510], p: null};
// Монтана - държавни училища
s[1501] = {l: '2 СУ', n: '2 СУ Никола Вапцаров', b: [3.837, 3.83, 3.63, 3.66], m: [3.844, null, 3.45, 3.56], bu: [9, 12, 10, 14], mu: [9, null, 10, 14]};
s[1502] = {l: '5 СУ', n: '5 СУ Христо Ботев', b: [null, 3.36, 3.27, null], m: [3.39, null, 2.79, null], bu: [null, 2, 1, null], mu: [1, null, 1, null]};
s[1503] = {l: '6 СУ', n: '6 СУ Отец Паисий', b: [3.801, 3.52, 3.13, 3.23], m: [3.664, null, 3.27, 3.46], bu: [12, 9, 14, 7], mu: [12, null, 13, 8]};
s[1504] = {l: '7 СУ', n: '7 СУ Йоран Радичков', b: [3.565, 3.26, 3.75, 3.22], m: [3.886, null, 3.74, 3.47], bu: [16, 20, 24, 18], mu: [18, null, 25, 17]};
s[1505] = {l: 'ГПЧЕ', n: 'ГПЧЕ Петър Богдан', b: [4.99, 4.91, 5.1, 4.59], m: [5.422, null, 5.15, 4.8], bu: [100, 96, 97, 80], mu: [100, null, 97, 80]};
s[1506] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост', b: [3.413, 3.29, 3.29, 3.04], m: [3.153, null, 3.15, 3.41], bu: [15, 11, 20, 20], mu: [10, null, 6, 2]};
s[1507] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и компютърни науки', b: [3.781, 3.65, 3.74, 3.74], m: [3.953, null, 3.74, 3.93], bu: [109, 73, 74, 104], mu: [104, null, 25, 23]};
s[1508] = {l: 'ПГ по техника', n: 'ПГ по техника и електротехника', b: [3.548, 3.47, 3.7, 3.44], m: [3.626, null, 3.35, 3.33], bu: [68, 71, 62, 48], mu: [58, null, 33, 36]};
s[1509] = {l: 'ППМГ', n: 'ППМГ Св. Климент Охридски', b: [4.767, 4.6, 4.72, 4.49], m: [5.054, null, 4.96, 4.95], bu: [76, 84, 75, 101], mu: [76, null, 75, 101]};
s[1510] = {l: 'Финансово-стопанска', n: 'Финансово-стопанска ПГ   ', b: [4.316, 4.38, 4.5, 4.24], m: [4.553, null, 4.73, 4.41], bu: [111, 99, 91, 94], mu: [55, null, 13, 20]};

// Пазарджик - индексация
si['Пазарджик'] = {n: [1601, 1614], p: null};
// Пазарджик - държавни училища
s[1601] = {l: 'ЕГ', n: 'ЕГ Бертолт Брехт', b: [5.198, 4.98, 5.09, 5.12], m: [5.416, null, 5.26, 5.16], bu: [224, 216, 217, 227], mu: [224, null, 217, 227]};
s[1602] = {l: 'ПГ Иван Аксаков', n: 'Профилирана гимназия Иван С. Аксаков', b: [4.246, 4.02, 3.87, 3.83], m: [4.499, null, 4.15, 4.14], bu: [30, 33, 11, 24], mu: [31, null, 11, 23]};
s[1603] = {l: 'ПГ по икономика', n: 'ПГ по икономика и мениджмънт', b: [4.291, 4.3, 4.43, 4.32], m: [4.273, null, 4.13, 4.09], bu: [209, 161, 178, 151], mu: [87, null, 111, 103]};
s[1604] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.579, 3.37, 3.44, 3.5], m: [3.87, null, 3.67, 3.6], bu: [130, 135, 122, 106], mu: [100, null, 58, 40]};
s[1605] = {l: 'ПГ по пром. техн.', n: 'ПГ по промишлени технологии', b: [3.05, 2.92, 2.88, 2.95], m: [3.42, null, null, 3.48], bu: [19, 16, 19, 15], mu: [1, null, null, 1]};
s[1606] = {l: 'ПГ по с. стопанство', n: 'ПГ по селско стопанство', b: [3.266, 2.99, 3.26, 2.97], m: [3.523, null, 3.65, 3.1], bu: [43, 37, 30, 55], mu: [10, null, 4, 2]};
s[1607] = {l: 'ПГ по строителство', n: 'ПГ по строителство и архитектура', b: [3.525, 3.3, 3.44, 3.34], m: [3.478, null, 3.37, 3.05], bu: [72, 37, 42, 35], mu: [72, null, 31, 15]};
s[1608] = {l: 'ПГ по фризьорство', n: 'ПГ по фризьорство и ресторантьорство', b: [3.512, 3.15, 3.75, 2.97], m: [3.444, null, null, null], bu: [15, 10, 6, 14], mu: [5, null, null, null]};
s[1609] = {l: 'ПГ по хим. и хр. техн.', n: 'ПГ по химични и хранителни технологии', b: [3.671, 3.14, 3.17, 3.06], m: [4.332, null, 2.84, 2.66], bu: [51, 23, 55, 65], mu: [7, null, 1, 1]};
s[1610] = {l: 'ПМГ', n: 'ПМГ Константин Величков', b: [4.822, 4.57, 4.94, 4.74], m: [5.047, null, 4.86, 4.76], bu: [105, 90, 84, 119], mu: [106, null, 84, 98]};
s[1611] = {l: 'СУ Г. Бенковски', n: 'СУ Георги Бенковски', b: [4.123, 4.18, 3.94, 3.7], m: [4.13, null, 3.97, 3.73], bu: [13, 20, 48, 39], mu: [13, null, 48, 39]};
s[1612] = {l: 'СУ Г. Брегов', n: 'СУ Георги Брегов', b: [4.175, 3.77, 3.24, 3.43], m: [3.918, null, 3.5, 3.73], bu: [18, 45, 1, 22], mu: [18, null, 1, 20]};
s[1613] = {l: 'СУ Д-р П. Берон', n: 'СУ Д-р Петър Берон', b: [3.456, 3.03, 3.31, 3.66], m: [3.627, null, 3.44, 4.16], bu: [17, 11, 15, 21], mu: [17, null, 15, 20]};
s[1614] = {l: 'СУ Димитър Гачев', n: 'СУ Димитър Гачев', b: [2.845, 3.13, null, null], m: [3.197, null, null, null], bu: [4, 1, null, null], mu: [4, null, null, null]};

// Перник - индексация
si['Перник'] = {n: [1701, 1711], p: null};
// Перник - държавни училища
s[1701] = {l: '5 СУ', n: '5 СУ Петко Славейков', b: [3.486, 3.53, 2.77, 3.29], m: [3.532, null, null, 3.54], bu: [13, 4, 1, 13], mu: [14, null, null, 13]};
s[1702] = {l: '6 СУ', n: '6 СУ Св. Св. Кирил и Методий', b: [3.898, 3.5, 4.01, 3.71], m: [3.998, null, 4.18, 3.89], bu: [17, 15, 6, 8], mu: [16, null, 6, 8]};
s[1703] = {l: 'ГПЧЕ', n: 'ГПЧЕ Симеон Радев', b: [5.093, 4.95, 4.98, 5.0], m: [5.214, null, 5.01, 5.17], bu: [147, 153, 145, 142], mu: [147, null, 145, 142]};
s[1704] = {l: 'ПГ Мария Кюри', n: 'Технологична ПГ Мария Кюри', b: [3.584, 3.36, 3.02, 3.43], m: [3.77, null, 3.14, 3.66], bu: [31, 23, 18, 26], mu: [29, null, 14, 26]};
s[1705] = {l: 'ПГ по енергетика', n: 'ПГ по енергетика и минна промишленост', b: [3.266, 3.37, 3.31, 3.34], m: [3.343, null, 3.43, 3.61], bu: [51, 45, 48, 44], mu: [56, null, 49, 45]};
s[1706] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [4.254, 3.96, 4.21, 4.03], m: [4.303, null, 4.3, 4.37], bu: [122, 114, 82, 104], mu: [93, null, 67, 83]};
s[1707] = {l: 'ПГ по облекло', n: 'Професионална гимназия по облекло и туризъм', b: [3.549, 3.44, 3.56, 3.36], m: [3.599, null, 3.74, 3.66], bu: [78, 56, 69, 36], mu: [74, null, 31, 20]};
s[1708] = {l: 'ПГ по техника', n: 'ПГ по техника и строителство', b: [3.887, 3.67, 4.04, 3.78], m: [3.923, null, 4.01, 4.2], bu: [102, 84, 98, 91], mu: [82, null, 59, 60]};
s[1709] = {l: 'ПМГ', n: 'ПМГ Хрристо Смирненски', b: [4.507, 4.17, 4.52, 4.37], m: [5.054, null, 4.77, 4.94], bu: [97, 98, 83, 73], mu: [96, null, 83, 73]};
s[1710] = {l: 'Спортно у-ще', n: 'Спортно у-ще Олимпиец', b: [3.488, 3.28, 3.24, 3.23], m: [3.33, null, 3.31, 3.61], bu: [22, 20, 20, 16], mu: [23, null, 21, 12]};
s[1711] = {l: 'СУРИЧЕ', n: 'СУРИЧЕ Д-р Петър Берон', b: [4.758, 4.95, 4.61, 4.59], m: [5.23, null, 4.99, 4.98], bu: [25, 25, 24, 21], mu: [25, null, 24, 21]};

// Плевен - индексация
si['Плевен'] = {n: [1801, 1822], p: null};
// Плевен - държавни училища
s[1801] = {l: 'ГПЧЕ', n: 'ГПЧЕ', b: [4.874, 4.77, 4.88, 4.81], m: [5.314, null, 4.99, 5.15], bu: [161, 166, 170, 155], mu: [161, null, 170, 155]};
s[1802] = {l: 'МГ Гео Милев', n: 'МГ Гео Милев', b: [5.154, 5.14, 5.13, 5.05], m: [5.592, null, 5.21, 5.17], bu: [146, 150, 151, 149], mu: [146, null, 151, 149]};
s[1803] = {l: 'НУИ', n: 'НУИ Панайот Пипков', b: [4.517, 4.15, 4.45, 4.3], m: [4.333, null, 4.44, 4.3], bu: [59, 42, 41, 49], mu: [24, null, 33, 24]};
s[1804] = {l: 'ПГ Захарий Зограф', n: 'ПГ Захарий Зограф', b: [3.153, 2.86, 2.67, 2.71], m: [3.302, null, 2.42, 2.64], bu: [12, 5, 4, 4], mu: [11, null, 2, 2]};
s[1805] = {l: 'ПГ по ел. и хим.', n: 'ПГ по електроника и химични технологии', b: [4.028, 3.98, 4.09, 3.98], m: [4.576, null, 4.71, 4.65], bu: [78, 70, 100, 99], mu: [46, null, 28, 20]};
s[1806] = {l: 'ПГ по лоз. и вин.', n: 'ПГ по лозарство и винарство', b: [3.474, 3.22, 3.22, 3.28], m: [3.58, null, 2.57, 4.22], bu: [32, 26, 19, 28], mu: [2, null, 1, 5]};
s[1807] = {l: 'ПГ по мениджмънт', n: 'ПГ по мениджмънт и хранителни технологии', b: [2.775, 2.86, 2.46, 2.71], m: [3.61, null, 3.03, 2.9], bu: [6, 1, 1, 10], mu: [1, null, 1, 5]};
s[1808] = {l: 'ПГ по механ.', n: 'ПГ по механоелектротехника', b: [3.73, 3.35, 3.56, 3.53], m: [4.55, null, 4.04, 4.41], bu: [49, 56, 50, 52], mu: [24, null, 24, 13]};
s[1809] = {l: 'ПГ по облекло', n: 'Професионална гимназия по облекло и текстил', b: [3.414, 3.44, 3.1, 3.01], m: [2.93, null, 3.23, 4.01], bu: [10, 17, 16, 15], mu: [2, null, 4, 1]};
s[1810] = {l: 'ПГ по под/стр/тр. техн.', n: 'ПГ по подемна, строителна и транспортна техника', b: [3.018, 2.9, 2.85, 3.1], m: [3.024, null, 2.79, 3.48], bu: [45, 41, 35, 18], mu: [35, null, 2, 4]};
s[1811] = {l: 'ПГ по рест., търг. и обсл.', n: 'ПГ по ресторантьорство, търговия и обслужване', b: [3.593, 3.61, 3.57, 3.47], m: [3.778, null, 3.8, 3.69], bu: [94, 48, 64, 44], mu: [82, null, 43, 15]};
s[1812] = {l: 'ПГ по строителство', n: 'ПГ по строителство архитектура и геодезия', b: [4.052, 3.6, 3.74, 3.58], m: [4.244, null, 3.64, 3.77], bu: [32, 20, 17, 12], mu: [17, null, 8, 9]};
s[1813] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.322, 3.33, 3.22, 3.12], m: [3.533, null, 3.9, 2.88], bu: [70, 54, 56, 30], mu: [42, null, 11, 7]};
s[1814] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Алеко Константинов', b: [4.395, 4.08, 4.09, 4.11], m: [4.488, null, 4.14, 4.6], bu: [78, 98, 83, 96], mu: [62, null, 50, 28]};
s[1815] = {l: 'ПГ по хран.-вк. техн.', n: 'ПГ по хранително-вкусови технологии', b: [3.34, 3.22, 3.11, 3.31], m: [3.1, null, 2.91, 3.51], bu: [26, 22, 17, 30], mu: [6, null, 10, 11]};
s[1816] = {l: 'Спортно у-ще', n: 'Спортно у-ще Георги Бенковски', b: [3.675, 3.53, 3.67, 3.41], m: [4.492, null, 4.39, 4.89], bu: [42, 47, 52, 48], mu: [14, null, 5, 2]};
s[1817] = {l: 'СУ А. Димитрова', n: 'СУ Анастасия Димитрова', b: [4.025, 3.3, 3.92, 3.34], m: [4.21, null, 3.96, 3.32], bu: [22, 9, 15, 12], mu: [20, null, 14, 12]};
s[1818] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [4.851, 4.81, 5.08, 4.93], m: [5.229, null, 4.98, 5.04], bu: [84, 87, 51, 80], mu: [84, null, 51, 80]};
s[1819] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Яворов', b: [3.713, 3.85, 3.6, 3.7], m: [4.009, null, 3.54, 3.96], bu: [27, 18, 15, 26], mu: [28, null, 15, 26]};
s[1820] = {l: 'СУ Стоян Заимов', n: 'СУ Стоян Заимов', b: [4.342, 4.37, 4.58, 3.64], m: [4.308, null, 4.99, 3.74], bu: [27, 46, 14, 20], mu: [28, null, 14, 20]};
s[1821] = {l: 'СУ Х. Смирненски', n: 'Средно училище Христо Смирненски', b: [3.427, 3.14, 3.52, 3.41], m: [3.603, null, 3.86, 3.65], bu: [23, 20, 21, 10], mu: [24, null, 20, 10]};
s[1822] = {l: 'Финансово-стопанска', n: 'Държавна финансово-стопанска гимназия', b: [4.509, 4.3, 4.48, 4.45], m: [4.494, null, 4.43, 4.67], bu: [116, 102, 101, 93], mu: [88, null, 68, 38]};

// Разград - индексация
si['Разград'] = {n: [1901, 1910], p: null};
// Разград - държавни училища
s[1901] = {l: 'ГПЧЕ', n: 'ГПЧЕ Екзарх Йосиф', b: [4.958, 4.97, 5.15, 4.75], m: [5.21, null, 5.28, 5.06], bu: [109, 109, 108, 108], mu: [109, null, 108, 108]};
s[1902] = {l: 'ПГ по икономика', n: 'ПГ по икономика Робер Шуман', b: [3.873, 3.71, 3.89, 3.71], m: [3.871, null, 3.92, 3.93], bu: [120, 96, 93, 86], mu: [117, null, 86, 74]};
s[1903] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [3.377, 3.12, 3.26, 3.27], m: [3.572, null, null, null], bu: [17, 15, 16, 22], mu: [12, null, null, null]};
s[1904] = {l: 'ПГ по с. стоп.', n: 'ПГ по селско стопанство и хранително-вкусови технологии', b: [3.074, 3.01, 3.0, 2.93], m: [3.47, null, 3.17, 2.96], bu: [15, 24, 13, 19], mu: [14, null, 10, 3]};
s[1905] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт и строителство', b: [3.46, 3.35, 3.23, 3.28], m: [5.84, null, null, null], bu: [10, 7, 17, 13], mu: [1, null, null, null]};
s[1906] = {l: 'ПГ по хим. техн.', n: 'ПГ по химични технологии и биотехнологии', b: [3.28, 3.19, 3.48, 3.46], m: [3.36, null, 3.8, 5.43], bu: [48, 37, 22, 24], mu: [45, null, 4, 2]};
s[1907] = {l: 'ППМГ', n: 'ППМГ Акад. Никола Обрешков', b: [5.034, 4.72, 4.96, 5.15], m: [5.101, null, 5.12, 5.14], bu: [98, 93, 83, 101], mu: [98, null, 83, 101]};
s[1908] = {l: 'Спортно у-ще', n: 'Спортно у-ще - Разград', b: [3.073, 3.13, 3.14, 3.3], m: [2.82, null, null, null], bu: [19, 22, 21, 21], mu: [5, null, null, null]};
s[1909] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [3.303, 3.44, 3.09, null], m: [3.37, null, 3.38, null], bu: [3, 18, 4, null], mu: [3, null, 2, null]};
s[1910] = {l: 'Техническа гимназия', n: 'Национална професионална техническа гимназия', b: [3.71, 3.58, 3.64, 3.67], m: [3.719, null, 3.86, 4.09], bu: [110, 112, 84, 104], mu: [108, null, 61, 47]};

// Русе - индексация
si['Русе'] = {n: [2001, 2022], p: [2023, 2024]};
// Русе - държавни училища
s[2001] = {l: 'АЕГ Гео Милев', n: 'Английска ЕГ Гео Милев', b: [4.966, 5.09, 5.11, 5.11], m: [5.695, null, 5.6, 5.41], bu: [90, 99, 99, 98], mu: [90, null, 99, 98]};
s[2002] = {l: 'Духовно училище', n: 'Духовно училище', b: [3.402, 3.09, 3.48, 3.25], m: [3.799, null, 3.47, 3.11], bu: [10, 5, 1, 3], mu: [10, null, 3, 3]};
s[2003] = {l: 'МГ Баба Тонка', n: 'МГ Баба Тонка', b: [5.151, 5.09, 5.26, 5.19], m: [5.695, null, 5.33, 5.54], bu: [126, 122, 124, 127], mu: [126, null, 124, 127]};
s[2004] = {l: 'НУИ', n: 'НУИ Проф. Веселин Стоянов', b: [4.282, 4.17, 4.41, 4.3], m: [4.437, null, 4.28, 4.39], bu: [34, 38, 39, 55], mu: [13, null, 15, 40]};
s[2005] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване и вътрешна архитектура', b: [3.618, 2.95, 3.14, 3.58], m: [4.115, null, null, 3.2], bu: [43, 14, 18, 31], mu: [12, null, null, 4]};
s[2006] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и електроника', b: [3.911, 3.85, 3.99, 3.73], m: [4.261, null, 4.28, 4.23], bu: [99, 89, 69, 68], mu: [100, null, 69, 64]};
s[2007] = {l: 'ПГ по икономика', n: 'ПГ по икономика и управление', b: [4.865, 4.38, 4.75, 4.75], m: [4.977, null, 4.78, 4.91], bu: [125, 128, 124, 124], mu: [125, null, 114, 83]};
s[2008] = {l: 'ПГ по механот.', n: 'ПГ по механотехника', b: [3.459, 3.29, 3.27, 3.2], m: [3.384, null, 2.74, 3.04], bu: [24, 21, 22, 44], mu: [17, null, 3, 14]};
s[2009] = {l: 'ПГ по облекло', n: 'ПГ по облекло', b: [3.633, 3.29, 3.45, 3.34], m: [5.303, null, 3.0, null], bu: [68, 62, 55, 50], mu: [6, null, 1, null]};
s[2010] = {l: 'ПГ по пром. техн.', n: 'ПГ по промишлени технологии', b: [3.394, 3.25, 3.47, 3.34], m: [2.87, null, null, 5.63], bu: [57, 54, 28, 33], mu: [2, null, null, 1]};
s[2011] = {l: 'ПГ по реч. кор.', n: 'ПГ по речно корабостроене и корабоплаване', b: [3.684, 3.3, 3.38, 3.32], m: [3.803, null, 3.53, 3.49], bu: [45, 59, 66, 45], mu: [44, null, 58, 35]};
s[2012] = {l: 'ПГ по с. стоп.', n: 'ПГ по селско стопанство', b: [3.228, 3.11, 3.31, 3.07], m: [3.241, null, 3.28, 3.15], bu: [16, 19, 10, 22], mu: [19, null, 10, 20]};
s[2013] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и геодезия', b: [4.089, 4.02, 3.99, 3.9], m: [4.109, null, 4.08, 3.83], bu: [54, 65, 60, 50], mu: [37, null, 35, 17]};
s[2014] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт', b: [3.342, 3.32, 3.3, 3.44], m: [2.83, null, 5.61, 4.04], bu: [17, 36, 39, 28], mu: [2, null, 1, 3]};
s[2015] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм', b: [4.018, 3.87, 3.79, 3.72], m: [4.142, null, 3.88, 3.82], bu: [119, 112, 93, 118], mu: [65, null, 79, 97]};
s[2016] = {l: 'Спортно у-ще', n: 'Спортно у-ще', b: [3.727, 3.45, 3.63, 3.21], m: [4.018, null, 3.93, 3.71], bu: [31, 31, 17, 17], mu: [8, null, 16, 14]};
s[2017] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [4.433, 4.4, 4.48, 4.68], m: [4.974, null, 4.95, 5.01], bu: [67, 50, 60, 62], mu: [68, null, 60, 62]};
s[2018] = {l: 'СУ Възраждане', n: 'СУ Възраждане', b: [4.197, 3.84, 3.89, 3.92], m: [4.287, null, 4.03, 4.06], bu: [46, 46, 48, 47], mu: [45, null, 48, 46]};
s[2019] = {l: 'СУ за европ. езици', n: 'СУ за европейски езици', b: [4.977, 4.92, 4.73, 4.73], m: [5.164, null, 5.03, 5.03], bu: [148, 101, 97, 117], mu: [148, null, 97, 116]};
s[2020] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.846, 3.8, null, 3.96], m: [3.866, null, null, 4.16], bu: [26, 20, null, 17], mu: [26, null, null, 17]};
s[2021] = {l: 'СУ Фридрих Шилер', n: 'СУ с немски език Фридрих Шилер', b: [5.0, 4.9, 4.95, 4.75], m: [5.175, null, 5.18, 4.94], bu: [68, 69, 68, 53], mu: [68, null, 68, 53]};
s[2022] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [4.658, 4.44, 4.51, 4.25], m: [4.835, null, 4.59, 4.73], bu: [76, 71, 45, 64], mu: [77, null, 46, 63]};
// Русе - частни училища
s[2023] = {l: 'Джордж Байрон', n: 'ЧПАГ Джордж Байрон', b: [4.533, 4.03, 3.97, 4.4], m: [5.313, null, 4.7, 4.65], bu: [12, 6, 7, 2], mu: [13, null, 7, 2]};
s[2024] = {l: 'Леонардо да Винчи', n: 'Първо ЧСУ Леонардо да Винчи', b: [4.81, 4.68, 4.42, 4.65], m: [5.554, null, 5.02, 5.08], bu: [12, 6, 9, 7], mu: [12, null, 9, 7]};

// Силистра - индексация
si['Силистра'] = {n: [2101, 2110], p: null};
// Силистра - държавни училища
s[2101] = {l: 'ЕГ', n: 'ЕГ Пейо Яворов', b: [5.114, 5.03, 5.06, 4.98], m: [5.453, null, 5.33, 5.16], bu: [71, 72, 48, 57], mu: [71, null, 48, 57]};
s[2102] = {l: 'Земеделска гимназия', n: 'Професионална земеделска гимназия', b: [3.058, 2.92, 3.02, 3.14], m: [3.227, null, 3.37, 3.71], bu: [65, 51, 38, 33], mu: [61, null, 8, 3]};
s[2103] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост Пенчо Славейков', b: [3.074, 3.03, 3.19, null], m: [3.17, null, 3.36, null], bu: [20, 21, 13, null], mu: [1, null, 1, null]};
s[2104] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [3.405, 3.27, 3.43, 3.32], m: [4.08, null, 3.96, null], bu: [79, 60, 54, 44], mu: [8, null, 5, null]};
s[2105] = {l: 'ПГ по произв. техн.', n: 'ПГ по производствени технологии', b: [3.701, 3.26, 3.43, 3.45], m: [3.993, null, 3.93, 3.51], bu: [21, 26, 27, 39], mu: [18, null, 2, 4]};
s[2106] = {l: 'ПГ по стоп. упр.', n: 'ПГ по стопанско управление', b: [4.479, 4.22, 4.3, 4.51], m: [4.33, null, 3.94, 4.54], bu: [97, 99, 74, 72], mu: [67, null, 35, 34]};
s[2107] = {l: 'ПГ по строителство', n: 'ПГ по строителство Пеньо Пенев', b: [3.225, 3.42, 2.94, 3.44], m: [3.343, null, 3.15, 2.48], bu: [46, 28, 24, 22], mu: [30, null, 15, 1]};
s[2108] = {l: 'ПМГ', n: 'ПМГ Св. Климент Охридски', b: [4.776, 4.61, 4.92, 4.94], m: [5.191, null, 5.08, 5.07], bu: [67, 68, 51, 72], mu: [68, null, 51, 71]};
s[2109] = {l: 'Спортно у-ще', n: 'Спортно у-ще Дръстър', b: [3.584, 3.43, 3.53, 3.38], m: [3.716, null, 4.51, null], bu: [19, 14, 18, 19], mu: [18, null, 3, null]};
s[2110] = {l: 'СУ Н. Вапцаров', n: 'СУ Никола Вапцаров', b: [4.35, 3.92, 4.05, 4.48], m: [4.725, null, 4.27, 4.88], bu: [28, 33, 44, 19], mu: [28, null, 46, 19]};

// Сливен - индексация
si['Сливен'] = {n: [2201, 2216], p: null};
// Сливен - държавни училища
s[2201] = {l: 'Гимн. със зап. ез.', n: 'ПГ с преподаване на западни езици', b: [5.12, 4.95, 5.0, 5.06], m: [5.419, null, 5.15, 5.2], bu: [119, 121, 125, 109], mu: [119, null, 126, 111]};
s[2202] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и електроника', b: [3.539, 3.39, 3.38, 3.37], m: [3.605, null, 3.61, 3.47], bu: [63, 54, 48, 41], mu: [64, null, 46, 42]};
s[2203] = {l: 'ПГ по икономика', n: 'ПГ по икономика Проф. д-р Димитър Табаков', b: [4.417, 4.18, 4.43, 4.19], m: [4.444, null, 4.27, 4.59], bu: [118, 105, 72, 88], mu: [117, null, 51, 76]};
s[2204] = {l: 'ПГ по механотехника', n: 'ПГ по механотехника', b: [3.045, 2.97, 3.02, 3.06], m: [2.892, null, 3.15, 3.19], bu: [39, 51, 65, 63], mu: [23, null, 58, 59]};
s[2205] = {l: 'ПГ по стр. и геод.', n: 'Сливенска ПГ по строителство и геодезия', b: [3.467, 3.43, 3.24, 3.35], m: [3.34, null, 3.82, 3.67], bu: [31, 40, 37, 19], mu: [12, null, 9, 7]};
s[2206] = {l: 'ПГ по текстил', n: 'ПГ по текстил и облекло Добри Желязков', b: [3.334, 3.65, 3.28, 3.24], m: [3.413, null, 3.47, 3.5], bu: [7, 10, 32, 24], mu: [3, null, 8, 14]};
s[2207] = {l: 'ПГ по хотелиерство', n: 'ПГ по хотелиерство и туризъм', b: [4.133, 4.1, 4.05, 4.32], m: [4.02, null, 3.98, 4.36], bu: [100, 113, 113, 84], mu: [67, null, 95, 65]};
s[2208] = {l: 'ППМГ', n: 'ППМГ Добри Чинтулов', b: [5.16, 4.86, 5.14, 4.77], m: [5.458, null, 5.25, 5.12], bu: [151, 146, 150, 155], mu: [151, null, 150, 155]};
s[2209] = {l: 'Спортно у-ще', n: 'Спортно у-ще Димитър Рохов', b: [3.745, 3.3, 3.66, 3.69], m: [3.575, null, 3.61, 3.7], bu: [42, 21, 33, 32], mu: [7, null, 1, 5]};
s[2210] = {l: 'СУ Аргира Жечкова', n: 'СУ Аргира Жечкова', b: [null, 3.78, null, 3.82], m: [null, null, null, null], bu: [null, 1, null, 2], mu: [null, null, null, null]};
s[2211] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [3.642, 3.43, 3.62, 3.41], m: [3.674, null, 3.84, 3.93], bu: [9, 21, 15, 19], mu: [11, null, 15, 18]};
s[2212] = {l: 'СУ К. Константинов', n: 'СУ Константин Константинов', b: [4.165, 2.59, null, null], m: [4.454, null, null, null], bu: [16, 1, null, null], mu: [15, null, null, null]};
s[2213] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Яворов', b: [3.917, 3.53, 3.77, 3.56], m: [3.881, null, 3.81, 3.77], bu: [31, 24, 25, 50], mu: [30, null, 25, 50]};
s[2214] = {l: 'СУ Х. Мина Пашов', n: 'СУ Хаджи Мина Пашов', b: [3.432, 2.82, 2.4, 3.03], m: [3.601, null, null, 3.45], bu: [8, 2, 1, 1], mu: [7, null, null, 1]};
s[2215] = {l: 'Худож. гимназия', n: 'Художествена гимназия Димитър Добрович', b: [4.354, 3.92, 4.53, 4.38], m: [4.026, null, 3.4, 3.47], bu: [29, 25, 17, 25], mu: [11, null, 2, 2]};
s[2216] = {l: 'Хуманит. гимназия', n: 'Хуманитарна гимназия Дамян Дамянов', b: [4.458, 4.0, 4.47, 4.19], m: [4.688, null, 4.83, 4.35], bu: [47, 42, 25, 21], mu: [47, null, 25, 21]};

// Смолян - индексация
si['Смолян'] = {n: [2301, 2308], p: null};
// Смолян - държавни училища
s[2301] = {l: 'ЕГ Иван Вазов', n: 'ЕГ Иван Вазов', b: [5.105, 4.96, 5.06, 5.08], m: [5.365, null, 5.19, 5.1], bu: [85, 75, 82, 95], mu: [85, null, 82, 95]};
s[2302] = {l: 'ПГ за прил. изк.', n: 'ПГ за приложни изкуства', b: [4.025, 4.07, null, 3.89], m: [null, null, null, null], bu: [6, 6, null, 10], mu: [null, null, null, null]};
s[2303] = {l: 'ПГ по икономика', n: 'Професионална гимназия по икономика', b: [4.074, 3.94, 4.14, 4.03], m: [3.982, null, 4.4, 4.14], bu: [69, 65, 40, 81], mu: [62, null, 30, 51]};
s[2304] = {l: 'ПГ по техника', n: 'ПГ по техника и технологии', b: [3.507, 3.49, 3.64, 3.4], m: [3.631, null, 3.6, 3.01], bu: [51, 47, 36, 18], mu: [19, null, 15, 2]};
s[2305] = {l: 'ПГ по туризъм', n: 'Смолянска ПГ по туризъм и строителство', b: [4.028, 3.64, 3.96, 3.79], m: [3.467, null, 3.49, 3.95], bu: [26, 21, 28, 21], mu: [24, null, 4, 2]};
s[2306] = {l: 'ППМГ', n: 'ППМГ Васил Левски', b: [5.016, 4.64, 5.09, 5.12], m: [5.29, null, 5.16, 5.21], bu: [96, 93, 87, 94], mu: [96, null, 87, 94]};
s[2307] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [4.555, 4.14, 4.65, 4.72], m: [4.659, null, 4.72, 5.04], bu: [32, 31, 33, 28], mu: [32, null, 33, 28]};
s[2308] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [4.215, 3.75, 4.08, null], m: [4.32, null, 4.49, null], bu: [11, 17, 19, null], mu: [11, null, 18, null]};

// Стара Загора - индексация
si['Стара Загора'] = {n: [2401, 2419], p: null};
// Стара Загора - държавни училища
s[2401] = {l: 'Вечерно СУ', n: 'Вечерно СУ Захари Стоянов', b: [3.629, 3.35, 3.59, 3.48], m: [3.532, null, 3.73, 3.56], bu: [27, 25, 27, 40], mu: [30, null, 27, 41]};
s[2402] = {l: 'ГПЧЕ Ромен Ролан', n: 'ГПЧЕ Ромен Ролан', b: [5.353, 5.28, 5.29, 5.24], m: [5.569, null, 5.46, 5.34], bu: [239, 231, 228, 226], mu: [239, null, 228, 226]};
s[2403] = {l: 'НУМСИ', n: 'НУМСИ Христина Морфова', b: [4.578, 4.29, 4.05, 4.39], m: [4.024, null, 4.12, 4.17], bu: [27, 27, 17, 14], mu: [14, null, 11, 11]};
s[2404] = {l: 'ПГ по вет. медицина', n: 'Национална ПГ по ветеринарна медицина', b: [3.806, 3.77, 3.86, 3.82], m: [3.783, null, 3.95, 3.75], bu: [138, 124, 114, 99], mu: [82, null, 63, 38]};
s[2405] = {l: 'ПГ по електроника', n: 'ПГ по електроника', b: [3.796, 3.5, 3.69, 3.59], m: [3.859, null, 3.9, 4.15], bu: [101, 85, 58, 55], mu: [102, null, 59, 55]};
s[2406] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и технологии', b: [3.641, 3.45, 3.38, 3.45], m: [3.892, null, 3.51, 3.66], bu: [74, 57, 45, 47], mu: [75, null, 45, 45]};
s[2407] = {l: 'ПГ по механот.', n: 'ПГ по механотехника и транспорт', b: [3.544, 3.34, 3.19, 3.28], m: [3.394, null, 3.21, 3.36], bu: [44, 49, 34, 23], mu: [45, null, 34, 20]};
s[2408] = {l: 'ПГ по облекло', n: 'ПГ по облекло и хранене', b: [3.868, 3.66, 3.82, 3.63], m: [4.32, null, 4.07, 3.87], bu: [101, 107, 61, 90], mu: [17, null, 14, 8]};
s[2409] = {l: 'ПГ по строит и дърв.', n: 'ПГ по строителство и дървообработване', b: [3.098, 2.97, 2.82, 3.15], m: [3.0, null, 2.79, null], bu: [13, 19, 21, 10], mu: [5, null, 1, null]};
s[2410] = {l: 'ПГ по строит., арх. и геод.', n: 'ПГ по строителство, архитектура и геодезия', b: [4.647, 4.38, 4.38, 4.42], m: [4.726, null, 4.32, 4.47], bu: [126, 147, 144, 136], mu: [109, null, 119, 92]};
s[2411] = {l: 'ППМГ Гео Милев', n: 'ППМГ Гео Милев', b: [4.891, 4.87, 4.93, 4.82], m: [5.12, null, 5.17, 4.95], bu: [125, 124, 123, 130], mu: [125, null, 123, 130]};
s[2412] = {l: 'Спортно у-ще', n: 'Спортно у-ще Тодор Каблешков', b: [3.642, 3.48, 3.29, 3.36], m: [3.191, null, 3.49, 3.43], bu: [29, 47, 35, 27], mu: [7, null, 7, 1]};
s[2413] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [4.09, 3.98, 4.05, 4.0], m: [4.344, null, 4.27, 4.15], bu: [42, 42, 20, 41], mu: [42, null, 18, 41]};
s[2414] = {l: 'СУ Железник', n: 'СУ Железник', b: [3.878, 2.26, 3.99, 3.57], m: [3.983, null, 4.02, 3.82], bu: [25, 1, 7, 20], mu: [23, null, 7, 21]};
s[2415] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [4.038, 3.92, 3.88, 3.87], m: [4.126, null, 4.04, 3.98], bu: [40, 43, 38, 19], mu: [41, null, 38, 20]};
s[2416] = {l: 'СУ Максим Горки', n: 'СУ Максим Горки', b: [4.697, 4.56, 4.66, 4.81], m: [4.778, null, 4.9, 4.84], bu: [97, 95, 80, 79], mu: [97, null, 80, 79]};
s[2417] = {l: 'СУ Минчо Кънчев', n: 'СУ Поп Минчо Кънчев', b: [3.133, 2.74, 3.2, 3.03], m: [null, null, null, null], bu: [6, 5, 3, 4], mu: [null, null, null, null]};
s[2418] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [3.369, 3.19, 3.32, null], m: [3.088, null, 3.29, 2.84], bu: [11, 12, 18, null], mu: [12, null, 15, 1]};
s[2419] = {l: 'Търговска гимназия', n: 'Търговска гимназия Княз Симеон Търновски', b: [5.095, 4.97, 4.98, 4.89], m: [5.016, null, 4.64, 4.65], bu: [130, 131, 150, 128], mu: [96, null, 98, 68]};

// Търговище - индексация
si['Търговище'] = {n: [2501, 2509], p: null};
// Търговище - държавни училища
s[2501] = {l: '1 СУ', n: '1 СУ Свети Седмочисленици', b: [4.921, 4.76, 4.8, 4.87], m: [5.423, null, 5.24, 5.2], bu: [83, 80, 97, 68], mu: [83, null, 97, 68]};
s[2502] = {l: '2 СУ', n: '2 СУ Проф. Никола Маринов', b: [4.604, 4.46, 4.44, 4.46], m: [4.871, null, 4.51, 4.76], bu: [86, 102, 72, 73], mu: [87, null, 72, 73]};
s[2503] = {l: 'ПГ по електрот.', n: 'ПГ по електротехника и строителство', b: [3.2, 3.35, 3.07, 3.1], m: [4.342, null, 3.54, null], bu: [10, 23, 19, 12], mu: [7, null, 10, null]};
s[2504] = {l: 'ПГ по земеделие', n: 'ПГ по земеделие', b: [3.316, 3.03, 2.81, 3.25], m: [2.984, null, 2.99, 3.35], bu: [31, 23, 39, 10], mu: [7, null, 3, 3]};
s[2505] = {l: 'ПГ по икон. инф.', n: 'ПГ по икономическа информатика', b: [4.148, 3.9, 3.89, 3.75], m: [3.838, null, 4.04, 4.25], bu: [55, 72, 73, 71], mu: [25, null, 5, 12]};
s[2506] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм и хран.-вкусови технологии', b: [3.697, 3.48, 3.54, 3.36], m: [3.682, null, 3.66, 3.55], bu: [61, 58, 26, 30], mu: [28, null, 14, 16]};
s[2507] = {l: 'Спортно у-ще', n: 'Спортно училище Никола Симов', b: [3.663, 3.67, 3.14, 3.08], m: [3.937, null, 3.29, 3.48], bu: [28, 16, 11, 13], mu: [31, null, 13, 12]};
s[2508] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия', b: [3.627, 3.52, 3.62, 3.58], m: [3.904, null, 4.21, 3.91], bu: [43, 65, 64, 44], mu: [37, null, 52, 29]};
s[2509] = {l: 'У-ще за уч. с увр. слух', n: 'Специално у-ще за ученици с увреден слух', b: [3.016, null, 3.16, 3.01], m: [null, null, null, null], bu: [3, null, 6, 3], mu: [null, null, null, null]};

// Хасково - индексация
si['Хасково'] = {n: [2601, 2611], p: null};
// Хасково - държавни училища
s[2601] = {l: 'ЕГ', n: 'ЕГ Проф. д-р Асен Златаров', b: [5.077, 4.89, 5.05, 4.93], m: [5.4, null, 5.25, 5.07], bu: [181, 174, 167, 178], mu: [181, null, 167, 179]};
s[2602] = {l: 'ПГ по дървообр.', n: 'ПГ по дървообработване и строителство', b: [3.84, 3.68, 3.63, 3.72], m: [4.127, null, 4.14, 4.07], bu: [114, 130, 122, 127], mu: [116, null, 82, 35]};
s[2603] = {l: 'ПГ по лека пром.', n: 'ПГ по лека промишленост Райна Княгиня', b: [3.12, 3.05, 3.26, 2.93], m: [3.028, null, 3.34, 2.96], bu: [27, 41, 18, 19], mu: [26, null, 16, 16]};
s[2604] = {l: 'ПГ по механоел.', n: 'ПГ по механоелектротехника', b: [3.305, 3.1, 3.2, 3.02], m: [3.482, null, 3.48, 3.25], bu: [56, 59, 51, 40], mu: [18, null, 10, 20]};
s[2605] = {l: 'ПГ по транспорт', n: 'ПГ по транспорт и аграрни технологии', b: [3.146, 2.95, 3.08, 3.12], m: [2.865, null, 3.07, 2.66], bu: [36, 44, 45, 33], mu: [2, null, 13, 1]};
s[2606] = {l: 'ПГ по туризъм', n: 'ПГ по туризъм Александър Паскалев', b: [3.588, 3.4, 3.48, 3.24], m: [3.59, null, 3.57, 3.4], bu: [144, 129, 101, 77], mu: [133, null, 73, 19]};
s[2607] = {l: 'ПМГ', n: 'ПМГ Акад. Боян Петканчин', b: [5.169, 4.8, 5.21, 5.13], m: [5.227, null, 4.97, 4.95], bu: [127, 119, 127, 127], mu: [128, null, 127, 127]};
s[2608] = {l: 'Спортно у-ще', n: 'Спортно у-ще Стефан Караджа', b: [3.14, 3.03, 3.04, 3.12], m: [3.438, null, 3.32, 3.18], bu: [38, 44, 22, 29], mu: [37, null, 19, 31]};
s[2609] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [3.77, 3.57, 3.66, 3.72], m: [4.47, null, 4.14, 4.25], bu: [2, 16, 22, 22], mu: [2, null, 21, 23]};
s[2610] = {l: 'СУ П. Хилендарски', n: 'СУ Св. Паисий Хилендарски', b: [3.94, 3.63, 3.51, 3.49], m: [4.221, null, 3.78, 3.48], bu: [14, 30, 12, 16], mu: [13, null, 13, 17]};
s[2611] = {l: 'Фин.-стопанска', n: 'Финансово-стопанска гимназия Атанас Буров', b: [4.251, 3.97, 4.0, 3.69], m: [4.35, null, 3.97, 4.17], bu: [150, 127, 138, 117], mu: [85, null, 45, 24]};

// Шумен - индексация
si['Шумен'] = {n: [2701, 2713], p: null};
// Шумен - държавни училища
s[2701] = {l: 'Духовно училище', n: 'Духовно училище Нювваб', b: [3.947, 3.59, 3.56, 3.67], m: [3.846, null, 3.97, 4.14], bu: [18, 21, 21, 28], mu: [19, null, 21, 27]};
s[2702] = {l: 'ЕГ Н. Вапцаров', n: 'ЕГ Никола Йонков Вапцаров', b: [5.007, 4.79, 4.96, 4.86], m: [5.433, null, 5.2, 5.0], bu: [150, 143, 116, 117], mu: [150, null, 116, 117]};
s[2703] = {l: 'ПГ по икономика', n: 'ПГ по икономика', b: [4.176, 3.92, 4.08, 3.97], m: [4.165, null, 4.18, 4.12], bu: [125, 140, 121, 138], mu: [112, null, 119, 137]};
s[2704] = {l: 'ПГ по механот.', n: 'ПГ по механот., електр., телеком. и транспорт', b: [3.471, 3.48, 3.33, 3.5], m: [3.606, null, 3.57, 3.85], bu: [82, 70, 63, 59], mu: [90, null, 64, 47]};
s[2705] = {l: 'ПГ по облекло', n: 'ПГ по облекло, хранене и химични технологии', b: [3.553, 3.35, 3.53, 3.64], m: [3.645, null, 3.64, 3.55], bu: [51, 43, 73, 47], mu: [46, null, 51, 18]};
s[2706] = {l: 'ПГ по с. стоп.', n: 'ПГ по селско стопанство и хранителни технологии', b: [3.156, 3.04, 3.03, 3.14], m: [3.448, null, 3.35, 3.5], bu: [34, 38, 31, 20], mu: [29, null, 24, 21]};
s[2707] = {l: 'ПГ по строителство', n: 'ПГ по строителство, архитектура и геодезия', b: [3.471, 3.37, 3.38, 3.23], m: [3.618, null, 3.66, 3.63], bu: [101, 91, 77, 81], mu: [81, null, 54, 58]};
s[2708] = {l: 'ППМГ', n: 'ППМГ Нанчо Попович', b: [4.904, 4.82, 5.1, 4.8], m: [5.461, null, 5.18, 5.09], bu: [127, 129, 129, 128], mu: [127, null, 129, 128]};
s[2709] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [3.66, 3.2, 3.62, 3.35], m: [4.111, null, 3.96, 4.25], bu: [38, 37, 35, 12], mu: [36, null, 32, 9]};
s[2710] = {l: 'СУ Йоан Екзарх', n: 'СУ Йоан Екзарх Български', b: [4.305, 4.28, 4.51, 4.28], m: [4.509, null, 4.43, 4.48], bu: [68, 73, 59, 97], mu: [68, null, 60, 97]};
s[2711] = {l: 'СУ Панайот Волов', n: 'СУ Панайот Волов', b: [4.279, 3.86, 4.09, 3.66], m: [4.432, null, 4.25, 4.07], bu: [60, 60, 64, 51], mu: [60, null, 64, 51]};
s[2712] = {l: 'СУ С. Доброплодни', n: 'СУ Сава Доброплодни', b: [4.418, 4.3, 4.34, 4.75], m: [4.835, null, 4.43, 4.82], bu: [99, 85, 89, 90], mu: [99, null, 89, 90]};
s[2713] = {l: 'СУ Трайко Симеонов', n: 'СУ Трайко Симеонов', b: [3.496, 3.29, 3.29, 3.38], m: [3.655, null, 3.71, 4.27], bu: [10, 18, 8, 8], mu: [12, null, 8, 7]};

// Ямбол - индексация
si['Ямбол'] = {n: [2801, 2812], p: null};
// Ямбол - държавни училища
s[2801] = {l: 'Гимназия по строит.', n: 'Гимназия по строителство и архитектура', b: [3.28, 3.33, 3.37, 3.5], m: [2.964, null, 4.08, 3.61], bu: [57, 38, 19, 20], mu: [19, null, 4, 12]};
s[2802] = {l: 'ЕГ В. Карагьозов', n: 'ЕГ Васил Карагьозов', b: [4.737, 4.45, 4.81, 4.79], m: [5.169, null, 4.9, 5.11], bu: [68, 72, 47, 43], mu: [68, null, 47, 43]};
s[2803] = {l: 'ПГ Васил Левски', n: 'ПГ Васил Левски', b: [4.506, 4.54, 4.78, 4.73], m: [4.975, null, 4.86, 4.84], bu: [107, 89, 97, 78], mu: [109, null, 97, 78]};
s[2804] = {l: 'ПГ по земеделие', n: 'ПГ по земеделие Христо Ботев', b: [3.01, 2.94, 2.85, 3.01], m: [2.791, null, 2.82, 3.09], bu: [51, 44, 37, 34], mu: [10, null, 2, 5]};
s[2805] = {l: 'ПГ по икономика', n: 'ПГ по икономика Георги Стойков Раковски', b: [4.382, 3.8, 3.98, 3.97], m: [4.962, null, 4.58, 4.82], bu: [125, 96, 93, 74], mu: [21, null, 13, 3]};
s[2806] = {l: 'ПГ по лека пром.', n: 'ПГ по лека пром., екология и хим. технологии', b: [3.049, 2.99, 3.74, 3.35], m: [2.98, null, null, null], bu: [35, 46, 17, 31], mu: [2, null, null, null]};
s[2807] = {l: 'ПГ по подемна техн.', n: 'ПГ по подемна, строителна и транспортна техника', b: [2.939, 2.75, 2.87, 2.85], m: [2.923, null, 2.37, 2.7], bu: [71, 51, 38, 51], mu: [13, null, 1, 1]};
s[2808] = {l: 'ПГ по хранит. техн.', n: 'ПГ по хранителни технологии и туризъм', b: [3.56, 3.44, 3.39, 3.31], m: [3.623, null, 3.03, 2.98], bu: [38, 44, 38, 27], mu: [3, null, 1, 2]};
s[2809] = {l: 'ПМГ', n: 'ПМГ Атанас Радев', b: [5.197, 4.91, 5.08, 4.89], m: [5.542, null, 5.19, 5.03], bu: [90, 91, 85, 87], mu: [90, null, 85, 87]};
s[2810] = {l: 'Спортно у-ще', n: 'Спортно у-ще Пиер дьо Кубертен', b: [3.69, 3.49, 3.87, 3.87], m: [3.271, null, 2.68, 5.92], bu: [12, 15, 13, 11], mu: [12, null, 2, 1]};
s[2811] = {l: 'СУ Св. Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [4.062, 3.71, 3.98, 3.86], m: [3.965, null, 4.28, 4.07], bu: [38, 58, 47, 59], mu: [40, null, 47, 57]};
s[2812] = {l: 'Техническа гимназия', n: 'Професионална техническа гимназия Иван Райнов', b: [3.696, 3.57, 3.62, 3.59], m: [3.918, null, 4.18, 3.6], bu: [90, 76, 56, 89], mu: [34, null, 8, 9]};
