// https://data.egov.bg/data/view/b56288b6-25aa-4049-9aa6-de2cd4cdabf8

let si = [];
let s = [];

// София - индексация
si['София'] = {n: [1, 147], p: [148, 183]};
// София - държавни училища
s[1] = {l: '1 СУ', n: '1 СУ Пенчо Славейков', b: [41.74, 68.91, 72.19, 68.78], m: [43.39, 48.96, 53.66, 52.6]};
s[2] = {l: '2 СУ', n: '2 СУ Акад. Емилиян Станев', b: [43.09, 73.2, 73.12, 75.61], m: [41.01, 49.74, 48.59, 55.96]};
s[3] = {l: '3 СУ', n: '3 СУ Марин Дринов', b: [20.25, 50.47, 32.46, 41.84], m: [12.82, 19.78, 17.05, 22.58]};
s[4] = {l: '4 ОУ', n: '4 ОУ Проф. Джон Атанасов', b: [38.91, 63.86, 63.41, 64.44], m: [41.37, 46.2, 45.1, 43.96]};
s[5] = {l: '5 ОУ', n: '5 ОУ Иван Ваазов', b: [38.88, 59.58, 61.59, 68.51], m: [37.24, 37.3, 45.38, 52.52]};
s[6] = {l: '6 ОУ', n: '6 ОУ Граф Игнатиев', b: [47.13, 78.34, 73.9, 74.25], m: [43.28, 59.54, 57.55, 59.65]};
s[7] = {l: '7 СУ', n: '7 СУ Св. Седмочисленици', b: [45.16, 71.72, 69.47, 73.34], m: [46.88, 57.11, 55.4, 63.04]};
s[8] = {l: '8 СУ', n: '8 СУ Васил Левски', b: [34.13, 68.98, 63.13, 69.31], m: [27.0, 51.83, 37.99, 56.77]};
s[9] = {l: '10 СУ', n: '10 СУ Теодор Траянов', b: [39.63, 61.38, 70.9, 74.03], m: [37.85, 43.1, 60.73, 58.45]};
s[10] = {l: '11 ОУ', n: '11 ОУ Св. Пимен Зографски', b: [39.85, 70.06, 67.93, 66.63], m: [39.88, 41.88, 50.73, 47.4]};
s[11] = {l: '12 СУ', n: '12 СУ Цар Иван Асен II', b: [39.83, 69.0, 65.69, 70.61], m: [41.04, 53.27, 51.16, 58.29]};
s[12] = {l: '14 СУ', n: '14 СУ Проф. Д-р Асен Златаров', b: [42.25, 68.87, 63.53, 64.63], m: [39.18, 36.73, 52.44, 42.59]};
s[13] = {l: '15 СУ', n: '15 СУ Адам Мицкевич', b: [34.26, 54.32, 52.56, 53.27], m: [33.58, 25.31, 36.63, 37.26]};
s[14] = {l: '16 ОУ', n: '16 ОУ Р. Жинзифов', b: [35.05, 61.43, 57.86, 63.56], m: [35.51, 37.68, 38.99, 43.38]};
s[15] = {l: '17 СУ', n: '17 СУ Дамян Груев', b: [40.82, 67.79, 63.36, 70.24], m: [36.44, 46.73, 42.64, 53.34]};
s[16] = {l: '18 СУ', n: '18 СУ Уилям Гладстон', b: [45.19, 76.2, 73.21, 73.29], m: [45.45, 51.45, 56.26, 54.58]};
s[17] = {l: '19 СУ', n: '19 СУ Елин Пелин', b: [45.16, 74.97, 73.45, 72.87], m: [48.86, 54.15, 64.14, 58.77]};
s[18] = {l: '20 ОУ', n: '20 ОУ Тодор Минков', b: [50.23, 82.74, 79.19, 81.42], m: [52.12, 61.89, 65.92, 72.38]};
s[19] = {l: '21 СУ', n: '21 СУ Христо Ботев', b: [39.26, 64.39, 61.04, 66.64], m: [34.38, 39.65, 43.2, 47.95]};
s[20] = {l: '22 СУ', n: '22 СЕУ Георги С. Раковски', b: [44.52, 71.32, 71.93, 69.74], m: [45.24, 55.56, 58.89, 53.35]};
s[21] = {l: '23 СУ', n: '23 СУ Фредерик Жолио-Кюри', b: [37.82, 61.76, 61.69, 65.67], m: [38.96, 35.18, 40.46, 54.39]};
s[22] = {l: '24 СУ', n: '24 СУ Пейо К. Яворов', b: [18.18, 24.47, 15.0, 15.85], m: [13.0, 12.56, 11.5, 14.6]};
s[23] = {l: '25 ОУ', n: '25 ОУ Петър Берон', b: [40.66, 60.86, 67.54, 66.56], m: [40.2, 46.12, 49.46, 51.19]};
s[24] = {l: '26 СУ', n: '26 СУ Йордан Йовков', b: [31.99, 56.74, 57.22, 63.35], m: [24.0, 23.02, 34.84, 47.86]};
s[25] = {l: '27 СУ', n: '27 СУ Акад. Георги Караславов ', b: [24.92, 16.88, 33.14, 18.95], m: [17.93, 15.75, 18.21, 18.55]};
s[26] = {l: '28 СУ', n: '28 СУ Алеко Константинов', b: [28.63, 46.09, 50.79, 54.7], m: [22.26, 21.89, 30.87, 30.54]};
s[27] = {l: '29 СУ', n: '29 СУ Кузман Шапкарев', b: [14.0, 32.42, 35.75, null], m: [10.5, 18.17, 18.38, null]};
s[28] = {l: '30 СУ', n: '30 СУ Братя Миладинови', b: [36.55, 59.97, 59.07, 66.9], m: [27.26, 31.79, 37.23, 44.39]};
s[29] = {l: '31 СУ', n: '31 СУ Иван Вазов', b: [46.18, 74.85, 75.15, 77.37], m: [48.15, 58.94, 60.83, 66.2]};
s[30] = {l: '32 СУ', n: '32 СУ Св. Климент Охридски', b: [47.72, 76.87, 79.44, 76.82], m: [47.85, 61.45, 63.02, 60.36]};
s[31] = {l: '33 ОУ', n: '33 ОУ Санкт Петербург', b: [40.56, 66.09, 65.58, 60.67], m: [37.43, 43.25, 47.13, 40.61]};
s[32] = {l: '34 ОУ', n: '34 ОУ Стою Шишков', b: [40.1, 67.13, 68.59, 67.81], m: [39.6, 53.09, 52.63, 54.47]};
s[33] = {l: '35 СУ', n: '35 СЕУ Добри Войников', b: [44.33, 75.48, 70.17, 75.08], m: [40.95, 58.28, 59.95, 62.13]};
s[34] = {l: '36 СУ', n: '36 СУ Максим Горки', b: [45.91, 71.93, 70.2, 69.73], m: [47.64, 50.83, 52.53, 56.33]};
s[35] = {l: '37 СУ', n: '37 СУ Райна Княгиня', b: [17.4, 26.25, 18.61, 28.37], m: [12.7, 13.76, 12.74, 17.76]};
s[36] = {l: '38 ОУ', n: '38 ОУ Васил Априлов', b: [44.71, 77.78, 71.77, 76.51], m: [45.42, 62.22, 60.97, 68.31]};
s[37] = {l: '39 СУ', n: '39 СУ Петър Динеков', b: [38.33, 62.88, 66.73, 64.12], m: [36.69, 39.1, 52.3, 45.82]};
s[38] = {l: '40 СУ', n: '40 СУ Луи Пастьор', b: [38.15, 57.69, 57.04, 66.03], m: [36.16, 36.83, 37.66, 42.19]};
s[39] = {l: '41 ОУ', n: '41 ОУ Св. Патриарх Евтимий', b: [43.57, 70.1, 74.45, 73.52], m: [46.17, 52.34, 64.37, 66.84]};
s[40] = {l: '42 ОУ', n: '42 ОУ Хаджи Димитър', b: [35.78, 64.72, 56.58, 60.93], m: [32.78, 42.96, 39.07, 45.86]};
s[41] = {l: '43 ОУ', n: '43 ОУ Христо Смирненски', b: [39.65, 68.14, 63.0, 68.06], m: [33.78, 39.83, 38.81, 44.13]};
s[42] = {l: '44 СУ', n: '44 СУ Неофит Бозвели', b: [31.61, 60.25, 59.16, 60.14], m: [19.11, 31.99, 31.12, 38.3]};
s[43] = {l: '45 ОУ', n: '45 ОУ Константин Величков', b: [41.93, 66.22, 67.54, 64.64], m: [37.03, 40.51, 51.96, 42.81]};
s[44] = {l: '46 ОУ', n: '46 ОУ К. Фотинов', b: [30.26, 51.58, 45.04, 56.42], m: [19.53, 30.39, 25.91, 36.19]};
s[45] = {l: '47 СУ', n: '47 СУ Христо Г. Данов', b: [39.04, 69.88, 66.43, 61.27], m: [31.48, 42.74, 48.12, 50.2]};
s[46] = {l: '48 ОУ', n: '48 ОУ Й. Ковачев', b: [38.32, 60.46, 63.73, 64.33], m: [31.08, 33.75, 41.64, 46.96]};
s[47] = {l: '49 ОУ', n: '49 ОУ Бенито Хуарес', b: [39.03, 63.95, 64.4, 67.63], m: [41.16, 40.07, 48.7, 45.67]};
s[48] = {l: '50 ОУ', n: '50 ОУ Васил Левски', b: [35.13, 60.13, 61.65, 67.11], m: [25.45, 30.38, 45.7, 46.06]};
s[49] = {l: '51 СУ', n: '51 СУ Елисавета Багряна', b: [44.76, 74.43, 72.85, 74.2], m: [44.91, 57.24, 55.61, 58.3]};
s[50] = {l: '52 ОУ', n: '52 ОУ Цанко Церковски', b: [33.3, 67.18, 68.09, 64.7], m: [29.55, 45.55, 50.68, 46.88]};
s[51] = {l: '53 ОУ', n: '53 ОУ Николай Хрелков', b: [40.73, 55.93, 56.89, 49.21], m: [34.64, 34.68, 46.03, 33.11]};
s[52] = {l: '54 СУ', n: '54 СУ Св. Иван Рилски', b: [40.78, 70.04, 65.62, 68.91], m: [41.22, 42.31, 44.93, 48.98]};
s[53] = {l: '55 СУ', n: '55 СУ Петко Каравелов', b: [44.76, 72.25, 71.9, 75.47], m: [46.28, 58.13, 60.56, 64.54]};
s[54] = {l: '56 СУ', n: '56 СУ Проф. Константин Иречек', b: [36.34, 64.76, 66.6, 68.13], m: [37.67, 44.2, 46.83, 56.86]};
s[55] = {l: '58 ОУ', n: '58 ОУ Сергей Румянцев', b: [33.57, 54.48, 51.35, 49.52], m: [30.74, 20.06, 26.49, 27.78]};
s[56] = {l: '59 ОУ', n: '59 ОУ Васил Левски', b: [16.19, 19.62, 15.01, 10.06], m: [12.43, 13.31, 11.67, 9.14]};
s[57] = {l: '60 ОУ', n: '60 ОУ Св. Св. Кирил и Методий', b: [30.46, 46.01, 58.55, 58.03], m: [26.94, 26.09, 29.02, 37.92]};
s[58] = {l: '61 ОУ', n: '61 ОУ Св. Св. Кирил и Методий', b: [41.9, 64.41, 65.35, 68.8], m: [35.46, 39.61, 39.24, 43.97]};
s[59] = {l: '62 ОУ', n: '62 ОУ Христо Ботев', b: [null, 46.58, 48.13, 45.64], m: [null, 19.21, 22.95, 22.52]};
s[60] = {l: '63 ОУ', n: '63 ОУ Христо Ботев', b: [42.3, 70.1, 76.45, 76.54], m: [37.9, 37.34, 44.61, 55.7]};
s[61] = {l: '64 ОУ', n: '64 ОУ Цар Симеон Велики', b: [47.98, 60.3, 67.25, 70.75], m: [47.36, 32.76, 48.78, 48.27]};
s[62] = {l: '66 СУ', n: '66 СУ Филип Станиславов', b: [17.66, 25.14, 27.0, 30.95], m: [12.0, 14.21, 15.95, 16.39]};
s[63] = {l: '67 ОУ', n: '67 ОУ Васил Друмев', b: [11.38, 12.48, 10.73, 15.74], m: [9.15, 12.47, 11.2, 14.99]};
s[64] = {l: '68 СУ', n: '68 СУ Акад. Никола Обрешков', b: [35.27, 52.38, 54.8, 48.17], m: [29.72, 26.53, 32.04, 30.42]};
s[65] = {l: '69 СУ', n: '69 СУ Димитър Маринов', b: [19.62, 50.57, 50.16, 47.0], m: [18.52, 23.27, 26.45, 23.92]};
s[66] = {l: '70 ОУ', n: '70 ОУ Св. Климент Охридски', b: [16.03, 22.69, 15.68, 28.44], m: [14.37, 11.19, 13.82, 15.33]};
s[67] = {l: '72 ОУ', n: '72 ОУ Христо Ботев', b: [35.41, 51.42, 59.48, 62.36], m: [31.55, 24.31, 37.92, 46.71]};
s[68] = {l: '73 СУ', n: '73 СУ Владислав Граматик', b: [48.89, 82.02, 80.39, 79.88], m: [49.31, 69.19, 72.23, 67.52]};
s[69] = {l: '74 СУ', n: '74 СУ Гоце Делчев', b: [38.27, 55.62, 59.74, 59.29], m: [35.02, 27.24, 37.77, 33.47]};
s[70] = {l: '75 ОУ', n: '75 ОУ Тодор Каблешков', b: [11.08, 11.3, 11.82, 11.89], m: [11.07, 12.17, 12.37, 12.98]};
s[71] = {l: '76 ОУ', n: '76 ОУ Уилям Сароян', b: [34.86, 53.69, 46.88, 51.97], m: [33.78, 29.75, 25.58, 37.47]};
s[72] = {l: '77 ОУ', n: '77 ОУ Св. Св. Кирил и Методий', b: [31.43, 39.7, 54.43, 59.34], m: [24.55, 21.63, 26.26, 30.24]};
s[73] = {l: '79 СУ', n: '79 СУ Индира Ганди', b: [38.09, 62.93, 62.65, 61.31], m: [36.66, 41.17, 43.52, 42.91]};
s[74] = {l: '81 СУ', n: '81 СУ Виктор Юго', b: [41.0, 65.51, 64.6, 68.59], m: [41.19, 42.95, 52.28, 59.77]};
s[75] = {l: '82 ОУ', n: '82 ОУ Васил Априлов', b: [33.58, 51.0, 41.16, 56.68], m: [23.5, 23.94, 22.87, 32.63]};
s[76] = {l: '83 ОУ', n: '83 ОУ Елин Пелин', b: [36.69, 58.86, 61.5, 64.65], m: [37.9, 39.25, 43.69, 46.17]};
s[77] = {l: '84 ОУ', n: '84 ОУ Васил Левски', b: [29.36, 52.3, 58.08, 57.19], m: [25.0, 26.57, 33.42, 34.56]};
s[78] = {l: '85 СУ', n: '85 СУ Отец Паисий', b: [28.52, 54.65, 48.0, 52.0], m: [27.55, 30.93, 29.78, 26.0]};
s[79] = {l: '88 СУ', n: '88 СУ Димитър Попниколов', b: [38.18, 58.04, 62.99, 63.01], m: [36.22, 35.15, 46.44, 49.56]};
s[80] = {l: '89 ОУ', n: '89 ОУ д-р Христо Стамболски', b: [16.24, 14.97, 13.4, 32.92], m: [12.61, 13.38, 13.1, 17.17]};
s[81] = {l: '90 СУ', n: '90 СУ Ген. Хосе де Сан Мартин', b: [31.72, 48.44, 47.96, 60.76], m: [22.82, 23.13, 31.02, 33.06]};
s[82] = {l: '92 ОУ', n: '92 ОУ Димитър Талев', b: [34.85, 61.31, 61.72, 62.83], m: [27.14, 39.24, 41.6, 43.68]};
s[83] = {l: '93 СУ', n: '93 СУ Ал. Теодоров - Балан', b: [null, 54.2, 54.0, 51.1], m: [null, 25.76, 35.17, 28.05]};
s[84] = {l: '94 СУ', n: '94 СУ Д. Страшимиров', b: [14.41, 17.3, 17.33, 16.14], m: [12.62, 10.63, 11.72, 14.35]};
s[85] = {l: '95 СУ', n: '95 СУ Проф. Иван Шишманов', b: [39.21, 53.15, 54.87, 51.39], m: [32.27, 29.94, 39.9, 34.19]};
s[86] = {l: '96 СУ', n: '96 СУ Лев Николаевич Толстой', b: [36.38, 60.62, 66.28, 65.57], m: [32.86, 31.84, 44.65, 43.15]};
s[87] = {l: '97 СУ', n: '97 СУ Братя Миладинови', b: [33.45, 53.22, 54.39, 56.17], m: [23.7, 27.17, 37.98, 31.25]};
s[88] = {l: '100 ОУ', n: '100 ОУ Найден Геров', b: [39.97, 56.21, 52.0, 64.07], m: [31.12, 32.65, 30.99, 30.63]};
s[89] = {l: '101 СУ', n: '101 СУ Бачо Киро', b: [34.04, 60.74, 48.6, 59.38], m: [31.56, 35.35, 37.27, 38.43]};
s[90] = {l: '102 ОУ', n: '102 ОУ Панайот Волов', b: [28.04, 49.46, 48.48, 51.55], m: [19.22, 26.47, 28.37, 30.14]};
s[91] = {l: '103 ОУ', n: '103 ОУ Васил Левски', b: [21.83, 11.1, 10.9, 11.76], m: [12.1, 15.62, 12.81, 11.99]};
s[92] = {l: '104 ОУ', n: '104 ОУ Захари Стоянов', b: [43.38, 75.91, 72.21, 74.78], m: [41.1, 52.62, 59.79, 60.07]};
s[93] = {l: '105 СУ', n: '105 СУ Атанас Далчев', b: [42.77, 71.48, 71.88, 67.14], m: [42.17, 48.28, 55.95, 50.19]};
s[94] = {l: '106 ОУ', n: '106 ОУ Григорий Цамблак', b: [12.38, 13.94, 18.08, 10.58], m: [10.55, 12.2, 15.25, 13.21]};
s[95] = {l: '107 ОУ', n: '107 ОУ Хан Крум', b: [49.55, 80.41, 79.85, 77.92], m: [54.27, 73.32, 75.23, 73.05]};
s[96] = {l: '108 СУ', n: '108 СУ Никола Беловеждов', b: [32.41, 61.44, 55.27, 60.77], m: [25.02, 44.59, 33.57, 40.48]};
s[97] = {l: '109 ОУ', n: '109 ОУ Христо Смирненски', b: [40.91, 70.08, 63.95, 73.51], m: [39.81, 54.66, 48.47, 57.45]};
s[98] = {l: '112 ОУ', n: '112 ОУ Стоян Заимов', b: [41.31, 66.74, 70.88, 66.82], m: [42.27, 44.89, 52.68, 49.29]};
s[99] = {l: '113 СУ', n: '113 СУ Сава Филаретов', b: [12.88, 17.84, 12.75, 13.75], m: [12.33, 13.37, 15.79, 11.21]};
s[100] = {l: '118 СУ', n: '118 СУ Акад. Людмил Стоянов', b: [39.28, 71.12, 67.02, 68.22], m: [41.94, 47.41, 47.32, 54.23]};
s[101] = {l: '119 СУ', n: '119 СУ Акад. Михаил Арнаудов', b: [43.74, 72.87, 74.34, 74.0], m: [46.1, 56.33, 61.4, 65.08]};
s[102] = {l: '120 ОУ', n: '120 ОУ Г. С. Раковски', b: [43.75, 73.44, 73.86, 72.52], m: [46.31, 60.91, 57.01, 60.82]};
s[103] = {l: '121 СУ', n: '121 СУ Георги Измирлиев', b: [39.16, 63.46, 57.92, 64.89], m: [30.43, 35.08, 38.92, 47.56]};
s[104] = {l: '122 ОУ', n: '122 ОУ Н. Лилиев', b: [43.37, 72.37, 70.5, 74.06], m: [46.0, 52.0, 59.14, 59.55]};
s[105] = {l: '123 СУ', n: '123 СУ Стефан Стамболов', b: [29.87, 43.9, 34.45, 36.87], m: [21.98, 14.27, 18.49, 17.98]};
s[106] = {l: '124 ОУ', n: '124 ОУ Васил Левски', b: [11.93, null, 26.06, 24.0], m: [11.93, null, 21.34, 12.89]};
s[107] = {l: '125 СУИЧЕ', n: '125 СУИЧЕ Боян Пенев', b: [48.65, 78.34, 75.92, 78.66], m: [49.49, 62.57, 65.2, 69.18]};
s[108] = {l: '126 ОУ', n: '126 ОУ Петко Тодоров', b: [36.66, 63.25, 67.21, 68.85], m: [30.56, 42.74, 43.96, 48.86]};
s[109] = {l: '127 СУ', n: '127 СУ Иван Николаевич Денкоглу', b: [36.64, 62.24, 66.03, 66.6], m: [39.2, 41.18, 45.6, 50.57]};
s[110] = {l: '128 СУ', n: '128 СУ Алберт Айнщайн', b: [38.81, 65.17, 62.25, 68.3], m: [34.07, 46.9, 41.05, 54.24]};
s[111] = {l: '129 ОУ', n: '129 ОУ Антим I', b: [42.42, 73.45, 72.43, 73.91], m: [41.96, 48.71, 52.97, 54.43]};
s[112] = {l: '130 СУ', n: '130 СУ Стефан Караджа', b: [27.89, 47.7, 49.24, 29.73], m: [21.35, 24.01, 24.52, 18.02]};
s[113] = {l: '131 СУ', n: '131 СУ Климент Аркад. Тимирязев', b: [29.63, 50.48, 38.45, 48.7], m: [24.25, 20.39, 23.97, 29.49]};
s[114] = {l: '132 СУ', n: '132 СУ Ваня Войнова', b: [31.07, 50.04, 47.33, 48.35], m: [25.72, 25.39, 27.05, 27.11]};
s[115] = {l: '133 СУ', n: '133 СУ Александър Сергеевич Пушкин', b: [47.17, 78.87, 76.68, 77.06], m: [47.7, 56.81, 60.44, 64.55]};
s[116] = {l: '134 СУ', n: '134 СУ Димчо Дебелянов', b: [45.52, 73.97, 74.68, 74.27], m: [48.72, 55.7, 62.9, 63.51]};
s[117] = {l: '135 СУ', n: '135 СУ Ян Амос Коменски', b: [32.25, 60.88, 53.6, 55.76], m: [27.58, 34.36, 30.04, 34.49]};
s[118] = {l: '136 ОУ', n: '136 ОУ Любен Каравелов', b: [16.19, 18.15, 15.66, 21.42], m: [11.42, 12.6, 15.02, 13.45]};
s[119] = {l: '137 СУ', n: '137 СУ Ангел Кънчев', b: [37.32, 64.5, 59.9, 59.76], m: [36.93, 42.76, 39.76, 45.08]};
s[120] = {l: '138 СУ', n: '138 СУ Проф. Васил Златарски', b: [40.43, 67.85, 66.05, 65.51], m: [43.11, 55.52, 54.29, 54.88]};
s[121] = {l: '139 ОУ', n: '139 ОУ Захарий Круша', b: [40.37, 68.62, 66.93, 71.19], m: [40.55, 44.15, 47.99, 58.09]};
s[122] = {l: '140 СУ', n: '140 СУ Иван Богоров', b: [28.37, 49.11, 46.7, 49.21], m: [23.01, 22.12, 28.86, 28.13]};
s[123] = {l: '141 ОУ', n: '141 ОУ Народни будители', b: [25.38, null, 32.09, 24.67], m: [22.81, null, 11.91, 11.38]};
s[124] = {l: '142 ОУ', n: '142 ОУ Веселин Ханчев', b: [41.93, 71.39, 68.95, 72.19], m: [38.58, 44.52, 48.18, 52.67]};
s[125] = {l: '143 ОУ', n: '143 ОУ Г. Бенковски', b: [44.56, 70.0, 67.7, 73.08], m: [46.62, 54.02, 54.27, 59.11]};
s[126] = {l: '144 СУ', n: '144 СУ Народни будители', b: [36.69, 59.88, 59.71, 62.28], m: [33.17, 31.87, 39.49, 38.68]};
s[127] = {l: '145 ОУ', n: '145 ОУ Симеон Радев', b: [51.85, 85.39, 80.68, 80.62], m: [58.12, 71.05, 72.56, 75.05]};
s[128] = {l: '147 ОУ', n: '147 ОУ Йордан Радичков', b: [15.9, 20.29, 8.82, 25.4], m: [16.26, 12.43, 10.91, 16.09]};
s[129] = {l: '148 ОУ', n: '148 ОУ Прф. Д-р Л. Милетич', b: [29.83, 60.26, 46.59, 54.49], m: [19.63, 28.39, 24.6, 32.99]};
s[130] = {l: '149 СУ', n: '149 СУ Иван Хаджийски', b: [33.33, 52.99, 52.22, 57.75], m: [26.97, 30.61, 32.78, 34.6]};
s[131] = {l: '150 ОУ', n: '150 ОУ Цар Симеон I', b: [33.51, 60.79, 62.48, 57.12], m: [29.66, 33.73, 44.95, 40.09]};
s[132] = {l: '156 ОУ', n: '156 ОУ Васил Левски', b: [30.93, 47.21, 39.63, 58.3], m: [19.59, 28.98, 26.09, 38.22]};
s[133] = {l: '159 ОУ', n: '159 ОУ Васил Левски', b: [35.13, 54.09, 65.09, 62.33], m: [25.56, 17.43, 39.64, 34.57]};
s[134] = {l: '162 ОУ', n: '162 ОУ Отец Паисий', b: [22.44, 33.25, 30.99, 27.14], m: [13.07, 13.62, 16.27, 18.38]};
s[135] = {l: '163 ОУ', n: '163 ОУ Черноризец Храбър', b: [37.52, 72.59, 69.96, 72.34], m: [36.71, 46.15, 53.78, 59.56]};
s[136] = {l: '199 ОУ', n: '199 ОУ Св. Ап. Йоан Богослов', b: [26.42, 52.82, 52.94, 49.06], m: [15.62, 38.62, 38.58, 26.48]};
s[137] = {l: 'Луи Брайл', n: 'Специално училище за ученици с нарушено зрение Луи Брайл', b: [33.92, null, 41.57, null], m: [21.8, null, 24.5, null]};
s[138] = {l: 'Национално СУ', n: 'Национално СУ София', b: [42.46, 70.82, 63.17, 67.47], m: [40.82, 45.85, 45.47, 46.28]};
s[139] = {l: 'НМУ', n: 'Национално музикално училище', b: [41.51, 68.64, 63.45, 70.92], m: [36.04, 39.64, 37.35, 45.54]};
s[140] = {l: 'НУКК', n: 'НУКК (Италиански лицей)', b: [49.99, 77.54, 79.61, 79.55], m: [50.97, 68.06, 61.92, 68.67]};
s[141] = {l: 'СМГ', n: 'СМГ Паисий Хилендарски', b: [55.54, 90.13, 88.46, 91.92], m: [63.64, 94.93, 94.46, 96.38]};
s[142] = {l: 'Сп. у-ще В. Левски', n: '166 спортно у-ще Васил Левски', b: [28.68, 50.19, 40.58, 47.41], m: [23.55, 27.08, 20.88, 26.69]};
s[143] = {l: 'Сп. у-ще ген. В. Стойчев', n: 'Спортно у-ще ген. Владимир Стойчев', b: [29.81, 38.27, 47.34, 50.45], m: [22.9, 18.49, 23.52, 27.16]};
s[144] = {l: 'Сп. у-ще Неофит Рилски', n: '153 спортно у-ще Неофит Рилски', b: [24.11, 30.06, 52.33, 35.76], m: [14.71, 14.52, 23.08, 18.16]};
s[145] = {l: 'Сп. у-ще Св. Наум', n: '57 спортно училище Св. Наум Охридски', b: [19.55, 21.71, 35.83, 25.1], m: [10.9, 12.75, 19.19, 16.13]};
s[146] = {l: 'У-ще за танцово изкуство', n: 'Училище за танцово изкуство', b: [34.47, 61.15, 59.64, 58.03], m: [31.05, 30.62, 32.24, 30.98]};
s[147] = {l: 'У-ще за ученици с увр. слух', n: 'Специално училище за ученици с увреден слух', b: [23.65, 20.88, 18.2, 29.73], m: [28.14, 10.7, 22.5, 25.23]};
// София - частни училища
s[148] = {l: 'Абрахам Линкълн', n: 'ЧСУ с чуждоезиков профил Абрахам Линкълн', b: [38.25, 69.75, 68.28, 64.14], m: [41.0, 59.88, 41.17, 49.82]};
s[149] = {l: 'Азбуки', n: 'ЧОУ Азбуки', b: [null, 77.28, 80.26, 78.16], m: [null, 55.72, 64.77, 62.56]};
s[150] = {l: 'Артис', n: 'ЧСУ Артис', b: [44.25, 58.72, 64.5, 62.94], m: [41.7, 34.15, 39.7, 44.14]};
s[151] = {l: 'Банкерче', n: 'ЧОУ Банкерче', b: [null, 67.67, null, null], m: [null, 44.5, null, null]};
s[152] = {l: 'Британика', n: 'ЧСЕУ Британика', b: [37.56, 69.61, 64.5, 73.48], m: [49.0, 60.47, 51.81, 61.92]};
s[153] = {l: 'Българско Школо', n: 'ЧСОУ Българско Школо', b: [47.36, 78.45, 78.45, 77.57], m: [49.36, 56.23, 68.56, 71.48]};
s[154] = {l: 'Васил Златарски', n: 'ЧОУ Проф. д-р Васил Златарски', b: [null, 73.57, 70.17, 62.79], m: [null, 54.73, 57.03, 43.37]};
s[155] = {l: 'Веда', n: 'ЧСУ с немски език Веда', b: [48.88, 83.28, 80.39, 79.67], m: [54.0, 78.76, 73.34, 79.63]};
s[156] = {l: 'Г. С. Уланова', n: 'ЧСЕУ Г. С. Уланова', b: [48.5, 73.33, 74.71, 72.06], m: [48.57, 38.33, 54.25, 68.53]};
s[157] = {l: 'Джани Родари', n: 'ЧОУ Джани Родари', b: [43.25, 40.0, 92.0, 53.86], m: [35.0, 10.75, 54.25, 34.39]};
s[158] = {l: 'Дорис Тенеди', n: 'ЧЕСУ Дорис Тенеди', b: [47.56, 81.5, 77.37, 77.5], m: [48.61, 68.98, 57.63, 56.38]};
s[159] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [40.26, 63.69, 60.78, 59.17], m: [43.34, 38.75, 46.53, 44.82]};
s[160] = {l: 'Евл. и Хр. Георгиеви', n: 'ЧСУ Евлоги и Христо Георгиеви', b: [null, 70.75, 74.67, 81.25], m: [null, 41.5, 60.17, 62.75]};
s[161] = {l: 'Езиков свят', n: 'ЧОУ Езиков свят', b: [26.0, 37.5, 54.13, null], m: [18.0, 17.75, 19.0, null]};
s[162] = {l: 'Ерих Кестнер', n: 'ЧОУ Ерих Кестнер', b: [46.18, 76.28, 80.14, 83.0], m: [48.43, 60.91, 69.86, 83.72]};
s[163] = {l: 'ЕСПА', n: 'ЧСУ с РЧЕО ЕСПА', b: [52.0, 78.97, 81.24, 81.25], m: [52.2, 68.94, 84.71, 80.59]};
s[164] = {l: 'Изгрев', n: 'ЧОУ Изгрев', b: [51.0, 59.0, 87.5, 59.3], m: [40.67, 33.75, 36.25, 52.7]};
s[165] = {l: 'Куест', n: 'ЧОУ Куест', b: [null, 68.17, 67.33, 72.67], m: [null, 30.97, 49.33, 60.0]};
s[166] = {l: 'Мария Монтесори', n: 'ЧОУ Д-р Мария Монтесори', b: [56.0, 49.5, 46.75, 58.0], m: [62.0, 27.0, 39.5, 28.5]};
s[167] = {l: 'Меридиан 22', n: 'ЧОУ Меридиан 22', b: [48.67, 80.69, 73.95, 80.18], m: [47.0, 56.7, 57.8, 65.34]};
s[168] = {l: 'Николай Райнов', n: 'ЧСУ Проф. Николай Райнов', b: [null, 38.86, 55.83, 57.0], m: [null, 26.46, 44.04, 39.04]};
s[169] = {l: 'Образов. Технологии', n: 'ЧОУ Образователни Технологии', b: [40.49, 71.32, 66.85, 69.3], m: [43.75, 61.87, 55.26, 57.34]};
s[170] = {l: 'Орфей', n: 'ЧСУ Орфей', b: [null, 91.75, 62.25, null], m: [null, 86.75, 51.5, null]};
s[171] = {l: 'П. Р. Славейков', n: 'ЧСУ П. Р. Славейков', b: [43.0, 75.96, 76.0, 69.75], m: [36.75, 59.09, 49.13, 53.34]};
s[172] = {l: 'Петър Берон', n: 'ЧОУ Д-р Петър Берон', b: [41.11, 76.32, 74.18, 72.11], m: [47.07, 63.89, 61.15, 57.43]};
s[173] = {l: 'Прогресивно обр.', n: 'ОПУ Прогресивно обр.', b: [null, null, 70.6, 85.29], m: [null, null, 42.25, 88.79]};
s[174] = {l: 'ПЧМГ', n: 'Първа Частна Математическа Гимназия', b: [53.49, 86.64, 84.62, 87.17], m: [63.11, 90.95, 95.21, 95.81]};
s[175] = {l: 'Рьорих', n: 'ЧСУ Рьорих', b: [39.7, 57.75, 67.94, 48.0], m: [34.2, 37.92, 47.44, 22.65]};
s[176] = {l: 'Св. Георги', n: 'ЧСУ Свети Георги', b: [41.38, 73.94, 65.79, 71.34], m: [45.44, 50.16, 52.74, 53.3]};
s[177] = {l: 'Св. Климент Охридски', n: 'Св. Климент Охридски', b: [51.58, 80.5, 82.88, 77.35], m: [57.5, 59.04, 84.78, 80.77]};
s[178] = {l: 'Св. Наум', n: 'ЧПСУ Свети Наум', b: [null, 59.83, 65.7, 69.5], m: [null, 44.67, 45.15, 53.31]};
s[179] = {l: 'Св. София', n: 'ЧОУ Света София', b: [56.1, 89.75, 89.23, 88.36], m: [62.75, 87.66, 89.9, 92.13]};
s[180] = {l: 'Светлина', n: 'ЧОУ Светлина', b: [39.68, 57.4, 72.75, 74.14], m: [38.5, 49.7, 41.0, 73.53]};
s[181] = {l: 'Томас Едисън', n: 'ЧОУ Томас Едисън', b: [null, null, null, 78.42], m: [null, null, null, 76.35]};
s[182] = {l: 'Увекинд', n: 'ЧСУ Увекинд', b: [43.34, 72.77, 70.78, 68.94], m: [46.86, 52.92, 54.15, 57.96]};
s[183] = {l: 'Цар Симеон Велики', n: 'ЧСУ Цар Симеон Велики', b: [46.19, 73.15, 67.0, 64.5], m: [46.0, 62.68, 57.15, 46.46]};

// Пловдив - индексация
si['Пловдив'] = {n: [301, 345], p: [346, 348]};
// Пловдив - държавни училища
s[301] = {l: 'МГ Акад. Кирил Попов', n: 'МГ Акад. Кирил Попов', b: [55.67, 90.84, 90.11, 89.43], m: [63.87, 94.25, 92.26, 92.46]};
s[302] = {l: 'НУМТИ', n: 'НУМТИ Добрин Петков', b: [40.64, 69.86, 67.44, 66.41], m: [31.31, 36.48, 38.55, 38.96]};
s[303] = {l: 'ОУ А. Константинов', n: 'ОУ Алеко Константинов', b: [46.66, 75.38, 74.79, 72.97], m: [43.68, 54.37, 61.02, 57.1]};
s[304] = {l: 'ОУ В. Петлешков', n: 'ОУ Васил Петлешков', b: [37.88, 67.77, 64.34, 60.16], m: [38.11, 44.66, 42.44, 36.93]};
s[305] = {l: 'ОУ Васил Левски', n: 'ОУ Васил Левски', b: [40.64, 70.08, 65.93, 65.38], m: [37.66, 53.32, 45.62, 49.36]};
s[306] = {l: 'ОУ Гео Милев', n: 'ОУ Гео Милев', b: [13.18, 18.2, 11.97, 17.83], m: [20.48, 12.22, 14.37, 10.78]};
s[307] = {l: 'ОУ Д. Дебелянов', n: 'ОУ Димчо Дебелянов', b: [13.59, 11.11, 8.7, 10.7], m: [14.95, 15.32, 14.15, 12.92]};
s[308] = {l: 'ОУ Д. Талев', n: 'ОУ Димитър Талев', b: [39.92, 67.8, 59.58, 65.37], m: [37.3, 39.98, 37.62, 45.23]};
s[309] = {l: 'ОУ Д. Хаджидеков', n: 'ОУ Душо Хаджидеков', b: [46.36, 72.0, 74.13, 74.62], m: [45.58, 52.88, 62.64, 63.62]};
s[310] = {l: 'ОУ Димитър Димов', n: 'ОУ Димитър Димов', b: [20.9, 48.52, 60.26, 63.8], m: [23.22, 33.26, 46.25, 45.79]};
s[311] = {l: 'ОУ Драган Манчов', n: 'ОУ Драган Манчов', b: [41.01, 65.51, 64.87, 71.55], m: [36.51, 41.49, 40.66, 44.66]};
s[312] = {l: 'ОУ Екзарх Антим I', n: 'ОУ Екзарх Антим I', b: [43.62, 65.14, 70.65, 69.1], m: [44.69, 45.41, 60.12, 56.01]};
s[313] = {l: 'ОУ Елин Пелин', n: 'ОУ Елин Пелин', b: [37.63, 62.2, 56.98, 65.33], m: [45.22, 35.04, 39.5, 43.77]};
s[314] = {l: 'ОУ З. Стоянов', n: 'ОУ Захари Стоянов', b: [32.15, 49.59, 40.88, 54.34], m: [33.92, 34.69, 28.98, 32.74]};
s[315] = {l: 'ОУ Й. Йовков', n: 'ОУ Йордан Йовков', b: [10.72, 16.39, 16.39, 13.67], m: [14.46, 14.43, 16.85, 14.82]};
s[316] = {l: 'ОУ К. Честеменски', n: 'ОУ Кочо Честеменски', b: [43.77, 68.1, 69.47, 70.95], m: [41.18, 55.43, 46.5, 55.07]};
s[317] = {l: 'ОУ Кн. Александър I', n: 'ОУ Княз Александър I', b: [45.66, 79.99, 73.46, 76.06], m: [46.59, 57.86, 54.66, 64.82]};
s[318] = {l: 'ОУ П. Волов', n: 'ОУ Панайот Волов', b: [8.33, 9.59, 6.1, 5.73], m: [10.92, 9.82, 13.18, 10.83]};
s[319] = {l: 'ОУ П. Славейков', n: 'ОУ Пенчо Славейков', b: [8.93, 8.19, 6.45, 8.97], m: [10.34, 11.4, 11.18, 11.7]};
s[320] = {l: 'ОУ Петър Берон', n: 'ОУ Д-р Петър Берон', b: [38.82, 69.81, 71.73, 66.93], m: [32.33, 46.48, 44.59, 49.92]};
s[321] = {l: 'ОУ Р. Княгиня', n: 'ОУ Райна Княгиня', b: [45.42, 70.97, 69.16, 72.69], m: [47.44, 51.17, 52.48, 57.99]};
s[322] = {l: 'ОУ С. Михайловски', n: 'ОУ Стоян Михайловски', b: [37.87, 67.0, 52.63, 56.74], m: [26.64, 33.92, 36.85, 33.32]};
s[323] = {l: 'ОУ Т. Каблешков', n: 'ОУ Т. Каблешков', b: [39.12, 60.2, 42.92, 65.43], m: [30.0, 31.08, 30.98, 46.34]};
s[324] = {l: 'ОУ Тютюнджян', n: 'ОУ Тютюнджян', b: [39.72, 70.27, 64.36, 67.36], m: [34.49, 45.29, 49.3, 52.12]};
s[325] = {l: 'ОУ Яне Сандански', n: 'ОУ Яне Сандански', b: [41.35, 69.09, 64.66, 68.12], m: [39.67, 48.33, 47.03, 52.33]};
s[326] = {l: 'Сп. у-ще Васил Левски', n: 'Спортно училище Васил Левски', b: [26.03, 47.06, 40.25, 44.66], m: [18.54, 22.19, 20.8, 23.19]};
s[327] = {l: 'СУ Братя Миладинови', n: 'СУ Братя Миладинови', b: [33.32, 61.47, 52.39, 61.26], m: [30.82, 32.74, 31.54, 41.01]};
s[328] = {l: 'СУ Димитър Матевски', n: 'СУ Димитър Матевски', b: [37.9, 59.04, 55.18, 57.69], m: [33.98, 31.52, 32.83, 35.07]};
s[329] = {l: 'СУ К. Величков', n: 'СУ Константин Величков', b: [29.92, 51.04, 50.93, 41.53], m: [18.85, 25.05, 31.52, 25.11]};
s[330] = {l: 'СУ Любен Каравелов', n: 'СУ Любен Каравелов', b: [37.16, 48.9, 58.67, 54.78], m: [24.77, 22.5, 31.08, 30.96]};
s[331] = {l: 'СУ Найден Геров', n: 'СУ Найден Геров', b: [9.06, 9.65, 8.62, 8.7], m: [13.52, 11.84, 11.67, 12.59]};
s[332] = {l: 'СУ Никола Вапцаров', n: 'СУ Никола Вапцаров', b: [35.93, 58.05, 62.78, 65.16], m: [30.3, 31.92, 47.97, 43.96]};
s[333] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Крачолов Яворов', b: [32.72, 59.72, 56.63, 64.75], m: [31.61, 39.55, 34.4, 44.78]};
s[334] = {l: 'СУ Св. К. Кирил Философ', n: 'СУ Св. К. Кирил Философ', b: [40.19, 64.56, 62.9, 67.9], m: [35.8, 41.09, 44.71, 47.33]};
s[335] = {l: 'СУ Св. Климент Охридски', n: 'СУ Св. Климент Охридски', b: [31.69, 62.66, 53.8, 59.05], m: [31.08, 41.53, 38.35, 37.9]};
s[336] = {l: 'СУ Св. П. Хилендарски', n: 'СУ Св. П. Хилендарски', b: [38.64, 58.3, 58.29, 60.53], m: [35.15, 42.67, 40.62, 43.52]};
s[337] = {l: 'СУ Св. Патриарх Евтимий', n: 'СУ Св. Патриарх Евтимий', b: [48.11, 79.27, 77.65, 80.07], m: [52.13, 67.79, 65.53, 71.12]};
s[338] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [39.02, 60.24, 62.21, 63.74], m: [35.62, 39.38, 37.84, 36.79]};
s[339] = {l: 'СУ Св. Седмочисленици', n: 'СУ Св. Седмочисленици', b: [36.3, 58.25, 59.81, 70.02], m: [33.92, 36.37, 43.37, 48.42]};
s[340] = {l: 'СУ Св. Софроний Врачански', n: 'СУ Св. Софроний Врачански', b: [38.91, 66.74, 64.31, 59.73], m: [30.87, 56.37, 40.82, 34.58]};
s[341] = {l: 'СУ Симон Боливар', n: 'СУ Симон Боливар', b: [30.79, 37.17, 37.51, 41.99], m: [20.0, 16.0, 22.36, 20.59]};
s[342] = {l: 'СУ Христо Г. Данов', n: 'СУ Христо Груев Данов', b: [38.38, 57.75, 56.42, 55.17], m: [33.85, 26.99, 36.94, 28.14]};
s[343] = {l: 'СУ Цар Симеон Велики', n: 'СУ Цар Симеон Велики', b: [40.93, 64.31, 65.64, 59.54], m: [36.76, 43.36, 40.97, 36.45]};
s[344] = {l: 'СУ Черноризец Храбър', n: 'СУ Черноризец Храбър', b: [44.72, 59.5, 72.82, 72.02], m: [38.63, 37.24, 49.4, 53.35]};
s[345] = {l: 'У-ще за ученици с увр. слух', n: 'Специално училище за ученици с увреден слух', b: [9.4, 4.25, 12.5, 11.33], m: [13.0, 11.75, 12.0, 14.33]};
// Пловдив - частни училища
s[346] = {l: 'Бъдеще', n: 'ЧОУ Бъдеще', b: [35.35, 60.31, 71.56, 67.33], m: [29.92, 33.94, 59.42, 34.42]};
s[347] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [36.31, 63.03, 67.59, 67.66], m: [34.0, 38.15, 61.3, 62.72]};
s[348] = {l: 'Класик', n: 'ЧОУ Класик', b: [41.55, 59.42, 54.17, 65.83], m: [36.8, 24.75, 34.5, 54.08]};

// Варна - индексация
si['Варна'] = {n: [401, 437], p: [438, 441]};
// Варна - държавни училища
s[401] = {l: '2 ОУ', n: '2 ОУ Н. Вапцаров', b: [36.84, 61.53, 59.2, 64.19], m: [31.82, 30.13, 35.92, 45.55]};
s[402] = {l: '3 ОУ', n: '3 ОУ Ангел Кънчев', b: [41.71, 65.44, 67.97, 69.17], m: [43.53, 40.03, 50.42, 50.91]};
s[403] = {l: '7 СУ', n: '7 СУ Найден Геров', b: [44.02, 72.45, 72.27, 76.11], m: [49.19, 60.8, 67.09, 71.56]};
s[404] = {l: 'МГ Д-р Петър Берон', n: 'МГ Д-р Петър Берон', b: [54.89, 89.93, 90.43, 91.63], m: [64.38, 96.13, 96.45, 95.59]};
s[405] = {l: 'НУИ Добри Христов', n: 'НУИ Добри Христов', b: [35.9, 61.3, 62.8, 65.28], m: [30.63, 33.11, 44.55, 38.0]};
s[406] = {l: 'ОУ А. Страшимиров', n: 'ОУ Антон Страшимиров', b: [38.57, 66.7, 61.33, 66.89], m: [31.21, 33.36, 43.83, 46.23]};
s[407] = {l: 'ОУ Васил Априлов', n: 'ОУ Васил Априлов', b: [36.25, 59.04, 63.64, 66.13], m: [30.12, 32.24, 44.62, 44.57]};
s[408] = {l: 'ОУ Васил Друмев', n: 'ОУ Васил Друмев', b: [36.91, 62.23, 63.19, 64.69], m: [36.56, 38.79, 52.55, 48.6]};
s[409] = {l: 'ОУ Г. С. Раковски', n: 'ОУ Г. С. Раковски', b: [41.58, 71.76, 70.79, 76.12], m: [44.42, 52.61, 52.09, 69.17]};
s[410] = {l: 'ОУ Добри Чинтулов', n: 'ОУ Добри Чинтулов', b: [38.04, 62.39, 64.59, 63.58], m: [33.94, 37.93, 50.56, 52.58]};
s[411] = {l: 'ОУ Захари Стоянов', n: 'ОУ Захари Стоянов', b: [45.34, 77.58, 75.4, 72.95], m: [47.01, 59.59, 64.34, 61.2]};
s[412] = {l: 'ОУ Иван Вазов', n: 'ОУ Иван Вазов', b: [31.45, 51.17, 57.64, 52.82], m: [26.81, 34.5, 32.75, 36.0]};
s[413] = {l: 'ОУ Йордан Йовков', n: 'ОУ Йордан Йовков', b: [40.88, 66.73, 67.16, 72.83], m: [38.64, 43.88, 48.67, 54.24]};
s[414] = {l: 'ОУ К. Арабаджиев', n: 'ОУ Константин Арабаджиев', b: [27.3, 45.18, 52.13, 61.41], m: [41.2, 35.75, 43.39, 47.61]};
s[415] = {l: 'ОУ Кап. Петко войвода', n: 'ОУ Кап. Петко войвода', b: [31.4, 62.31, 41.18, 59.13], m: [22.5, 30.06, 22.55, 25.71]};
s[416] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [46.13, 78.23, 77.18, 76.71], m: [50.66, 62.77, 64.92, 65.77]};
s[417] = {l: 'ОУ Княз Борис I', n: 'ОУ Св. Княз Борис I', b: [30.09, 49.96, 49.59, 37.74], m: [22.29, 28.83, 32.41, 20.07]};
s[418] = {l: 'ОУ Отец Паисий', n: 'ОУ Отец Паисий', b: [7.21, 7.58, 11.09, 10.43], m: [16.71, 13.15, 10.58, 11.2]};
s[419] = {l: 'ОУ П. Славейков', n: 'ОУ Петко Славейков', b: [47.92, 75.19, 75.4, 78.74], m: [50.84, 65.51, 71.54, 71.15]};
s[420] = {l: 'ОУ Панайот Волов', n: 'ОУ Панайот Волов', b: [38.04, 58.19, 68.09, 59.92], m: [33.28, 31.09, 50.44, 34.16]};
s[421] = {l: 'ОУ Патр. Евтимий', n: 'ОУ Св. Патриарх Евтимий', b: [40.44, 59.53, 58.51, 58.09], m: [31.83, 37.8, 38.55, 37.77]};
s[422] = {l: 'ОУ С. Михайловски', n: 'ОУ Стоян Михайловски', b: [33.22, 56.05, 51.03, 48.26], m: [33.44, 36.67, 30.23, 27.2]};
s[423] = {l: 'ОУ Св. Иван Рилски', n: 'ОУ Св. Иван Рилски', b: [16.29, 30.15, 17.65, 24.87], m: [10.42, 11.47, 13.33, 18.19]};
s[424] = {l: 'ОУ Стефан Караджа', n: 'ОУ Стефан Караджа', b: [38.81, 64.92, 65.39, 66.6], m: [33.56, 44.64, 49.02, 44.06]};
s[425] = {l: 'ОУ Христо Ботев', n: 'ОУ Христо Ботев', b: [32.58, 47.63, 45.51, 53.4], m: [27.23, 26.92, 27.63, 34.14]};
s[426] = {l: 'ОУ Цар Симеон І', n: 'ОУ Цар Симеон І', b: [40.24, 60.53, 65.25, 63.98], m: [35.32, 35.83, 49.12, 45.06]};
s[427] = {l: 'ОУ Черн. Храбър', n: 'ОУ Черноризец Храбър', b: [38.14, 67.68, 70.47, 69.18], m: [38.85, 52.56, 52.52, 49.49]};
s[428] = {l: 'Сп. у-ще Г. Бенковски', n: 'Спортно у-ще Г. Бенковски', b: [26.1, 39.49, 46.36, 46.83], m: [17.9, 13.94, 23.49, 23.95]};
s[429] = {l: 'СУ Ал. С. Пушкин', n: 'СУ Ал. С. Пушкин', b: [46.38, 73.41, 75.9, 77.06], m: [50.17, 54.38, 60.93, 66.89]};
s[430] = {l: 'СУ Гео Милев', n: 'СУ Гео Милев', b: [41.79, 69.92, 69.26, 71.68], m: [43.93, 53.67, 54.13, 57.01]};
s[431] = {l: 'СУ Д. Дебелянов', n: 'СУ Димчо Дебелянов', b: [35.76, 63.36, 58.04, 61.44], m: [24.76, 35.94, 42.07, 36.14]};
s[432] = {l: 'СУ Елин Пелин', n: 'СУ Елин Пелин', b: [21.81, 31.3, 20.14, 30.38], m: [13.94, 14.98, 15.7, 20.38]};
s[433] = {l: 'СУ за хуман. науки и изк.', n: 'СУ за хуманитарни науки и изкуства', b: [40.3, 67.13, 68.48, 72.69], m: [36.59, 34.34, 42.12, 52.65]};
s[434] = {l: 'СУ Л. Каравелов', n: 'СУ Л. Каравелов', b: [18.89, 36.94, 16.86, 24.43], m: [18.07, 21.61, 15.93, 13.19]};
s[435] = {l: 'СУ Неофит Бозавели', n: 'СУ Неофит Бозавели', b: [30.69, 41.41, 48.12, 46.57], m: [26.68, 21.06, 29.25, 28.16]};
s[436] = {l: 'СУ Пейо К. Яворов', n: 'СУ Пейо К. Яворов', b: [35.06, 63.41, 55.18, 64.3], m: [26.65, 39.98, 35.18, 41.67]};
s[437] = {l: 'СУ Св. Климент Охридски', n: 'СУ Св. Климент Охридски', b: [44.04, 75.19, 73.87, 71.33], m: [42.39, 59.07, 61.28, 54.13]};
// Варна - частни училища
s[438] = {l: 'Аз съм българче', n: 'ЧСУ Аз съм българче', b: [null, 44.5, 46.79, 43.5], m: [null, 11.0, 28.64, 28.36]};
s[439] = {l: 'Малкият принц', n: 'ЧОУ Малкият принц', b: [43.17, 75.22, 66.14, 71.26], m: [38.59, 49.53, 48.57, 56.2]};
s[440] = {l: 'Мечтатели', n: 'ЧСУ Мечтатели', b: [30.88, 59.77, 60.69, 64.96], m: [25.12, 28.86, 55.25, 42.98]};
s[441] = {l: 'Монтесори', n: 'ЧСУ Монтесори', b: [null, null, 39.17, null], m: [null, null, 44.0, null]};

// Бургас - индексация
si['Бургас'] = {n: [501, 530], p: [531, 531]};
// Бургас - държавни училища
s[501] = {l: 'Коджакафалията', n: 'ОУ А. Георгиев - Коджакафалията', b: [null, null, 81.61, 80.52], m: [null, null, 74.03, 76.75]};
s[502] = {l: 'НУМСИ', n: 'НУМСИ Проф. Панчо Владигеров', b: [41.19, 70.16, 67.9, 69.01], m: [31.78, 37.59, 39.99, 49.3]};
s[503] = {l: 'ОУ Kняз Борис І', n: 'ОУ Св. Kняз Борис І', b: [36.9, 69.2, 59.68, 66.23], m: [35.06, 48.67, 45.47, 48.4]};
s[504] = {l: 'ОУ А. Страшимиров', n: 'ОУ Антон Страшимиров', b: [40.36, 69.62, 68.06, 70.03], m: [40.11, 45.73, 51.79, 58.08]};
s[505] = {l: 'ОУ Ботев - Ветрен', n: 'ОУ Христо Ботев - Ветрен', b: [30.07, 65.45, 57.7, 55.9], m: [32.86, 47.08, 39.5, 33.61]};
s[506] = {l: 'ОУ Ботев - Езерово', n: 'ОУ Христо Ботев - Д. Езерово', b: [28.74, 48.19, 40.05, 54.38], m: [20.83, 28.54, 20.25, 26.75]};
s[507] = {l: 'ОУ Ботев - Победа', n: 'ОУ Христо Ботев - Победа', b: [10.9, 7.63, 8.56, 9.22], m: [9.4, 11.2, 11.36, 11.05]};
s[508] = {l: 'ОУ Ботев - Сарафово', n: 'ОУ Христо Ботев - Сарафово', b: [32.31, 57.64, 50.87, 66.32], m: [38.29, 34.25, 30.39, 48.51]};
s[509] = {l: 'ОУ Бр. Миладинови', n: 'ОУ Братя Миладинови', b: [41.34, 67.97, 65.13, 71.17], m: [43.63, 53.14, 51.35, 54.11]};
s[510] = {l: 'ОУ Васил Априлов', n: 'ОУ Васил Априлов', b: [43.85, 68.98, 73.66, 72.85], m: [42.89, 54.69, 58.21, 60.1]};
s[511] = {l: 'ОУ Васил Левски', n: 'ОУ Васил Левски - Бургас', b: [14.32, 20.5, 17.1, 24.24], m: [22.17, 29.71, 20.18, 32.11]};
s[512] = {l: 'ОУ Г. Бенковски', n: 'ОУ Георги Бенковски', b: [37.26, 70.54, 64.0, 64.14], m: [37.71, 45.41, 45.19, 49.58]};
s[513] = {l: 'ОУ Елин Пелин', n: 'ОУ Елин Пелин', b: [38.24, 60.69, 63.62, 66.15], m: [37.6, 40.32, 47.43, 50.2]};
s[514] = {l: 'ОУ Иван Вазов', n: 'ОУ Иван Вазов', b: [33.68, 46.73, 52.87, 42.94], m: [39.21, 43.1, 40.13, 29.12]};
s[515] = {l: 'ОУ Л. Каравелов', n: 'ОУ Л. Каравелов', b: [39.81, 58.77, 65.39, 62.6], m: [34.28, 35.57, 41.0, 39.93]};
s[516] = {l: 'ОУ Найден Геров', n: 'ОУ Найден Геров', b: [35.89, 62.44, 52.61, 59.73], m: [33.18, 36.75, 35.55, 38.24]};
s[517] = {l: 'ОУ П. Славейков', n: 'ОУ П. Славейков', b: [43.26, 67.71, 68.78, 68.88], m: [46.97, 54.84, 53.71, 53.04]};
s[518] = {l: 'ОУ П. Яворов', n: 'ОУ П. К. Яворов', b: [41.64, 64.23, 67.07, 64.01], m: [41.36, 43.13, 43.39, 48.09]};
s[519] = {l: 'ОУ Св. Кл. Охридски', n: 'ОУ Св. Климент Охридски', b: [44.8, 69.37, 64.24, 70.51], m: [43.9, 41.37, 49.55, 52.43]};
s[520] = {l: 'ППМГ', n: 'ППМГ Акад. Никола Обрешков', b: [52.34, 84.15, 86.16, 90.42], m: [63.35, 91.13, 95.34, 92.92]};
s[521] = {l: 'Спортно у-ще Ю. Гагарин', n: 'Спортно у-ще Юрий Гагарин', b: [25.77, 40.29, 39.86, 42.71], m: [18.02, 20.94, 23.83, 21.21]};
s[522] = {l: 'СУ Димчо Дебелянов', n: 'СУ Димчо Дебелянов', b: [43.68, 70.81, 55.65, 67.1], m: [45.73, 53.47, 44.31, 50.75]};
s[523] = {l: 'СУ Добри Чинтулов', n: 'СУ Добри Чинтулов', b: [36.78, 60.33, 63.06, 52.29], m: [31.94, 36.54, 37.81, 28.77]};
s[524] = {l: 'СУ Еп. К. Преславски', n: 'СУ Еп. К. Преславски', b: [33.68, 50.77, 55.83, 59.17], m: [30.88, 32.42, 40.14, 38.84]};
s[525] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [27.73, 48.88, null, 52.5], m: [24.57, 30.26, null, 35.43]};
s[526] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [36.08, 57.45, 56.84, 58.28], m: [31.82, 28.06, 38.73, 37.26]};
s[527] = {l: 'СУ Конст. Петканов', n: 'СУ Константин Петканов', b: [28.61, 53.03, 53.69, 51.74], m: [21.08, 24.55, 30.08, 27.04]};
s[528] = {l: 'СУ Петко Росен', n: 'СУ Петко Росен', b: [36.91, 55.48, 51.55, 60.22], m: [33.22, 32.83, 35.96, 40.56]};
s[529] = {l: 'СУ Св. Св. Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [41.84, 61.41, 65.95, 66.71], m: [33.1, 43.68, 44.55, 46.31]};
s[530] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [15.53, 32.27, 33.28, 32.97], m: [12.89, 17.64, 18.65, 16.93]};
// Бургас - частни училища
s[531] = {l: 'ПЧОУ', n: 'Първо Частно Основно Училище', b: [49.2, 80.12, 79.54, 79.9], m: [54.73, 68.51, 78.07, 74.72]};

// Благоевград - индексация
si['Благоевград'] = {n: [601, 611], p: null};
// Благоевград - държавни училища
s[601] = {l: 'ОУ Д. Благоев', n: '2 ОУ Димитър Благоев', b: [null, 63.53, null, 64.42], m: [null, 37.69, null, 49.01]};
s[602] = {l: 'ОУ Д. Дебелянов', n: '4 ОУ Димчо Дебелянов', b: [33.65, 58.06, 50.2, 52.33], m: [31.98, 29.35, 31.96, 34.11]};
s[603] = {l: 'ОУ Д. Талев', n: '3 ОУ Димитър Талев', b: [41.61, 68.39, 69.23, 70.68], m: [39.55, 44.74, 44.94, 48.89]};
s[604] = {l: 'ОУ Пейо Яворов', n: '9 ОУ Пейо Яворов', b: [21.64, 13.29, 41.2, 26.94], m: [15.17, 11.63, 27.28, 20.75]};
s[605] = {l: 'ОУ Христо Ботев', n: '11 ОУ Христо Ботев', b: [30.77, 54.21, 54.98, 56.77], m: [23.64, 25.06, 29.95, 30.67]};
s[606] = {l: 'ПМГ Акад. С. Корольов', n: 'ПМГ Акад. Сергей Корольов', b: [50.33, 86.62, 85.46, 86.68], m: [60.07, 77.32, 89.66, 86.38]};
s[607] = {l: 'СУ А. Костенцев', n: '8 СУ Арсени Костенцев', b: [35.61, 59.62, 63.7, 63.34], m: [32.27, 36.9, 43.91, 48.48]};
s[608] = {l: 'СУ Г. Измирлиев', n: '5 СУ Георги Измирлиев', b: [36.33, 59.61, 55.11, 62.08], m: [36.85, 39.31, 38.02, 45.65]};
s[609] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [37.44, 63.3, 56.55, 51.54], m: [28.98, 38.24, 34.74, 30.23]};
s[610] = {l: 'СУ К. Шапкарев', n: '7 СУ Кузман Шапкарев', b: [37.37, 66.58, 66.96, 65.71], m: [34.88, 37.64, 48.76, 38.6]};
s[611] = {l: 'СУИЧЕ', n: 'СУИЧЕ Св. Кл. Охридски', b: [32.79, 55.04, 54.07, 58.73], m: [30.0, 37.51, 36.78, 41.18]};

// Велико Търново - индексация
si['Велико Търново'] = {n: [701, 709], p: null};
// Велико Търново - държавни училища
s[701] = {l: 'ОУ Бачо Киро', n: 'ОУ Бачо Киро', b: [39.6, 69.57, 66.94, 71.1], m: [41.63, 57.49, 50.81, 57.37]};
s[702] = {l: 'ОУ Д. Благоев', n: 'ОУ Димитър Благоев', b: [34.56, 58.28, 53.93, 60.26], m: [34.27, 34.63, 38.98, 39.1]};
s[703] = {l: 'ОУ П. Славейков', n: 'ОУ Петко. Р. Славейков', b: [30.41, 62.1, 55.83, 63.64], m: [19.65, 27.58, 32.98, 40.97]};
s[704] = {l: 'ОУ Св. П. Евтимий', n: 'ОУ Св. Патриарх Евтимий', b: [42.66, 68.21, 64.66, 72.19], m: [39.27, 41.57, 50.44, 57.78]};
s[705] = {l: 'ОУ Христо Ботев', n: 'ОУ Христо Ботев', b: [27.28, 35.36, 34.71, 30.15], m: [12.67, 12.56, 16.88, 13.83]};
s[706] = {l: 'Спортно у-ще', n: 'Спортно училище Героги Живков', b: [31.02, 38.6, 47.2, 51.58], m: [20.94, 24.16, 28.49, 23.73]};
s[707] = {l: 'СУ В. Благоева', n: 'СУ Вела Благоева', b: [41.15, 60.88, 58.4, 59.05], m: [30.63, 30.33, 32.41, 37.92]};
s[708] = {l: 'СУ В. Комаров', n: 'СУ Владимир Комаров', b: [28.44, 51.17, 34.94, 43.36], m: [22.33, 20.18, 15.84, 25.39]};
s[709] = {l: 'СУ Е. Станев', n: 'СУ Емилиян Станев', b: [39.1, 64.44, 68.12, 67.17], m: [35.86, 38.57, 44.02, 48.46]};

// Видин - индексация
si['Видин'] = {n: [801, 809], p: null};
// Видин - държавни училища
s[801] = {l: 'ОУ Иван Вазов', n: 'ОУ Иван Вазов', b: [44.88, 64.44, 58.95, 68.46], m: [31.65, 34.06, 40.86, 41.49]};
s[802] = {l: 'ОУ Л. Каравелов', n: 'ОУ Любен Каравелов', b: [28.74, 43.97, 48.41, 55.69], m: [23.99, 21.29, 27.46, 30.46]};
s[803] = {l: 'ОУ Отец Паисий', n: 'ОУ Отец Паисий', b: [29.66, 49.27, 43.91, 18.17], m: [29.0, 17.32, 20.86, 14.09]};
s[804] = {l: 'ОУ С. Врачански', n: 'ОУ Еп. Софроний Врачански', b: [19.13, 18.18, 14.87, 16.13], m: [19.2, 10.96, 26.88, 17.47]};
s[805] = {l: 'ОУ Св. Кл. Охридски', n: 'ОУ Св. Климент Охридски', b: [34.72, 38.21, 35.82, 48.7], m: [31.13, 8.14, 16.14, 30.35]};
s[806] = {l: 'ППМГ', n: 'ППМГ Екзарх Антим I', b: [45.97, 75.02, 74.56, 75.45], m: [49.97, 59.55, 67.91, 74.25]};
s[807] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [32.78, 52.55, 44.87, 46.93], m: [22.08, 22.31, 18.84, 20.72]};
s[808] = {l: 'СУ П. Славейков', n: 'СУ Петко Рачов Славейков', b: [28.17, 43.98, 40.57, 36.54], m: [28.22, 20.18, 22.26, 20.92]};
s[809] = {l: 'СУ Цар Симеон', n: 'СУ Цар Симеон Велики', b: [37.5, 66.32, 63.35, 60.09], m: [24.28, 27.55, 34.89, 35.93]};

// Враца - индексация
si['Враца'] = {n: [901, 911], p: null};
// Враца - държавни училища
s[901] = {l: 'ЕГ', n: 'Профилирана ЕГ Йоан Екзарх', b: [40.47, 68.75, null, null], m: [32.5, 34.02, null, null]};
s[902] = {l: 'ОУ Васил Левски', n: 'ОУ Васил Левски', b: [27.02, 46.81, 32.27, 46.88], m: [18.03, 21.33, 21.74, 27.5]};
s[903] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [21.79, 26.06, 37.91, 37.18], m: [15.84, 11.45, 18.14, 18.39]};
s[904] = {l: 'ППМГ', n: 'ППМГ Акад. Иван Ценов', b: [51.81, 86.84, 74.91, 78.7], m: [57.61, 73.61, 71.79, 77.49]};
s[905] = {l: 'Спортно у-ще', n: 'Спортно у-ще Св. Климент Охридски', b: [25.25, 38.98, 39.04, 42.88], m: [21.08, 27.04, 19.35, 19.97]};
s[906] = {l: 'СУ Васил Кънчов', n: 'СУ Васил Кънчов', b: [34.35, 65.08, 60.21, 60.38], m: [31.95, 32.62, 42.09, 32.01]};
s[907] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [null, null, 20.5, null], m: [null, null, 19.0, null]};
s[908] = {l: 'СУ Козма Тричков', n: 'СУ Козма Тричков', b: [33.71, 58.84, 61.55, 61.79], m: [29.96, 22.54, 32.77, 36.42]};
s[909] = {l: 'СУ Никола Войводов', n: 'СУ Никола Войводов', b: [34.15, 53.89, 51.16, 54.43], m: [24.34, 22.91, 26.17, 28.25]};
s[910] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [27.95, 45.61, 40.96, 32.32], m: [22.32, 14.73, 21.74, 22.31]};
s[911] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [35.12, 60.63, 60.05, 63.04], m: [28.41, 31.67, 37.61, 33.51]};

// Габрово - индексация
si['Габрово'] = {n: [1001, 1008], p: null};
// Габрово - държавни училища
s[1001] = {l: 'ОУ Иван Вазов', n: '6 ОУ Иван Вазов', b: [26.14, 43.25, 43.15, 52.91], m: [25.17, 20.96, 27.01, 27.95]};
s[1002] = {l: 'ОУ Кирил и Методий', n: 'ОУ Кирил и Методий', b: [34.64, 62.87, 60.5, 61.16], m: [37.16, 33.11, 37.52, 40.44]};
s[1003] = {l: 'ОУ Неофит Рилски', n: 'ОУ Неофит Рилски', b: [34.88, 57.25, 54.67, 57.64], m: [29.53, 34.11, 33.9, 37.27]};
s[1004] = {l: 'ОУ Ран Босилек', n: 'ОУ Ран Босилек', b: [37.35, 68.98, 66.8, 67.76], m: [37.45, 38.81, 42.64, 43.26]};
s[1005] = {l: 'ОУ Христо Ботев', n: 'ОУ Христо Ботев', b: [28.21, 44.84, 46.48, 50.51], m: [26.21, 15.86, 24.26, 29.22]};
s[1006] = {l: 'ПМГ', n: 'ПМГ Акад. Иван Гюзелев', b: [47.62, 76.64, 77.26, 78.59], m: [59.65, 71.08, 72.42, 81.02]};
s[1007] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [31.01, 44.07, 41.31, 48.67], m: [25.32, 22.26, 18.05, 27.21]};
s[1008] = {l: 'СУ Райчо Каролев', n: 'СУ Райчо Каролев', b: [39.73, 62.92, 60.07, 62.94], m: [34.39, 27.22, 35.07, 31.44]};

// Добрич - индексация
si['Добрич'] = {n: [1101, 1114], p: [1115, 1116]};
// Добрич - държавни училища
s[1101] = {l: 'ОУ Йордан Йовков', n: 'ОУ Йордан Йовков', b: [17.55, 25.97, 17.37, 16.6], m: [12.33, 15.42, 11.33, 14.65]};
s[1102] = {l: 'ОУ Н. Вапцаров', n: 'ОУ Никола Вапцаров', b: [23.57, 30.4, 20.08, 23.87], m: [12.23, 15.08, 15.85, 16.65]};
s[1103] = {l: 'ОУ Панайот Волов', n: 'ОУ Панайот Волов', b: [20.61, 29.1, 10.74, 23.43], m: [24.0, 26.72, 20.32, 26.07]};
s[1104] = {l: 'ОУ Стефан Караджа', n: 'ОУ Стефан Караджа', b: [33.4, 48.63, 36.19, 49.71], m: [27.96, 19.93, 24.0, 29.65]};
s[1105] = {l: 'ОУ Хан Аспарух', n: 'ОУ Хан Аспарух', b: [40.68, 68.5, 64.72, 65.77], m: [39.63, 34.51, 37.28, 52.27]};
s[1106] = {l: 'ОУ Хр. Смирненски', n: 'ОУ Христо Смирненски', b: [32.73, 42.86, 27.98, 34.69], m: [27.02, 20.11, 15.63, 19.58]};
s[1107] = {l: 'ОУ Христо Ботев', n: 'ОУ Христо Ботев', b: [35.4, 60.43, 58.69, 61.13], m: [40.04, 36.9, 44.89, 41.97]};
s[1108] = {l: 'ПМГ Иван Вазов', n: 'ПМГ Иван Вазов', b: [43.82, 75.63, 59.98, 65.65], m: [42.65, 49.68, 46.82, 45.84]};
s[1109] = {l: 'Спортно у-ще', n: 'Спортно у-ще Георги Раковски', b: [17.38, 29.05, 31.29, 29.0], m: [18.81, 18.51, 15.94, 16.9]};
s[1110] = {l: 'СУ Димитър Талев', n: 'СУ Димитър Талев', b: [35.05, 56.46, 54.26, 58.9], m: [24.66, 28.75, 30.27, 32.46]};
s[1111] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [35.69, 62.21, 59.51, 64.17], m: [31.08, 32.88, 36.83, 39.58]};
s[1112] = {l: 'СУ Любен Каравелов', n: 'СУ Любен Каравелов', b: [29.55, 63.74, 45.23, 49.67], m: [25.7, 28.96, 24.4, 25.2]};
s[1113] = {l: 'СУ Петко Славейков', n: 'СУ Петко Славейков', b: [41.84, 66.6, 73.13, 71.08], m: [39.92, 38.74, 54.76, 47.31]};
s[1114] = {l: 'СУ Св. Климент Охридски', n: 'СУ Св. Климент Охридски', b: [33.66, 56.1, 58.79, 61.03], m: [26.02, 26.6, 38.62, 34.47]};
// Добрич - частни училища
s[1115] = {l: 'Леонардо да Винчи', n: 'ЧСУ Леонардо да Винчи', b: [37.25, 62.05, 57.31, 59.71], m: [23.0, 29.73, 39.0, 50.5]};
s[1116] = {l: 'Мария Монтесори', n: 'ЧОУ Мария Монтесори', b: [null, 57.19, 66.75, 70.61], m: [null, 31.28, 43.94, 43.22]};

// Кърджали - индексация
si['Кърджали'] = {n: [1201, 1208], p: null};
// Кърджали - държавни училища
s[1201] = {l: 'ОУ Васил Левски', n: 'ОУ Васил Левски', b: [23.44, 52.33, 19.71, 16.75], m: [17.39, 29.71, 10.46, 17.36]};
s[1202] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [30.37, 42.8, 36.22, 45.34], m: [28.9, 25.14, 21.52, 30.0]};
s[1203] = {l: 'ОУ Пейо Яворов', n: 'ОУ Пейо К. Яворов', b: [29.44, 18.71, 16.26, 16.66], m: [35.58, 28.89, 18.12, 16.3]};
s[1204] = {l: 'ОУ Св. Кл. Охридски', n: 'ОУ Св. Климент Охридски', b: [31.98, 56.5, 51.09, 38.62], m: [40.42, 39.02, 50.09, 22.47]};
s[1205] = {l: 'СУ В. Димитров', n: 'СУ Владимир Димитров - Майстора', b: [30.22, 47.28, 33.55, 48.85], m: [28.82, 40.94, 26.52, 36.63]};
s[1206] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [26.41, 35.75, 33.29, 48.7], m: [24.75, 25.51, 23.86, 31.77]};
s[1207] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [37.11, 63.86, 55.8, 57.11], m: [39.77, 47.25, 40.1, 39.46]};
s[1208] = {l: 'СУ П. Славейков', n: 'СУ Петко Славейков', b: [38.27, 59.8, 48.92, 51.31], m: [50.49, 45.41, 36.43, 36.09]};

// Кюстендил - индексация
si['Кюстендил'] = {n: [1301, 1309], p: null};
// Кюстендил - държавни училища
s[1301] = {l: 'ОУ Даскал Димитри', n: 'ОУ Даскал Димитри', b: [33.84, 47.19, 49.61, null], m: [27.97, 19.77, 21.47, null]};
s[1302] = {l: 'ОУ Иван Вазов', n: 'ОУ Иван Вазов', b: [13.09, 15.6, 12.58, null], m: [10.6, 11.62, 13.64, null]};
s[1303] = {l: 'ОУ Ильо войвода', n: '7 ОУ Ильо войвода', b: [31.85, 62.45, 38.03, null], m: [25.71, 25.28, 23.83, null]};
s[1304] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [42.11, 58.33, 54.29, 58.24], m: [32.32, 29.44, 36.18, 34.5]};
s[1305] = {l: 'ОУ Марин Дринов', n: 'ОУ Проф. Марин Дринов', b: [30.75, 51.74, 49.73, 54.36], m: [23.58, 26.08, 27.84, 29.89]};
s[1306] = {l: 'ОУ П. Хилендарски', n: '6 ОУ Св. Паисий Хилендарски', b: [28.63, 49.37, 50.94, 33.04], m: [22.97, 21.38, 27.33, 19.95]};
s[1307] = {l: 'ОУ Христо Ботев', n: '5 ОУ Христо Ботев', b: [22.06, 25.23, 34.0, null], m: [19.6, 14.08, 28.71, null]};
s[1308] = {l: 'ПМГ', n: 'ПМГ Проф. Емануил Иванов', b: [43.54, 74.09, 71.84, 71.05], m: [45.43, 66.1, 58.02, 59.2]};
s[1309] = {l: 'Спортно у-ще', n: 'Спортно у-ще Васил Левски', b: [20.42, 26.83, 40.1, 38.31], m: [14.05, 13.67, 22.15, 17.57]};

// Ловеч - индексация
si['Ловеч'] = {n: [1401, 1408], p: null};
// Ловеч - държавни училища
s[1401] = {l: 'ОУ Васил Левски', n: 'ОУ Васил Левски', b: [42.43, 65.07, 66.04, 70.53], m: [41.33, 41.84, 44.17, 46.07]};
s[1402] = {l: 'ОУ Димитър Димов', n: 'ОУ Проф. Димитър Димов', b: [33.69, 55.48, 53.98, 56.98], m: [31.91, 28.69, 31.93, 31.23]};
s[1403] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [14.02, 18.47, 14.38, 17.79], m: [11.0, 15.24, 15.56, 12.34]};
s[1404] = {l: 'ОУ Панайот Пипков', n: 'ОУ Панайот Пипков', b: [13.77, 23.09, 10.5, 18.18], m: [14.43, 12.87, 10.82, 15.16]};
s[1405] = {l: 'ОУ Хр. Никифоров', n: 'ОУ Христо Никифоров', b: [36.28, 63.16, 56.44, 60.77], m: [35.15, 46.97, 35.62, 37.15]};
s[1406] = {l: 'ППМГ', n: 'ППМГ', b: [49.2, 85.71, 81.72, 85.74], m: [59.6, 78.04, 85.81, 81.53]};
s[1407] = {l: 'СУ Св. Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [34.83, 52.29, 43.13, null], m: [22.93, 23.45, 27.43, null]};
s[1408] = {l: 'СУ Тодор Кирков', n: 'СУ Тодор Кирков', b: [25.56, 40.36, 31.35, 44.56], m: [27.54, 17.87, 17.72, 21.19]};

// Монтана - индексация
si['Монтана'] = {n: [1501, 1508], p: null};
// Монтана - държавни училища
s[1501] = {l: '1 ОУ', n: 'І ОУ Св. Св. Кирил и Методий', b: [29.5, 54.96, 49.75, 53.35], m: [20.48, 24.39, 24.97, 27.25]};
s[1502] = {l: '2 СУ', n: '2 СУ Никола Вапцаров', b: [29.63, 46.36, 44.34, 44.76], m: [24.57, 31.95, 26.68, 23.68]};
s[1503] = {l: '3 ОУ', n: '3 ОУ Д-р Петър Берон', b: [35.94, 57.95, 51.56, 53.3], m: [28.65, 25.91, 33.52, 30.46]};
s[1504] = {l: '4 ОУ', n: '4 ОУ Иван Вазов', b: [34.44, 64.11, 63.31, 62.57], m: [25.67, 30.49, 36.5, 28.67]};
s[1505] = {l: '5 СУ', n: '5 СУ Христо Ботев', b: [30.57, 49.39, 33.74, 52.58], m: [20.46, 21.24, 22.55, 24.08]};
s[1506] = {l: '6 СУ', n: '6 СУ Отец Паисий', b: [23.37, 40.48, 33.87, 42.87], m: [19.62, 19.63, 23.22, 24.82]};
s[1507] = {l: '7 СУ', n: '7 СУ Йоран Радичков', b: [21.31, 42.24, 27.08, 44.27], m: [14.8, 13.74, 15.73, 19.73]};
s[1508] = {l: 'ППМГ', n: 'ППМГ Св. Климент Охридски', b: [44.67, 80.91, 76.12, 77.37], m: [50.66, 73.33, 67.91, 61.79]};

// Пазарджик - индексация
si['Пазарджик'] = {n: [1601, 1613], p: null};
// Пазарджик - държавни училища
s[1601] = {l: 'ОУ Ив. Батаклиев', n: 'ОУ Проф. Ив. Батаклиев', b: [40.44, 74.9, 69.16, 68.66], m: [41.03, 44.6, 49.19, 50.49]};
s[1602] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [7.5, 10.06, 7.07, 7.77], m: [10.22, 8.82, 13.43, 9.62]};
s[1603] = {l: 'ОУ Любен Каравелов', n: 'ОУ Любен Каравелов', b: [30.52, 59.26, 49.79, 64.77], m: [29.47, 32.05, 30.4, 42.76]};
s[1604] = {l: 'ОУ Св. Кл. Охридски', n: 'ОУ Св. Климент Охридски', b: [33.02, 62.65, 62.31, 64.67], m: [30.98, 35.68, 43.55, 39.48]};
s[1605] = {l: 'ОУ Стефан Захариев', n: 'ОУ Стефан Захариев', b: [24.29, 39.0, 20.86, 34.39], m: [10.29, 19.38, 16.56, 14.32]};
s[1606] = {l: 'ОУ Хр. Смирненски', n: 'ОУ Хр. Смирненски', b: [41.32, 70.8, 56.68, 58.15], m: [36.88, 40.21, 36.3, 34.76]};
s[1607] = {l: 'ОУ Христо Ботев', n: 'ОУ Христо Ботев', b: [16.48, 35.22, 17.4, 29.14], m: [13.91, 22.69, 12.34, 17.2]};
s[1608] = {l: 'ПМГ', n: 'ПМГ Константин Величков', b: [49.26, 76.09, 73.03, 73.05], m: [57.12, 72.17, 69.49, 76.53]};
s[1609] = {l: 'СУ Г. Бенковски', n: 'СУ Георги Бенковски', b: [34.74, 59.32, 58.35, 62.38], m: [28.46, 32.68, 34.74, 33.86]};
s[1610] = {l: 'СУ Г. Брегов', n: 'СУ Георги Брегов', b: [35.64, 60.2, 56.5, 60.14], m: [25.03, 35.73, 30.35, 33.24]};
s[1611] = {l: 'СУ Д-р П. Берон', n: 'СУ Д-р Петър Берон', b: [33.9, 53.14, 50.72, 62.26], m: [21.95, 25.9, 29.66, 34.07]};
s[1612] = {l: 'СУ Димитър Гачев', n: 'СУ Димитър Гачев', b: [10.77, 20.09, 14.68, 17.43], m: [16.04, 25.27, 30.68, 25.35]};
s[1613] = {l: 'СУ Пазарджик', n: 'СУ Пазарджик', b: [26.93, 46.72, 42.25, 44.46], m: [29.71, 15.45, 22.48, 22.2]};

// Перник - индексация
si['Перник'] = {n: [1701, 1715], p: null};
// Перник - държавни училища
s[1701] = {l: '5 СУ', n: '5 СУ Петко Славейков', b: [24.73, 38.24, 33.21, 39.8], m: [19.47, 17.11, 15.09, 15.83]};
s[1702] = {l: '6 СУ', n: '6 СУ Св. Св. Кирил и Методий', b: [24.37, 48.06, 45.87, 47.21], m: [16.29, 21.56, 25.85, 26.72]};
s[1703] = {l: '7 ОУ', n: '7 ОУ Георги С. Раковски', b: [29.7, 46.77, 38.91, 49.46], m: [22.86, 23.99, 21.0, 32.91]};
s[1704] = {l: '8 ОУ', n: '8 ОУ Кракра Пернишки', b: [36.5, 53.11, null, 52.68], m: [22.36, 27.03, null, 21.04]};
s[1705] = {l: '10 ОУ', n: '10 ОУ Ал. Константинов', b: [35.09, 60.98, 56.36, 61.73], m: [31.08, 33.29, 35.85, 36.72]};
s[1706] = {l: '11 ОУ', n: '11 ОУ Елин Пелин', b: [35.67, 63.14, 56.15, 61.71], m: [33.99, 32.86, 30.82, 36.19]};
s[1707] = {l: '12 ОУ', n: '12 ОУ Васил Левски', b: [34.04, 56.61, 51.91, 47.13], m: [33.3, 27.83, 30.06, 25.29]};
s[1708] = {l: '13 ОУ', n: '13 ОУ Св. Св. Кирил и Методий', b: [30.29, 56.61, 46.98, 47.5], m: [23.1, 32.27, 24.65, 23.11]};
s[1709] = {l: '16 ОУ', n: '16 ОУ Св. Св. Кирил и Методий', b: [33.68, 60.52, 61.35, 57.57], m: [27.97, 24.16, 25.36, 27.21]};
s[1710] = {l: 'ОУ К. К. Философ', n: 'ОУ Св. Конст. К. Философ', b: [31.82, 55.99, 44.52, 58.09], m: [15.45, 21.34, 19.66, 24.27]};
s[1711] = {l: 'ОУ Св. Ив. Рилски', n: 'ОУ Св. Ив. Рилски', b: [40.53, 72.36, 62.2, 67.39], m: [36.12, 35.97, 36.61, 41.9]};
s[1712] = {l: 'ПМГ', n: 'ПМГ Хрристо Смирненски', b: [null, 84.97, 75.03, 80.85], m: [null, 87.89, 71.19, 81.79]};
s[1713] = {l: 'Спортно у-ще', n: 'Спортно у-ще Олимпиец', b: [20.74, 36.18, 29.34, 32.97], m: [13.29, 12.91, 14.86, 20.44]};
s[1714] = {l: 'СУ Темелко Ненков', n: 'СУ Темелко Ненков', b: [12.14, 25.5, 25.61, 24.07], m: [10.81, 11.94, 17.39, 12.02]};
s[1715] = {l: 'СУРИЧЕ', n: 'СУРИЧЕ Д-р Петър Берон', b: [39.19, 67.06, 63.02, 67.65], m: [33.05, 32.47, 30.87, 36.19]};

// Плевен - индексация
si['Плевен'] = {n: [1801, 1816], p: null};
// Плевен - държавни училища
s[1801] = {l: 'МГ Гео Милев', n: 'МГ Гео Милев', b: [50.41, 79.76, 75.55, 79.71], m: [60.78, 73.61, 73.48, 79.78]};
s[1802] = {l: 'НУИ', n: 'НУИ Панайот Пипков', b: [38.65, 56.3, 60.04, 57.61], m: [26.44, 29.45, 25.45, 31.39]};
s[1803] = {l: 'ОУ Валери Петров', n: 'ОУ Валери Петров', b: [43.66, 75.83, 74.1, 71.69], m: [38.36, 39.53, 42.49, 46.34]};
s[1804] = {l: 'ОУ Васил Левски', n: 'ОУ Васил Левски', b: [28.38, null, 45.17, 44.58], m: [20.08, null, 23.41, 21.74]};
s[1805] = {l: 'ОУ Йордан Йовков', n: 'ОУ Йордан Йовков', b: [31.89, 51.42, 55.01, 57.45], m: [27.77, 22.09, 27.58, 26.57]};
s[1806] = {l: 'ОУ Кл. Охридски', n: 'ОУ Св. Климент Охридски', b: [27.28, 52.7, 47.5, 56.37], m: [19.42, 18.74, 22.74, 28.36]};
s[1807] = {l: 'ОУ Лазар Станев', n: 'ОУ Лазар Станев', b: [32.5, 52.13, 42.82, 55.6], m: [35.94, 23.99, 25.29, 35.18]};
s[1808] = {l: 'ОУ Н. Вапцаров', n: 'ОУ Никола Вапцаров', b: [20.44, 24.33, 6.55, null], m: [31.5, 18.83, 13.44, null]};
s[1809] = {l: 'ОУ Петър Берон', n: 'ОУ Д-р Петър Берон', b: [35.76, 59.82, 52.92, 58.53], m: [24.42, 24.81, 29.01, 34.35]};
s[1810] = {l: 'ОУ Цветан Спасов', n: 'ОУ Цветан Спасов', b: [36.15, 66.76, 60.98, 64.21], m: [33.42, 36.07, 33.58, 43.41]};
s[1811] = {l: 'Спортно у-ще', n: 'Спортно у-ще Георги Бенковски', b: [26.24, 33.73, 29.95, 40.82], m: [23.55, 12.84, 14.97, 16.43]};
s[1812] = {l: 'СУ А. Димитрова', n: 'СУ Анастасия Димитрова', b: [18.37, 36.05, 33.97, 22.88], m: [17.32, 11.59, 20.2, 16.44]};
s[1813] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [40.43, 72.19, 66.1, 69.28], m: [40.4, 38.36, 44.82, 50.64]};
s[1814] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Яворов', b: [28.29, 45.83, 48.32, 55.79], m: [16.95, 19.37, 22.17, 25.46]};
s[1815] = {l: 'СУ Стоян Заимов', n: 'СУ Стоян Заимов', b: [35.65, 63.35, 56.76, 63.29], m: [24.66, 26.61, 27.16, 34.57]};
s[1816] = {l: 'СУ Х. Смирненски', n: 'Средно училище Христо Смирненски', b: [20.91, 37.88, 35.92, 19.39], m: [18.27, 11.4, 16.08, 11.93]};

// Разград - индексация
si['Разград'] = {n: [1901, 1907], p: null};
// Разград - държавни училища
s[1901] = {l: 'ОУ Васил Левски', n: 'ОУ Васил Левски', b: [40.59, 68.19, 60.22, 66.16], m: [37.39, 46.55, 32.87, 38.78]};
s[1902] = {l: 'ОУ И. С. Тургенев', n: 'ОУ И. С. Тургенев', b: [24.14, 57.25, 36.83, 44.65], m: [21.41, 25.33, 23.31, 22.94]};
s[1903] = {l: 'ОУ Н. Вапцаров', n: 'ОУ Никола Вапцаров', b: [39.18, 64.4, 58.43, 58.75], m: [34.92, 32.68, 39.33, 32.38]};
s[1904] = {l: 'ОУ Н. Икономов', n: 'ОУ Н. Икономов', b: [33.03, 59.34, 52.68, 55.35], m: [28.55, 36.42, 30.31, 30.75]};
s[1905] = {l: 'ОУ Отец Паисий', n: 'ОУ Отец Паисий', b: [20.87, 36.06, 33.48, 33.72], m: [14.43, 18.13, 21.06, 20.69]};
s[1906] = {l: 'ППМГ', n: 'ППМГ Акад. Никола Обрешков', b: [null, null, 81.31, 80.52], m: [null, null, 72.58, 67.64]};
s[1907] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [31.97, 53.01, 50.05, 50.68], m: [30.24, 26.13, 32.81, 27.77]};

// Русе - индексация
si['Русе'] = {n: [2001, 2020], p: [2021, 2021]};
// Русе - държавни училища
s[2001] = {l: 'МГ Баба Тонка', n: 'МГ Баба Тонка', b: [49.39, 85.38, 85.15, 87.81], m: [61.33, 93.08, 90.11, 93.47]};
s[2002] = {l: 'НУИ', n: 'НУИ Проф. Веселин Стоянов', b: [30.8, 60.8, 58.68, 60.51], m: [22.62, 28.22, 27.9, 33.31]};
s[2003] = {l: 'ОУ А. Константинов', n: 'ОУ Алеко Константинов', b: [13.85, 20.67, 25.36, 28.28], m: [19.08, 12.17, 30.13, 21.92]};
s[2004] = {l: 'ОУ Ангел Кънчев', n: 'ОУ Ангел Кънчев', b: [30.47, 41.52, 36.03, 52.77], m: [35.69, 32.33, 21.07, 29.74]};
s[2005] = {l: 'ОУ Братя Миладинови', n: 'ОУ Братя Миладинови', b: [24.17, 47.96, 27.0, 51.55], m: [18.33, 25.68, 14.47, 32.95]};
s[2006] = {l: 'ОУ Васил Априлов', n: 'ОУ Васил Априлов', b: [25.67, 40.78, 42.18, 52.17], m: [18.02, 18.54, 28.54, 32.1]};
s[2007] = {l: 'ОУ Иван Вазов', n: 'ОУ Иван Вазов', b: [40.44, 63.25, 65.68, 67.16], m: [47.69, 51.27, 50.27, 55.56]};
s[2008] = {l: 'ОУ Л. Каравелов', n: 'ОУ Любен Каравелов', b: [45.11, 72.08, 70.99, 72.46], m: [52.08, 59.24, 56.77, 60.25]};
s[2009] = {l: 'ОУ Никола Обретенов', n: 'ОУ Никола Обретенов', b: [31.69, 43.22, 40.51, 47.63], m: [21.34, 16.83, 17.44, 21.06]};
s[2010] = {l: 'ОУ Олимпи Панов', n: 'ОУ Олимпи Панов', b: [35.19, 48.91, 44.38, 43.92], m: [30.23, 30.3, 22.15, 21.77]};
s[2011] = {l: 'ОУ Отец Паисий', n: 'ОУ Отец Паисий', b: [39.3, 63.89, 64.57, 65.81], m: [38.23, 37.99, 44.57, 51.16]};
s[2012] = {l: 'ОУ Тома Кърджиев', n: 'ОУ Тома Кърджиев', b: [31.99, 55.58, 44.48, 48.66], m: [27.0, 36.35, 29.76, 25.73]};
s[2013] = {l: 'ОУ Хр. Смирненски', n: 'ОУ Христо Смирненски', b: [25.75, 20.75, 28.04, 45.86], m: [19.5, 18.79, 20.31, 34.21]};
s[2014] = {l: 'Спортно у-ще', n: 'Спортно у-ще', b: [15.77, 22.78, 17.42, 27.04], m: [15.03, 13.3, 14.51, 15.82]};
s[2015] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [36.44, 51.95, 52.75, 59.31], m: [30.93, 28.05, 31.76, 35.97]};
s[2016] = {l: 'СУ Възраждане', n: 'СУ Възраждане', b: [35.63, 61.53, 56.72, 58.72], m: [31.08, 44.23, 39.53, 40.62]};
s[2017] = {l: 'СУ за европ. езици', n: 'СУ за европейски езици', b: [42.0, 70.33, 70.58, 73.99], m: [40.06, 52.08, 48.33, 55.45]};
s[2018] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [27.48, 53.03, 47.92, 46.45], m: [19.73, 24.37, 27.37, 27.63]};
s[2019] = {l: 'СУ Фридрих Шилер', n: 'СУ с немски език Фридрих Шилер', b: [40.09, 63.73, 65.04, 71.33], m: [38.19, 48.14, 43.26, 44.87]};
s[2020] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [38.8, 65.97, 62.29, 65.75], m: [39.43, 48.86, 47.47, 50.83]};
// Русе - частни училища
s[2021] = {l: 'Леонардо да Винчи', n: 'Първо ЧСУ Леонардо да Винчи', b: [31.73, 67.32, 60.22, 61.45], m: [26.33, 45.74, 37.34, 54.82]};

// Силистра - индексация
si['Силистра'] = {n: [2101, 2106], p: null};
// Силистра - държавни училища
s[2101] = {l: 'ОУ Иван Вазов', n: 'ОУ Иван Вазов', b: [40.99, 70.26, 62.12, 65.88], m: [40.06, 35.18, 33.88, 46.04]};
s[2102] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [35.95, 59.37, 51.29, 54.07], m: [30.93, 32.44, 27.02, 33.66]};
s[2103] = {l: 'ОУ Отец Паисий', n: 'ОУ Отец Паисий', b: [40.82, 71.69, 63.33, 64.99], m: [34.99, 36.63, 36.03, 36.14]};
s[2104] = {l: 'ПМГ', n: 'ПМГ Св. Климент Охридски', b: [42.04, 74.48, 68.1, 74.45], m: [43.89, 53.3, 54.96, 63.47]};
s[2105] = {l: 'Спортно у-ще', n: 'Спортно у-ще Дръстър', b: [21.05, 25.59, 34.8, 28.69], m: [16.59, 14.31, 18.96, 17.66]};
s[2106] = {l: 'СУ Н. Вапцаров', n: 'СУ Никола Вапцаров', b: [30.38, 63.08, 55.15, 55.32], m: [22.92, 28.15, 26.33, 26.88]};

// Сливен - индексация
si['Сливен'] = {n: [2201, 2214], p: null};
// Сливен - държавни училища
s[2201] = {l: 'ОУ Бр. Миладинови', n: 'ОУ Братя Миладинови', b: [10.85, 10.48, 11.07, 11.04], m: [10.98, 12.46, 13.16, 11.78]};
s[2202] = {l: 'ОУ Д. Петров', n: 'ОУ Д. Петров', b: [34.64, 55.49, 52.7, 59.04], m: [29.77, 26.94, 29.46, 34.0]};
s[2203] = {l: 'ОУ Ел. Багряна', n: 'ОУ Елисавета Багряна', b: [34.31, 61.08, 56.54, 61.33], m: [31.22, 24.71, 32.94, 37.86]};
s[2204] = {l: 'ОУ Ив. Селимински', n: 'ОУ Д-р Ив. Селимински', b: [39.94, 73.6, 70.01, 68.61], m: [37.0, 41.81, 47.62, 47.32]};
s[2205] = {l: 'ОУ Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [28.08, 52.19, 49.94, 46.5], m: [24.6, 28.88, 36.19, 35.02]};
s[2206] = {l: 'ОУ П. Хитов', n: 'ОУ Панайот Хитов', b: [33.66, 62.25, 39.08, 58.76], m: [37.05, 37.35, 22.76, 35.67]};
s[2207] = {l: 'ОУ Христо Ботев', n: 'ОУ Христо Ботев', b: [34.09, 55.56, 61.88, 61.85], m: [26.87, 30.4, 43.58, 36.11]};
s[2208] = {l: 'ОУ Юрий Гагарин', n: 'ОУ Юрий Гагарин', b: [14.3, 13.5, 14.17, 12.42], m: [9.92, 12.06, 13.64, 11.67]};
s[2209] = {l: 'ППМГ', n: 'ППМГ Добри Чинтулов', b: [50.65, 84.44, 82.14, 84.05], m: [51.09, 66.93, 71.02, 77.85]};
s[2210] = {l: 'Спортно у-ще', n: 'Спортно у-ще Димитър Рохов', b: [26.58, 36.48, 36.18, 36.89], m: [18.27, 15.77, 17.74, 20.39]};
s[2211] = {l: 'СУ Йордан Йовков', n: 'СУ Йордан Йовков', b: [35.61, 51.68, 56.72, 50.68], m: [27.87, 21.87, 31.55, 31.9]};
s[2212] = {l: 'СУ К. Константинов', n: 'СУ Константин Константинов', b: [32.76, 55.55, 54.29, 53.53], m: [27.18, 31.56, 33.57, 28.83]};
s[2213] = {l: 'СУ Пейо Яворов', n: 'СУ Пейо Яворов', b: [30.55, 55.49, 50.78, 57.94], m: [23.91, 27.98, 27.26, 34.72]};
s[2214] = {l: 'СУ Х. Мина Пашов', n: 'СУ Хаджи Мина Пашов', b: [18.2, 38.44, 15.72, 24.7], m: [12.5, 15.17, 11.86, 14.86]};

// Смолян - индексация
si['Смолян'] = {n: [2301, 2307], p: null};
// Смолян - държавни училища
s[2301] = {l: 'ОУ Асен Златаров', n: 'ОУ Проф. д-р Асен Златаров', b: [42.0, 64.94, 56.19, 65.16], m: [31.89, 38.11, 34.31, 43.06]};
s[2302] = {l: 'ОУ Иван Вазов', n: 'ОУ Иван Вазов', b: [40.37, 67.62, 65.62, 68.03], m: [38.11, 47.31, 42.78, 43.9]};
s[2303] = {l: 'ОУ Стою Шишков', n: 'ОУ Стою Шишков', b: [34.9, 57.25, 54.37, 57.4], m: [31.76, 26.38, 29.17, 27.29]};
s[2304] = {l: 'ОУ Юрий Гагарин', n: 'ОУ Юрий Гагарин', b: [33.83, 58.25, 48.97, 54.81], m: [34.83, 29.68, 25.93, 29.79]};
s[2305] = {l: 'ППМГ', n: 'ППМГ Васил Левски', b: [null, null, 67.81, 75.89], m: [null, null, 64.56, 76.38]};
s[2306] = {l: 'СУ Кирил и Методий', n: 'СУ Св. Св. Кирил и Методий', b: [37.97, 55.2, 54.71, 53.5], m: [36.31, 29.6, 35.76, 38.26]};
s[2307] = {l: 'СУ Отец Паисий', n: 'СУ Отец Паисий', b: [35.86, 62.42, 60.41, 70.45], m: [29.63, 28.17, 41.03, 45.73]};

// Стара Загора - индексация
si['Стара Загора'] = {n: [2401, 2422], p: [2423, 2423]};
// Стара Загора - държавни училища
s[2401] = {l: 'НУМСИ', n: 'НУМСИ Христина Морфова', b: [37.97, 64.18, 54.03, 54.97], m: [24.4, 22.64, 29.4, 26.86]};
s[2402] = {l: 'ОУ В. Ханчев', n: '9 ОУ В. Ханчев', b: [39.76, 57.03, 57.54, 59.98], m: [34.39, 29.06, 34.0, 38.1]};
s[2403] = {l: 'ОУ Георги Бакалов', n: 'ОУ Георги Бакалов', b: [14.4, 21.5, 14.97, null], m: [11.2, 11.32, 13.17, null]};
s[2404] = {l: 'ОУ Георги Райчев', n: 'ОУ Георги Райчев', b: [25.41, 35.61, 42.34, 33.38], m: [22.52, 19.69, 19.81, 13.72]};
s[2405] = {l: 'ОУ Кирил Христов', n: 'ОУ Кирил Христов', b: [40.88, 69.75, 64.65, 64.83], m: [37.49, 47.5, 46.71, 48.43]};
s[2406] = {l: 'ОУ М. Станев', n: '5 ОУ М. Станев', b: [41.29, 70.42, 67.85, 68.83], m: [37.62, 45.23, 49.56, 44.75]};
s[2407] = {l: 'ОУ Николай Лилиев', n: '11 ОУ Николай Лилиев', b: [22.5, 44.26, 41.83, 48.3], m: [18.89, 19.83, 23.45, 25.65]};
s[2408] = {l: 'ОУ П. Славейков', n: '2 ОУ П. Р. Славейков', b: [45.17, 79.73, 71.69, 74.72], m: [41.32, 51.64, 55.15, 60.88]};
s[2409] = {l: 'ОУ П. Хилендарски', n: '13 ОУ Св. П. Хилендарски', b: [38.78, 53.35, 42.39, 51.44], m: [29.62, 20.99, 20.39, 26.38]};
s[2410] = {l: 'ОУ Самара', n: 'ОУ Самара', b: [21.67, 38.24, 40.09, 44.53], m: [15.96, 15.5, 26.35, 28.68]};
s[2411] = {l: 'ОУ Св. Никола', n: '6 ОУ Св. Никола', b: [44.21, 74.82, 69.83, 70.29], m: [40.46, 43.93, 55.63, 51.61]};
s[2412] = {l: 'ОУ Стефан Караджа', n: '12 ОУ Стефан Караджа', b: [7.58, 7.26, 7.19, 11.17], m: [11.1, 9.98, 11.41, 10.56]};
s[2413] = {l: 'ППМГ Гео Милев', n: 'ППМГ Гео Милев', b: [52.34, 89.45, 81.6, 85.08], m: [58.7, 79.62, 81.82, 85.59]};
s[2414] = {l: 'СЗ: І ОУ Георги Бакалов', n: 'І ОУ Георги Бакалов', b: [null, null, null, 15.0], m: [null, null, null, 14.0]};
s[2415] = {l: 'Спортно у-ще', n: 'Спортно у-ще Тодор Каблешков', b: [23.33, 36.53, 33.91, 37.62], m: [17.85, 18.1, 20.4, 21.99]};
s[2416] = {l: 'СтараЗагора: СУ Васил Левски', n: 'СУ Васил Левски', b: [null, null, null, 93.0], m: [null, null, null, 93.0]};
s[2417] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [37.1, 71.87, 59.45, null], m: [29.6, 41.39, 39.13, null]};
s[2418] = {l: 'СУ Железник', n: 'СУ Железник', b: [37.8, 56.87, 56.64, 61.16], m: [29.14, 24.87, 37.84, 32.88]};
s[2419] = {l: 'СУ Иван Вазов', n: 'СУ Иван Вазов', b: [35.05, 59.79, 55.57, 56.99], m: [30.0, 29.73, 34.95, 34.64]};
s[2420] = {l: 'СУ Максим Горки', n: 'СУ Максим Горки', b: [46.83, 77.57, 66.37, 70.26], m: [44.69, 51.14, 42.49, 47.74]};
s[2421] = {l: 'СУ Хр. Смирненски', n: 'СУ Христо Смирненски', b: [10.48, 15.29, 13.4, 17.29], m: [10.44, 12.25, 14.03, 13.25]};
s[2422] = {l: 'СУ Христо Ботев', n: 'СУ Христо Ботев', b: [16.0, null, 19.67, 15.9], m: [10.79, null, 13.16, 14.42]};
// Стара Загора - частни училища
s[2423] = {l: 'Елин Пелин', n: 'ЧОУ Елин Пелин', b: [40.03, 76.98, 66.08, 68.47], m: [40.82, 59.07, 44.63, 61.04]};

// Търговище - индексация
si['Търговище'] = {n: [2501, 2508], p: null};
// Търговище - държавни училища
s[2501] = {l: '1 ОУ', n: '1 ОУ Христо Ботев', b: [37.14, 58.02, 56.48, 59.25], m: [40.61, 33.38, 39.09, 39.14]};
s[2502] = {l: '1 СУ', n: '1 СУ Свети Седмочисленици', b: [41.11, 67.05, 59.69, 62.26], m: [38.66, 39.26, 36.9, 52.55]};
s[2503] = {l: '2 ОУ', n: '2 ОУ Н. Вапцаров', b: [15.0, 7.33, 7.0, 11.88], m: [34.31, 16.75, 7.33, 13.0]};
s[2504] = {l: '2 СУ', n: '2 СУ Проф. Никола Маринов', b: [34.29, 60.72, 53.66, 58.26], m: [46.0, 33.66, 39.29, 35.82]};
s[2505] = {l: '3 ОУ', n: '3 ОУ П. Р. Славейков', b: [15.79, 23.25, 35.48, 36.2], m: [22.35, 32.86, 30.05, 22.96]};
s[2506] = {l: '4 ОУ', n: '4 ОУ Иван Вазов', b: [34.64, 48.97, 35.31, 36.59], m: [46.36, 32.36, 37.49, 45.16]};
s[2507] = {l: 'Спортно у-ще', n: 'Спортно училище Никола Симов', b: [32.11, 44.81, 21.25, 29.62], m: [34.0, 21.64, 34.9, 29.54]};
s[2508] = {l: 'У-ще за уч. с увр. слух', n: 'Специално у-ще за ученици с увреден слух', b: [null, 23.67, 7.0, 26.86], m: [null, 25.75, 26.0, 33.75]};

// Хасково - индексация
si['Хасково'] = {n: [2601, 2611], p: null};
// Хасково - държавни училища
s[2601] = {l: 'ОУ  Кирил и Методий', n: 'ОУ Св. Св. Кирил и Методий', b: [31.08, 44.88, 40.71, 46.65], m: [30.05, 24.58, 26.27, 26.63]};
s[2602] = {l: 'ОУ Иван Рилски', n: 'ОУ Св. Иван Рилски', b: [37.61, 63.98, 63.57, 66.07], m: [34.05, 34.29, 45.54, 47.25]};
s[2603] = {l: 'ОУ Кл. Охридски', n: 'ОУ Св. Климент Охридски', b: [43.08, 64.74, 72.59, 68.98], m: [41.21, 41.34, 57.6, 46.52]};
s[2604] = {l: 'ОУ Л. Каравелов', n: 'ОУ Любен Каравелов', b: [37.09, 60.53, 58.99, 60.84], m: [37.0, 37.32, 36.47, 41.07]};
s[2605] = {l: 'ОУ Н. Вапцаров', n: 'ОУ Н. Й. Вапцаров', b: [15.68, 12.12, 17.65, 16.82], m: [19.93, 18.69, 21.82, 21.55]};
s[2606] = {l: 'ОУ Хр. Смирненски', n: 'ОУ Христо Смирненски', b: [37.27, 59.33, 60.88, 58.46], m: [31.45, 31.92, 40.53, 41.09]};
s[2607] = {l: 'ОУ Шандор Петьофи', n: 'ОУ Шандор Петьофи', b: [35.73, 40.46, 46.15, 39.52], m: [22.49, 18.47, 24.63, 25.71]};
s[2608] = {l: 'ПМГ', n: 'ПМГ Акад. Боян Петканчин', b: [48.61, 84.16, 81.86, 81.44], m: [58.0, 84.69, 80.71, 79.84]};
s[2609] = {l: 'Спортно у-ще', n: 'Спортно у-ще Стефан Караджа', b: [10.94, 17.44, 15.36, 16.28], m: [15.21, 10.3, 13.5, 15.11]};
s[2610] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [30.57, 56.06, 48.33, 54.76], m: [29.23, 31.4, 29.81, 36.46]};
s[2611] = {l: 'СУ П. Хилендарски', n: 'СУ Св. Паисий Хилендарски', b: [30.76, 56.43, 52.9, 53.2], m: [25.85, 28.17, 30.02, 31.23]};

// Шумен - индексация
si['Шумен'] = {n: [2701, 2710], p: null};
// Шумен - държавни училища
s[2701] = {l: 'ОУ Д. Благоев', n: 'ОУ Димитър Благоев', b: [39.8, 53.98, 58.14, 56.97], m: [30.43, 22.98, 32.19, 34.73]};
s[2702] = {l: 'ОУ Е. Марковски', n: 'ОУ Еньо Марковски', b: [13.64, 17.5, 24.89, 27.56], m: [11.63, 12.89, 13.06, 13.42]};
s[2703] = {l: 'ОУ П. Волов', n: 'ОУ Панайот Волов', b: [25.97, 49.39, 42.68, 42.43], m: [23.43, 25.77, 24.18, 27.52]};
s[2704] = {l: 'ОУ Петър Берон', n: 'ОУ Д-р Петър Берон', b: [33.38, 53.98, 52.02, 57.83], m: [25.15, 30.13, 33.82, 33.1]};
s[2705] = {l: 'ППМГ', n: 'ППМГ Нанчо Попович', b: [52.49, 80.5, 81.07, 85.37], m: [56.11, 66.39, 75.82, 73.27]};
s[2706] = {l: 'СУ Васил Левски', n: 'СУ Васил Левски', b: [33.64, 47.17, 45.75, 38.63], m: [25.54, 25.55, 26.62, 24.39]};
s[2707] = {l: 'СУ Йоан Екзарх', n: 'СУ Йоан Екзарх Български', b: [36.36, 54.13, 56.66, 56.19], m: [30.69, 23.07, 33.71, 32.82]};
s[2708] = {l: 'СУ Панайот Волов', n: 'СУ Панайот Волов', b: [28.79, 47.49, 52.36, 54.1], m: [27.02, 19.48, 28.45, 30.97]};
s[2709] = {l: 'СУ С. Доброплодни', n: 'СУ Сава Доброплодни', b: [39.91, 68.46, 63.77, 66.21], m: [32.38, 33.8, 39.59, 43.21]};
s[2710] = {l: 'СУ Трайко Симеонов', n: 'СУ Трайко Симеонов', b: [20.9, 34.11, 13.5, 16.35], m: [22.42, 28.63, 11.65, 15.44]};

// Ямбол - индексация
si['Ямбол'] = {n: [2801, 2810], p: null};
// Ямбол - държавни училища
s[2801] = {l: 'ОУ Д-р Петър Берон', n: 'ОУ Д-р Петър Берон', b: [20.1, 16.94, 23.26, 31.3], m: [26.56, 23.71, 34.66, 33.28]};
s[2802] = {l: 'ОУ Йордан Йовков', n: 'ОУ Йордан Йовков', b: [16.9, 15.83, 24.47, 19.71], m: [27.61, 31.76, 21.18, 27.96]};
s[2803] = {l: 'ОУ Л. Каравелов', n: 'ОУ Любен Каравелов', b: [37.97, 61.84, 59.85, 62.09], m: [38.45, 37.15, 33.05, 39.28]};
s[2804] = {l: 'ОУ Н. Петрини', n: 'ОУ Николай Петрини', b: [35.86, 54.93, 48.1, 59.27], m: [29.93, 28.6, 27.93, 29.27]};
s[2805] = {l: 'ОУ П. Славейков', n: 'ОУ П. Р. Славейков', b: [30.1, 51.89, 50.95, 60.71], m: [22.69, 22.6, 31.41, 34.61]};
s[2806] = {l: 'ОУ Хр. Смирненски', n: 'ОУ Христо Смирненски', b: [null, 27.29, 16.28, 23.58], m: [null, 29.48, 20.98, 15.5]};
s[2807] = {l: 'ПГ Васил Левски', n: 'ПГ Васил Левски', b: [41.31, 70.5, null, null], m: [26.67, 34.81, null, null]};
s[2808] = {l: 'ПМГ', n: 'ПМГ Атанас Радев', b: [42.28, 79.28, 70.66, 77.64], m: [50.14, 71.47, 64.47, 71.67]};
s[2809] = {l: 'Спортно у-ще', n: 'Спортно у-ще Пиер дьо Кубертен', b: [19.03, 25.02, 30.07, 40.89], m: [11.88, 15.52, 20.64, 22.31]};
s[2810] = {l: 'СУ Св. Кл. Охридски', n: 'СУ Св. Климент Охридски', b: [30.93, 44.77, 42.0, 43.65], m: [24.04, 18.85, 22.12, 21.09]};
