let s = [];
// София
s[2] = {l: '2 СУ', n: '2 СУ Акад. Емилиян Станев', b: [68.40, 43.09, 73.20, 73.12], m: [46.74, 41.01, 49.74, 48.59]};
s[6] = {l: '6 ОУ', n: '6 ОУ Граф Игнатиев', b: [70.35, 47.13, 78.34, 73.90], m: [46.02, 43.28, 59.54, 57.55]};
s[7] = {l: '7 СУ', n: '7 СУ Св. Седмочисленици', b: [68.99, 45.16, 71.72, 69.47], m: [65.42, 46.88, 57.11, 55.40]};
s[17] = {l: '17 СУ', n: '17 СУ Дамян Груев', b: [62.42, 40.82, 67.79, 63.36], m: [39.39, 36.44, 46.73, 42.64]};
s[18] = {l: '18 СУ', n: '18 СУ Уилям Гладстон', b: [71.30, 45.19, 76.20, 73.21], m: [51.92, 45.45, 51.45, 56.26]};
s[19] = {l: '19 СУ', n: '19 СУ Елин Пелин', b: [67.01, 45.16, 74.97, 73.45], m: [54.82, 48.86, 54.15, 64.14]};
s[20] = {l: '20 ОУ', n: '20 ОУ Тодор Минков', b: [79.11, 50.23, 82.74, 79.19], m: [66.76, 52.12, 61.89, 65.92]};
s[22] = {l: '22 СУ', n: '22 СЕУ Георги С. Раковски', b: [68.41, 45.52, 71.32, 71.93], m: [53.24, 45.24, 55.56, 58.89]};
s[31] = {l: '31 СУ', n: '31 СУЧЕМ Иван Вазов', b: [69.18, 46.18, 74.85, 75.15], m: [60.46, 48.15, 58.94, 60.83]};
s[32] = {l: '32 СУ', n: '32 СУ Св. Климент Охридски', b: [69.47, 47.72, 76.87, 79.44], m: [55.11, 47.85, 61.45, 63.02]};
s[35] = {l: '35 СУ', n: '35 СУ Добри Войников', b: [71.44, 44.33, 75.48, 70.17], m: [55.83, 40.95, 58.28, 59.95]};
s[36] = {l: '36 СУ', n: '36 СУ Максим Горки', b: [68.79, 45.91, 71.93, 70.20], m: [49.84, 47.64, 50.83, 52.53]};
s[38] = {l: '38 ОУ', n: '38 ОУ Васил Априлов', b: [74.04, 44.71, 77.78, 71.77], m: [61.09, 45.42, 62.22, 60.97]};
s[41] = {l: '41 ОУ', n: '41 ОУ Св. Патриарх Евтимий', b: [68.12, 43.57, 70.10, 74.45], m: [58.95, 46.17, 52.34, 64.37]};
s[43] = {l: '43 ОУ', n: '43 ОУ Христо Смирненски', b: [64.09, 39.65, 68.14, 63.00], m: [43.89, 33.78, 39.83, 38.81]};
s[51] = {l: '51 СУ', n: '51 СУ Елисавета Багряна', b: [68.19, 44.76, 74.43, 72.85], m: [52.37, 44.91, 57.24, 55.61]};
s[55] = {l: '55 СУ', n: '55 СУ Петко Каравелов', b: [72.31, 44.76, 72.25, 71.90], m: [62.16, 46.28, 58.13, 60.56]};
s[73] = {l: '73 СУ', n: '73 СУ Владислав Граматик', b: [76.16, 48.89, 82.02, 80.39], m: [67.05, 49.31, 69.19, 72.23]};
s[104] = {l: '104 ОУ', n: '104 ОУ Захари Стоянов', b: [67.22, 43.38, 75.91, 72.21], m: [56.40, 41.10, 52.62, 59.79]};
s[107] = {l: '107 ОУ', n: '107 ОУ Хан Крум', b: [75.37, 49.55, 80.41, 79.85], m: [76.16, 54.27, 73.32, 75.23]};
s[119] = {l: '119 СУ', n: '119 СУ Акад. М. Арнаудов', b: [72.02, 43.74, 72.87, 74.34], m: [55.13, 46.10, 56.33, 61.40]};
s[120] = {l: '120 ОУ', n: '120 ОУ Георги С. Раковски', b: [76.90, 43.75, 73.44, 73.86], m: [61.65, 46.31, 60.91, 57.01]};
s[122] = {l: '122 ОУ', n: '122 ОУ Николай Лилиев', b: [63.78, 43.37, 72.37, 70.50], m: [50.18, 46.00, 52.00, 59.14]};
s[129] = {l: '129 ОУ', n: '129 ОУ Антим I', b: [68.45, 42.42, 73.45, 72.43], m: [51.66, 41.96, 48.71, 52.97]};
s[125] = {l: '125 СУ', n: '125 СУ Проф. Боян Пенев', b: [75.32, 48.65, 78.34, 75.92], m: [65.18, 49.49, 62.57, 65.20]};
s[133] = {l: '133 СУ', n: '133 СУ А. С. Пушкин', b: [71.79, 47.17, 78.87, 76.68], m: [51.17, 47.70, 56.81, 60.44]};
s[134] = {l: '134 СУ', n: '134 СУ Димчо Дебелянов', b: [71.96, 45.52, 73.97, 74.68], m: [57.36, 48.72, 55.70, 62.90]};
s[143] = {l: '143 ОУ', n: '143 ОУ Георги Бенковски', b: [66.46, 44.56, 70.00, 67.70], m: [51.43, 46.62, 54.02, 54.27]};
s[145] = {l: '145 ОУ', n: '145 ОУ Симеон Радев', b: [78.02, 51.85, 85.39, 80.68], m: [73.54, 58.12, 71.05, 72.56]};

s[201] = {l: 'СМГ', n: 'СМГ Паисий Хилендарски', b: [84.26, 55.64, 90.13, 88.46], m: [96.07, 63.64, 94.93, 94.46]};
s[202] = {l: 'НУКК', n: 'НУКК (Италиански лицей)', b: [74.31, null, 77.54, 79.61], m: [59.95, null, 68.06, 61.92]};

s[301] = {l: 'Азбуки', n: 'ЧОУ Азбуки', b: [null, null, 77.28, 80.26], m: [null, null, 55.72, 64.77]};
s[302] = {l: 'Българско школо', n: 'ЧСУ Българско школо', b: [77.06, 47.36, 78.45, 78.45], m: [50.17, 49.36, 56.23, 68.56]};
s[303] = {l: 'ВЕДА', n: 'ЧУ ВЕДА', b: [74.94, 48.88, 83.28, 80.39], m: [74.89, 54.00, 78.76, 73.34]};
s[304] = {l: 'Дорис Тенеди', n: 'ЧЕСУ Дорис Тенеди', b: [75.33, 47.56, 81.50, 77.37], m: [56.48, 48.61, 68.98, 57.63]};
s[305] = {l: 'Ерих Кестнер', n: 'ЧУ Ерих Кестнер', b: [73.13, 46.18, 76.28, 80.14], m: [60.25, 48.43, 60.91, 69.86]};
s[306] = {l: 'ЕСПА', n: 'ЧСЕУ ЕСПА', b: [78.18, 52, 78.97, 81.24], m: [55.43, 52.20, 68.94, 84.71]};
s[307] = {l: 'Меридиан 22', n: 'ЧУ Меридиан 22', b: [80.50, 48.67, 80.69, 73.95], m: [59.34, 47.00, 56.70, 57.80]};
s[308] = {l: 'Петър Берон', n: 'ЧОУ Д-р Петър Берон', b: [76.97, 41.11, 76.32, 74.18], m: [57.06, 47.07, 63.89, 61.15]};
s[309] = {l: 'ПЧМГ', n: 'Първа Частна МГ', b: [85.50, 53.49, 86.64, 84.62], m: [91.64, 63.11, 90.95, 95.21]};
s[310] = {l: 'Св. Георги', n: 'ЧСУ Св. Георги', b: [67.84, 41.38, 73.94, 65.79], m: [49.91, 45.44, 50.16, 52.74]};
s[311] = {l: 'Св. Климент Охридски', n: 'ЧОУ Св. Климент Охридски', b: [72.96, 51.58, 80.50, 82.88], m: [65.85, 57.50, 59.04, 84.78]};
s[312] = {l: 'Св. София', n: 'ЧОУ Св. София', b: [83.86, 56.10, 89.75, 89.23], m: [87.83, 62.75, 87.66, 89.90]};
s[313] = {l: 'Увекинд', n: 'ЧСУ Увеинд', b: [63.48, 43.34, 72.77, 70.78], m: [44.01, 46.86, 52.92, 54.15]};
s[314] = {l: 'Цар Симеон Велики', n: 'ЧСУ Цар Симеон Велики', b: [80.07, 46.19, 73.15, 67.00], m: [67.71, 46.00, 62.68, 57.15]};

// Пловдив
s[351] = {l: 'МГ Акад. Кирил Попов', n: 'МГ Акад. Кирил Попов', b: [null, 55.67, 90.84, 90.11], m: [null, 63.87, 94.25, 92.26]};
s[352] = {l: 'НУМТИ Добрин Петков', n: 'НУМТИ Добрин Петков', b: [null, 40.64, 69.86, 67.44], m: [null, 31.31, 36.48, 38.55]};
s[353] = {l: 'Алеко Константинов', n: 'ОУ Алеко Константинов', b: [null, 46.66, 75.38, 74.79], m: [null, 43.68, 54.37, 61.02]};
s[354] = {l: 'Васил Левски', n: 'ОУ Васил Левски', b: [null, 40.64, 70.08, 65.93], m: [null, 37.66, 53.32, 45.62]};
s[355] = {l: 'Васил Петлешков', n: 'ОУ Васил Петлешков', b: [null, 37.88, 67.77, 64.34], m: [null, 38.11, 44.66, 42.44]};
s[356] = {l: 'Димитър Димов', n: 'ОУ Димитър Димов', b: [null, 20.92, 48.52, 60.26], m: [null, 23.22, 33.26, 46.25]};
s[357] = {l: 'Душо Хаджидеков', n: 'ОУ Душо Хаджидеков', b: [null, 46.36, 72, 74.13], m: [null, 45.58, 52.88, 62.64]};
s[358] = {l: 'Екзарх Антим I', n: 'ОУ Екзарх Антим I', b: [null, 43.62, 65.14, 70.65], m: [null, 44.69, 45.41, 60.12]};
s[359] = {l: 'Княз Александър I', n: 'ОУ Княз Александър I', b: [null, 45.66, 79.99, 73.46], m: [null, 46.59, 57.86, 54.66]};
s[360] = {l: 'Кочо Честеменски', n: 'ОУ Кочо Честеменски', b: [null, 43.77, 79.99, 69.47], m: [null, 41.18, 57.86, 46.50]};
s[361] = {l: 'Никола Вапцаров', n: 'СУ Никола Вапцаров', b: [null, 35.93, 58.05, 62.78], m: [null, 30.30, 31.92, 47.97]};
s[362] = {l: 'Патриарх Евтимий', n: 'СУ Св. Патриарх Евтимий', b: [null, 48.11, 79.27, 77.65], m: [null, 52.13, 67.79, 65.53]};
s[363] = {l: 'Райна Княгиня', n: 'ОУ Райна Княгиня', b: [null, 45.42, 70.97, 69.16], m: [null, 47.44, 51.17, 52.48]};
s[364] = {l: 'Тютюнджян', n: 'ОУ Тютюнджян', b: [null, 39.72, 70.27, 64.36], m: [null, 34.49, 45.29, 49.30]};
s[365] = {l: 'Черноризец Храбър', n: 'СУ Черноризец Храбър', b: [null, 44.72, 59.50, 72.82], m: [null, 38.63, 37.24, 49.40]};
s[366] = {l: 'Яне Сандански', n: 'ОУ Яне Сандански', b: [null, 41.35, 69.09, 64.66], m: [null, 39.67, 48.33, 47.03]};

s[371] = {l: 'Бъдеще', n: 'ЧОУ Бъдеще', b: [null, 35.35, 60.31, 71.56], m: [null, 29.92, 33.94, 59.42]};
s[372] = {l: 'Дружба', n: 'ЧСУ Дружба', b: [null, 36.31, 63.01, 67.59], m: [null, 34.00, 38.15, 61.30]};
s[373] = {l: 'Класик', n: 'ЧОУ Класик', b: [null, 41.55, 59.42, 54.17], m: [null, 36.80, 24.75, 34.50]};

// Варна
s[381] = {l: 'МГ Д-р Петър Берон', n: 'МГ Д-р Петър Берон', b: [null, 54.89, 89.93, 90.43], m: [null, 64.38, 96.13, 96.45]};
s[382] = {l: 'Васил Друмев', n: 'ОУ Васил Друмев', b: [null, 36.91, 62.23, 63.19], m: [null, 36.56, 38.79, 52.55]};
s[383] = {l: 'Гео Милев', n: 'СУ Гео Милев', b: [null, 41.79, 69.92, 69.26], m: [null, 43.93, 53.67, 54.13]};
s[384] = {l: 'Георги Раковски', n: 'ОУ Георги С. Раковски', b: [null, 41.58, 71.76, 70.79], m: [null, 44.42, 52.61, 52.09]};
s[385] = {l: 'Захари Стоянов', n: 'ОУ Захари Стоянов', b: [null, 45.34, 77.58, 75.40], m: [null, 47.01, 59.59, 64.34]};
s[386] = {l: 'Кирил и Методий', n: 'ОУ Св. св. Кирил и Методий', b: [null, 46.13, 78.23, 77.18], m: [null, 50.66, 62.77, 64.92]};
s[387] = {l: 'Климент Охридски', n: 'СУ Св. Климент Охридски', b: [null, 44.04, 75.19, 73.87], m: [null, 42.39, 59.07, 61.28]};
s[388] = {l: 'Найден Геров', n: 'VII СУ Найден Геров', b: [null, 44.02, 72.45, 72.27], m: [null, 49.19, 60.80, 67.09]};
s[389] = {l: 'Петко Славейков', n: 'ОУ Петко Р. Славейков', b: [null, 47.92, 75.19, 75.40], m: [null, 50.84, 65.51, 71.54]};
s[390] = {l: 'Пушкин', n: 'СУЕО Ал. С. Пушкин', b: [null, 46.38, 73.41, 75.90], m: [null, 50.17, 54.38, 60.93]};
s[391] = {l: 'Черноризец храбър', n: 'ОУ Черноризец храбър', b: [null, 38.14, 67.68, 70.47], m: [null, 38.85, 52.56, 52.52]};

s[401] = {l: 'Аз съм българче', n: 'ЧСУ Аз съм българче', b: [null, null, 44.50, 46.79], m: [null, null, 11, 28.64]};
s[402] = {l: 'Малкият принц', n: 'ЧОУ Малкият принц', b: [null, 43.17, 75.22, 66.14], m: [null, 38.59, 49.53, 48.57]};
s[403] = {l: 'Мечтатели', n: 'ЧСУ Мечтатели', b: [null, 30.88, 59.77, 60.69], m: [null, 25.12, 28.86, 55.25]};
